nrfconnect/sdk-hal_nordic/nrfx/bsp/stable/mdk/nrf54lm20a_enga_types.h
/* TASKS_XOTUNE @Bit 0 : Request tuning for HFXO */
  #define CLOCK_TASKS_XOTUNE_TASKS_XOTUNE_Pos (0UL)  /*!< Position of TASKS_XOTUNE field.                                      */
  #define CLOCK_TASKS_XOTUNE_TASKS_XOTUNE_Msk (0x1UL << CLOCK_TASKS_XOTUNE_TASKS_XOTUNE_Pos) /*!< Bit mask of TASKS_XOTUNE
                                                                            field.*/
  #define CLOCK_TASKS_XOTUNE_TASKS_XOTUNE_Min (0x1UL) /*!< Min enumerator value of TASKS_XOTUNE field.                         */
  #define CLOCK_TASKS_XOTUNE_TASKS_XOTUNE_Max (0x1UL) /*!< Max enumerator value of TASKS_XOTUNE field.                         */
  #define CLOCK_TASKS_XOTUNE_TASKS_XOTUNE_Trigger (0x1UL) /*!< Trigger task                                                    */


/* CLOCK_TASKS_XOTUNEABORT: Abort tuning for HFXO */
  #define CLOCK_TASKS_XOTUNEABORT_ResetValue (0x00000000UL) /*!< Reset value of TASKS_XOTUNEABORT register.                    */

/* TASKS_XOTUNEABORT @Bit 0 : Abort tuning for HFXO */
  #define CLOCK_TASKS_XOTUNEABORT_TASKS_XOTUNEABORT_Pos (0UL) /*!< Position of TASKS_XOTUNEABORT field.                        */
  #define CLOCK_TASKS_XOTUNEABORT_TASKS_XOTUNEABORT_Msk (0x1UL << CLOCK_TASKS_XOTUNEABORT_TASKS_XOTUNEABORT_Pos) /*!< Bit mask
                                                                            of TASKS_XOTUNEABORT field.*/
  #define CLOCK_TASKS_XOTUNEABORT_TASKS_XOTUNEABORT_Min (0x1UL) /*!< Min enumerator value of TASKS_XOTUNEABORT field.          */
  #define CLOCK_TASKS_XOTUNEABORT_TASKS_XOTUNEABORT_Max (0x1UL) /*!< Max enumerator value of TASKS_XOTUNEABORT field.          */
  #define CLOCK_TASKS_XOTUNEABORT_TASKS_XOTUNEABORT_Trigger (0x1UL) /*!< Trigger task                                          */


/* CLOCK_TASKS_XO24MSTART: Request HFXO to provide a crystal clock for PCLK24M */
  #define CLOCK_TASKS_XO24MSTART_ResetValue (0x00000000UL) /*!< Reset value of TASKS_XO24MSTART register.                      */

/* TASKS_XO24MSTART @Bit 0 : Request HFXO to provide a crystal clock for PCLK24M */
  #define CLOCK_TASKS_XO24MSTART_TASKS_XO24MSTART_Pos (0UL) /*!< Position of TASKS_XO24MSTART field.                           */
  #define CLOCK_TASKS_XO24MSTART_TASKS_XO24MSTART_Msk (0x1UL << CLOCK_TASKS_XO24MSTART_TASKS_XO24MSTART_Pos) /*!< Bit mask of
                                                                            TASKS_XO24MSTART field.*/
  #define CLOCK_TASKS_XO24MSTART_TASKS_XO24MSTART_Min (0x1UL) /*!< Min enumerator value of TASKS_XO24MSTART field.             */
  #define CLOCK_TASKS_XO24MSTART_TASKS_XO24MSTART_Max (0x1UL) /*!< Max enumerator value of TASKS_XO24MSTART field.             */
  #define CLOCK_TASKS_XO24MSTART_TASKS_XO24MSTART_Trigger (0x1UL) /*!< Trigger task                                            */


/* CLOCK_TASKS_XO24MSTOP: Stop request HFXO for PCLK24M. When all requests for HFXO are stopped, HFXO will also stop. */
  #define CLOCK_TASKS_XO24MSTOP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_XO24MSTOP register.                        */

/* TASKS_XO24MSTOP @Bit 0 : Stop request HFXO for PCLK24M. When all requests for HFXO are stopped, HFXO will also stop. */
  #define CLOCK_TASKS_XO24MSTOP_TASKS_XO24MSTOP_Pos (0UL) /*!< Position of TASKS_XO24MSTOP field.                              */
  #define CLOCK_TASKS_XO24MSTOP_TASKS_XO24MSTOP_Msk (0x1UL << CLOCK_TASKS_XO24MSTOP_TASKS_XO24MSTOP_Pos) /*!< Bit mask of
                                                                            TASKS_XO24MSTOP field.*/
  #define CLOCK_TASKS_XO24MSTOP_TASKS_XO24MSTOP_Min (0x1UL) /*!< Min enumerator value of TASKS_XO24MSTOP field.                */
  #define CLOCK_TASKS_XO24MSTOP_TASKS_XO24MSTOP_Max (0x1UL) /*!< Max enumerator value of TASKS_XO24MSTOP field.                */
  #define CLOCK_TASKS_XO24MSTOP_TASKS_XO24MSTOP_Trigger (0x1UL) /*!< Trigger task                                              */


/* CLOCK_SUBSCRIBE_XOSTART: Subscribe configuration for task XOSTART */
  #define CLOCK_SUBSCRIBE_XOSTART_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_XOSTART register.                    */

/* CHIDX @Bits 0..7 : DPPI channel that task XOSTART will subscribe to */
  #define CLOCK_SUBSCRIBE_XOSTART_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define CLOCK_SUBSCRIBE_XOSTART_CHIDX_Msk (0xFFUL << CLOCK_SUBSCRIBE_XOSTART_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define CLOCK_SUBSCRIBE_XOSTART_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                            */
  #define CLOCK_SUBSCRIBE_XOSTART_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define CLOCK_SUBSCRIBE_XOSTART_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define CLOCK_SUBSCRIBE_XOSTART_EN_Msk (0x1UL << CLOCK_SUBSCRIBE_XOSTART_EN_Pos) /*!< Bit mask of EN field.                  */
  #define CLOCK_SUBSCRIBE_XOSTART_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define CLOCK_SUBSCRIBE_XOSTART_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define CLOCK_SUBSCRIBE_XOSTART_EN_Disabled (0x0UL) /*!< Disable subscription                                                */
  #define CLOCK_SUBSCRIBE_XOSTART_EN_Enabled (0x1UL) /*!< Enable subscription                                                  */


/* CLOCK_SUBSCRIBE_XOSTOP: Subscribe configuration for task XOSTOP */
  #define CLOCK_SUBSCRIBE_XOSTOP_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_XOSTOP register.                      */

/* CHIDX @Bits 0..7 : DPPI channel that task XOSTOP will subscribe to */
  #define CLOCK_SUBSCRIBE_XOSTOP_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define CLOCK_SUBSCRIBE_XOSTOP_CHIDX_Msk (0xFFUL << CLOCK_SUBSCRIBE_XOSTOP_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define CLOCK_SUBSCRIBE_XOSTOP_CHIDX_Min (0x00UL)  /*!< Min value of CHIDX field.                                            */
  #define CLOCK_SUBSCRIBE_XOSTOP_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define CLOCK_SUBSCRIBE_XOSTOP_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define CLOCK_SUBSCRIBE_XOSTOP_EN_Msk (0x1UL << CLOCK_SUBSCRIBE_XOSTOP_EN_Pos) /*!< Bit mask of EN field.                    */
  #define CLOCK_SUBSCRIBE_XOSTOP_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define CLOCK_SUBSCRIBE_XOSTOP_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define CLOCK_SUBSCRIBE_XOSTOP_EN_Disabled (0x0UL) /*!< Disable subscription                                                 */
  #define CLOCK_SUBSCRIBE_XOSTOP_EN_Enabled (0x1UL)  /*!< Enable subscription                                                  */


/* CLOCK_SUBSCRIBE_PLLSTART: Subscribe configuration for task PLLSTART */
  #define CLOCK_SUBSCRIBE_PLLSTART_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_PLLSTART register.                  */

/* CHIDX @Bits 0..7 : DPPI channel that task PLLSTART will subscribe to */
  #define CLOCK_SUBSCRIBE_PLLSTART_CHIDX_Pos (0UL)   /*!< Position of CHIDX field.                                             */
  #define CLOCK_SUBSCRIBE_PLLSTART_CHIDX_Msk (0xFFUL << CLOCK_SUBSCRIBE_PLLSTART_CHIDX_Pos) /*!< Bit mask of CHIDX field.      */
  #define CLOCK_SUBSCRIBE_PLLSTART_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                           */
  #define CLOCK_SUBSCRIBE_PLLSTART_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                            */

/* EN @Bit 31 : (unspecified) */
  #define CLOCK_SUBSCRIBE_PLLSTART_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define CLOCK_SUBSCRIBE_PLLSTART_EN_Msk (0x1UL << CLOCK_SUBSCRIBE_PLLSTART_EN_Pos) /*!< Bit mask of EN field.                */
  #define CLOCK_SUBSCRIBE_PLLSTART_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define CLOCK_SUBSCRIBE_PLLSTART_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define CLOCK_SUBSCRIBE_PLLSTART_EN_Disabled (0x0UL) /*!< Disable subscription                                               */
  #define CLOCK_SUBSCRIBE_PLLSTART_EN_Enabled (0x1UL) /*!< Enable subscription                                                 */


/* CLOCK_SUBSCRIBE_PLLSTOP: Subscribe configuration for task PLLSTOP */
  #define CLOCK_SUBSCRIBE_PLLSTOP_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_PLLSTOP register.                    */

/* CHIDX @Bits 0..7 : DPPI channel that task PLLSTOP will subscribe to */
  #define CLOCK_SUBSCRIBE_PLLSTOP_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define CLOCK_SUBSCRIBE_PLLSTOP_CHIDX_Msk (0xFFUL << CLOCK_SUBSCRIBE_PLLSTOP_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define CLOCK_SUBSCRIBE_PLLSTOP_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                            */
  #define CLOCK_SUBSCRIBE_PLLSTOP_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define CLOCK_SUBSCRIBE_PLLSTOP_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define CLOCK_SUBSCRIBE_PLLSTOP_EN_Msk (0x1UL << CLOCK_SUBSCRIBE_PLLSTOP_EN_Pos) /*!< Bit mask of EN field.                  */
  #define CLOCK_SUBSCRIBE_PLLSTOP_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define CLOCK_SUBSCRIBE_PLLSTOP_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define CLOCK_SUBSCRIBE_PLLSTOP_EN_Disabled (0x0UL) /*!< Disable subscription                                                */
  #define CLOCK_SUBSCRIBE_PLLSTOP_EN_Enabled (0x1UL) /*!< Enable subscription                                                  */


/* CLOCK_SUBSCRIBE_LFCLKSTART: Subscribe configuration for task LFCLKSTART */
  #define CLOCK_SUBSCRIBE_LFCLKSTART_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_LFCLKSTART register.              */

/* CHIDX @Bits 0..7 : DPPI channel that task LFCLKSTART will subscribe to */
  #define CLOCK_SUBSCRIBE_LFCLKSTART_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                             */
  #define CLOCK_SUBSCRIBE_LFCLKSTART_CHIDX_Msk (0xFFUL << CLOCK_SUBSCRIBE_LFCLKSTART_CHIDX_Pos) /*!< Bit mask of CHIDX field.  */
  #define CLOCK_SUBSCRIBE_LFCLKSTART_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                         */
  #define CLOCK_SUBSCRIBE_LFCLKSTART_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                          */

/* EN @Bit 31 : (unspecified) */
  #define CLOCK_SUBSCRIBE_LFCLKSTART_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define CLOCK_SUBSCRIBE_LFCLKSTART_EN_Msk (0x1UL << CLOCK_SUBSCRIBE_LFCLKSTART_EN_Pos) /*!< Bit mask of EN field.            */
  #define CLOCK_SUBSCRIBE_LFCLKSTART_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define CLOCK_SUBSCRIBE_LFCLKSTART_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define CLOCK_SUBSCRIBE_LFCLKSTART_EN_Disabled (0x0UL) /*!< Disable subscription                                             */
  #define CLOCK_SUBSCRIBE_LFCLKSTART_EN_Enabled (0x1UL) /*!< Enable subscription                                               */


/* CLOCK_SUBSCRIBE_LFCLKSTOP: Subscribe configuration for task LFCLKSTOP */
  #define CLOCK_SUBSCRIBE_LFCLKSTOP_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_LFCLKSTOP register.                */

/* CHIDX @Bits 0..7 : DPPI channel that task LFCLKSTOP will subscribe to */
  #define CLOCK_SUBSCRIBE_LFCLKSTOP_CHIDX_Pos (0UL)  /*!< Position of CHIDX field.                                             */
  #define CLOCK_SUBSCRIBE_LFCLKSTOP_CHIDX_Msk (0xFFUL << CLOCK_SUBSCRIBE_LFCLKSTOP_CHIDX_Pos) /*!< Bit mask of CHIDX field.    */
  #define CLOCK_SUBSCRIBE_LFCLKSTOP_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                          */
  #define CLOCK_SUBSCRIBE_LFCLKSTOP_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                           */

/* EN @Bit 31 : (unspecified) */
  #define CLOCK_SUBSCRIBE_LFCLKSTOP_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define CLOCK_SUBSCRIBE_LFCLKSTOP_EN_Msk (0x1UL << CLOCK_SUBSCRIBE_LFCLKSTOP_EN_Pos) /*!< Bit mask of EN field.              */
  #define CLOCK_SUBSCRIBE_LFCLKSTOP_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define CLOCK_SUBSCRIBE_LFCLKSTOP_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define CLOCK_SUBSCRIBE_LFCLKSTOP_EN_Disabled (0x0UL) /*!< Disable subscription                                              */
  #define CLOCK_SUBSCRIBE_LFCLKSTOP_EN_Enabled (0x1UL) /*!< Enable subscription                                                */


/* CLOCK_SUBSCRIBE_CAL: Subscribe configuration for task CAL */
  #define CLOCK_SUBSCRIBE_CAL_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_CAL register.                            */

/* CHIDX @Bits 0..7 : DPPI channel that task CAL will subscribe to */
  #define CLOCK_SUBSCRIBE_CAL_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define CLOCK_SUBSCRIBE_CAL_CHIDX_Msk (0xFFUL << CLOCK_SUBSCRIBE_CAL_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define CLOCK_SUBSCRIBE_CAL_CHIDX_Min (0x00UL)     /*!< Min value of CHIDX field.                                            */
  #define CLOCK_SUBSCRIBE_CAL_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define CLOCK_SUBSCRIBE_CAL_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define CLOCK_SUBSCRIBE_CAL_EN_Msk (0x1UL << CLOCK_SUBSCRIBE_CAL_EN_Pos) /*!< Bit mask of EN field.                          */
  #define CLOCK_SUBSCRIBE_CAL_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define CLOCK_SUBSCRIBE_CAL_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define CLOCK_SUBSCRIBE_CAL_EN_Disabled (0x0UL)    /*!< Disable subscription                                                 */
  #define CLOCK_SUBSCRIBE_CAL_EN_Enabled (0x1UL)     /*!< Enable subscription                                                  */


/* CLOCK_SUBSCRIBE_XOTUNE: Subscribe configuration for task XOTUNE */
  #define CLOCK_SUBSCRIBE_XOTUNE_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_XOTUNE register.                      */

/* CHIDX @Bits 0..7 : DPPI channel that task XOTUNE will subscribe to */
  #define CLOCK_SUBSCRIBE_XOTUNE_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define CLOCK_SUBSCRIBE_XOTUNE_CHIDX_Msk (0xFFUL << CLOCK_SUBSCRIBE_XOTUNE_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define CLOCK_SUBSCRIBE_XOTUNE_CHIDX_Min (0x00UL)  /*!< Min value of CHIDX field.                                            */
  #define CLOCK_SUBSCRIBE_XOTUNE_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define CLOCK_SUBSCRIBE_XOTUNE_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define CLOCK_SUBSCRIBE_XOTUNE_EN_Msk (0x1UL << CLOCK_SUBSCRIBE_XOTUNE_EN_Pos) /*!< Bit mask of EN field.                    */
  #define CLOCK_SUBSCRIBE_XOTUNE_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define CLOCK_SUBSCRIBE_XOTUNE_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define CLOCK_SUBSCRIBE_XOTUNE_EN_Disabled (0x0UL) /*!< Disable subscription                                                 */
  #define CLOCK_SUBSCRIBE_XOTUNE_EN_Enabled (0x1UL)  /*!< Enable subscription                                                  */


/* CLOCK_SUBSCRIBE_XOTUNEABORT: Subscribe configuration for task XOTUNEABORT */
  #define CLOCK_SUBSCRIBE_XOTUNEABORT_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_XOTUNEABORT register.            */

/* CHIDX @Bits 0..7 : DPPI channel that task XOTUNEABORT will subscribe to */
  #define CLOCK_SUBSCRIBE_XOTUNEABORT_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                            */
  #define CLOCK_SUBSCRIBE_XOTUNEABORT_CHIDX_Msk (0xFFUL << CLOCK_SUBSCRIBE_XOTUNEABORT_CHIDX_Pos) /*!< Bit mask of CHIDX field.*/
  #define CLOCK_SUBSCRIBE_XOTUNEABORT_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                        */
  #define CLOCK_SUBSCRIBE_XOTUNEABORT_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                         */

/* EN @Bit 31 : (unspecified) */
  #define CLOCK_SUBSCRIBE_XOTUNEABORT_EN_Pos (31UL)  /*!< Position of EN field.                                                */
  #define CLOCK_SUBSCRIBE_XOTUNEABORT_EN_Msk (0x1UL << CLOCK_SUBSCRIBE_XOTUNEABORT_EN_Pos) /*!< Bit mask of EN field.          */
  #define CLOCK_SUBSCRIBE_XOTUNEABORT_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                    */
  #define CLOCK_SUBSCRIBE_XOTUNEABORT_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                    */
  #define CLOCK_SUBSCRIBE_XOTUNEABORT_EN_Disabled (0x0UL) /*!< Disable subscription                                            */
  #define CLOCK_SUBSCRIBE_XOTUNEABORT_EN_Enabled (0x1UL) /*!< Enable subscription                                              */


/* CLOCK_SUBSCRIBE_XO24MSTART: Subscribe configuration for task XO24MSTART */
  #define CLOCK_SUBSCRIBE_XO24MSTART_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_XO24MSTART register.              */

/* CHIDX @Bits 0..7 : DPPI channel that task XO24MSTART will subscribe to */
  #define CLOCK_SUBSCRIBE_XO24MSTART_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                             */
  #define CLOCK_SUBSCRIBE_XO24MSTART_CHIDX_Msk (0xFFUL << CLOCK_SUBSCRIBE_XO24MSTART_CHIDX_Pos) /*!< Bit mask of CHIDX field.  */
  #define CLOCK_SUBSCRIBE_XO24MSTART_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                         */
  #define CLOCK_SUBSCRIBE_XO24MSTART_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                          */

/* EN @Bit 31 : (unspecified) */
  #define CLOCK_SUBSCRIBE_XO24MSTART_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define CLOCK_SUBSCRIBE_XO24MSTART_EN_Msk (0x1UL << CLOCK_SUBSCRIBE_XO24MSTART_EN_Pos) /*!< Bit mask of EN field.            */
  #define CLOCK_SUBSCRIBE_XO24MSTART_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define CLOCK_SUBSCRIBE_XO24MSTART_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define CLOCK_SUBSCRIBE_XO24MSTART_EN_Disabled (0x0UL) /*!< Disable subscription                                             */
  #define CLOCK_SUBSCRIBE_XO24MSTART_EN_Enabled (0x1UL) /*!< Enable subscription                                               */


/* CLOCK_SUBSCRIBE_XO24MSTOP: Subscribe configuration for task XO24MSTOP */
  #define CLOCK_SUBSCRIBE_XO24MSTOP_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_XO24MSTOP register.                */

/* CHIDX @Bits 0..7 : DPPI channel that task XO24MSTOP will subscribe to */
  #define CLOCK_SUBSCRIBE_XO24MSTOP_CHIDX_Pos (0UL)  /*!< Position of CHIDX field.                                             */
  #define CLOCK_SUBSCRIBE_XO24MSTOP_CHIDX_Msk (0xFFUL << CLOCK_SUBSCRIBE_XO24MSTOP_CHIDX_Pos) /*!< Bit mask of CHIDX field.    */
  #define CLOCK_SUBSCRIBE_XO24MSTOP_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                          */
  #define CLOCK_SUBSCRIBE_XO24MSTOP_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                           */

/* EN @Bit 31 : (unspecified) */
  #define CLOCK_SUBSCRIBE_XO24MSTOP_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define CLOCK_SUBSCRIBE_XO24MSTOP_EN_Msk (0x1UL << CLOCK_SUBSCRIBE_XO24MSTOP_EN_Pos) /*!< Bit mask of EN field.              */
  #define CLOCK_SUBSCRIBE_XO24MSTOP_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define CLOCK_SUBSCRIBE_XO24MSTOP_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define CLOCK_SUBSCRIBE_XO24MSTOP_EN_Disabled (0x0UL) /*!< Disable subscription                                              */
  #define CLOCK_SUBSCRIBE_XO24MSTOP_EN_Enabled (0x1UL) /*!< Enable subscription                                                */


/* CLOCK_EVENTS_XOSTARTED: Crystal oscillator has started */
  #define CLOCK_EVENTS_XOSTARTED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_XOSTARTED register.                      */

/* EVENTS_XOSTARTED @Bit 0 : Crystal oscillator has started */
  #define CLOCK_EVENTS_XOSTARTED_EVENTS_XOSTARTED_Pos (0UL) /*!< Position of EVENTS_XOSTARTED field.                           */
  #define CLOCK_EVENTS_XOSTARTED_EVENTS_XOSTARTED_Msk (0x1UL << CLOCK_EVENTS_XOSTARTED_EVENTS_XOSTARTED_Pos) /*!< Bit mask of
                                                                            EVENTS_XOSTARTED field.*/
  #define CLOCK_EVENTS_XOSTARTED_EVENTS_XOSTARTED_Min (0x0UL) /*!< Min enumerator value of EVENTS_XOSTARTED field.             */
  #define CLOCK_EVENTS_XOSTARTED_EVENTS_XOSTARTED_Max (0x1UL) /*!< Max enumerator value of EVENTS_XOSTARTED field.             */
  #define CLOCK_EVENTS_XOSTARTED_EVENTS_XOSTARTED_NotGenerated (0x0UL) /*!< Event not generated                                */
  #define CLOCK_EVENTS_XOSTARTED_EVENTS_XOSTARTED_Generated (0x1UL) /*!< Event generated                                       */


/* CLOCK_EVENTS_PLLSTARTED: PLL started */
  #define CLOCK_EVENTS_PLLSTARTED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_PLLSTARTED register.                    */

/* EVENTS_PLLSTARTED @Bit 0 : PLL started */
  #define CLOCK_EVENTS_PLLSTARTED_EVENTS_PLLSTARTED_Pos (0UL) /*!< Position of EVENTS_PLLSTARTED field.                        */
  #define CLOCK_EVENTS_PLLSTARTED_EVENTS_PLLSTARTED_Msk (0x1UL << CLOCK_EVENTS_PLLSTARTED_EVENTS_PLLSTARTED_Pos) /*!< Bit mask
                                                                            of EVENTS_PLLSTARTED field.*/
  #define CLOCK_EVENTS_PLLSTARTED_EVENTS_PLLSTARTED_Min (0x0UL) /*!< Min enumerator value of EVENTS_PLLSTARTED field.          */
  #define CLOCK_EVENTS_PLLSTARTED_EVENTS_PLLSTARTED_Max (0x1UL) /*!< Max enumerator value of EVENTS_PLLSTARTED field.          */
  #define CLOCK_EVENTS_PLLSTARTED_EVENTS_PLLSTARTED_NotGenerated (0x0UL) /*!< Event not generated                              */
  #define CLOCK_EVENTS_PLLSTARTED_EVENTS_PLLSTARTED_Generated (0x1UL) /*!< Event generated                                     */


