nrfconnect/sdk-hal_nordic/nrfx/bsp/stable/mdk/nrf54lm20a_enga_types.h
/* XOSTARTED @Bit 0 : Enable or disable interrupt for event XOSTARTED */
  #define CLOCK_INTEN_XOSTARTED_Pos (0UL)            /*!< Position of XOSTARTED field.                                         */
  #define CLOCK_INTEN_XOSTARTED_Msk (0x1UL << CLOCK_INTEN_XOSTARTED_Pos) /*!< Bit mask of XOSTARTED field.                     */
  #define CLOCK_INTEN_XOSTARTED_Min (0x0UL)          /*!< Min enumerator value of XOSTARTED field.                             */
  #define CLOCK_INTEN_XOSTARTED_Max (0x1UL)          /*!< Max enumerator value of XOSTARTED field.                             */
  #define CLOCK_INTEN_XOSTARTED_Disabled (0x0UL)     /*!< Disable                                                              */
  #define CLOCK_INTEN_XOSTARTED_Enabled (0x1UL)      /*!< Enable                                                               */

/* PLLSTARTED @Bit 1 : Enable or disable interrupt for event PLLSTARTED */
  #define CLOCK_INTEN_PLLSTARTED_Pos (1UL)           /*!< Position of PLLSTARTED field.                                        */
  #define CLOCK_INTEN_PLLSTARTED_Msk (0x1UL << CLOCK_INTEN_PLLSTARTED_Pos) /*!< Bit mask of PLLSTARTED field.                  */
  #define CLOCK_INTEN_PLLSTARTED_Min (0x0UL)         /*!< Min enumerator value of PLLSTARTED field.                            */
  #define CLOCK_INTEN_PLLSTARTED_Max (0x1UL)         /*!< Max enumerator value of PLLSTARTED field.                            */
  #define CLOCK_INTEN_PLLSTARTED_Disabled (0x0UL)    /*!< Disable                                                              */
  #define CLOCK_INTEN_PLLSTARTED_Enabled (0x1UL)     /*!< Enable                                                               */

/* LFCLKSTARTED @Bit 2 : Enable or disable interrupt for event LFCLKSTARTED */
  #define CLOCK_INTEN_LFCLKSTARTED_Pos (2UL)         /*!< Position of LFCLKSTARTED field.                                      */
  #define CLOCK_INTEN_LFCLKSTARTED_Msk (0x1UL << CLOCK_INTEN_LFCLKSTARTED_Pos) /*!< Bit mask of LFCLKSTARTED field.            */
  #define CLOCK_INTEN_LFCLKSTARTED_Min (0x0UL)       /*!< Min enumerator value of LFCLKSTARTED field.                          */
  #define CLOCK_INTEN_LFCLKSTARTED_Max (0x1UL)       /*!< Max enumerator value of LFCLKSTARTED field.                          */
  #define CLOCK_INTEN_LFCLKSTARTED_Disabled (0x0UL)  /*!< Disable                                                              */
  #define CLOCK_INTEN_LFCLKSTARTED_Enabled (0x1UL)   /*!< Enable                                                               */

/* DONE @Bit 3 : Enable or disable interrupt for event DONE */
  #define CLOCK_INTEN_DONE_Pos (3UL)                 /*!< Position of DONE field.                                              */
  #define CLOCK_INTEN_DONE_Msk (0x1UL << CLOCK_INTEN_DONE_Pos) /*!< Bit mask of DONE field.                                    */
  #define CLOCK_INTEN_DONE_Min (0x0UL)               /*!< Min enumerator value of DONE field.                                  */
  #define CLOCK_INTEN_DONE_Max (0x1UL)               /*!< Max enumerator value of DONE field.                                  */
  #define CLOCK_INTEN_DONE_Disabled (0x0UL)          /*!< Disable                                                              */
  #define CLOCK_INTEN_DONE_Enabled (0x1UL)           /*!< Enable                                                               */

/* XOTUNED @Bit 4 : Enable or disable interrupt for event XOTUNED */
  #define CLOCK_INTEN_XOTUNED_Pos (4UL)              /*!< Position of XOTUNED field.                                           */
  #define CLOCK_INTEN_XOTUNED_Msk (0x1UL << CLOCK_INTEN_XOTUNED_Pos) /*!< Bit mask of XOTUNED field.                           */
  #define CLOCK_INTEN_XOTUNED_Min (0x0UL)            /*!< Min enumerator value of XOTUNED field.                               */
  #define CLOCK_INTEN_XOTUNED_Max (0x1UL)            /*!< Max enumerator value of XOTUNED field.                               */
  #define CLOCK_INTEN_XOTUNED_Disabled (0x0UL)       /*!< Disable                                                              */
  #define CLOCK_INTEN_XOTUNED_Enabled (0x1UL)        /*!< Enable                                                               */

/* XOTUNEERROR @Bit 5 : Enable or disable interrupt for event XOTUNEERROR */
  #define CLOCK_INTEN_XOTUNEERROR_Pos (5UL)          /*!< Position of XOTUNEERROR field.                                       */
  #define CLOCK_INTEN_XOTUNEERROR_Msk (0x1UL << CLOCK_INTEN_XOTUNEERROR_Pos) /*!< Bit mask of XOTUNEERROR field.               */
  #define CLOCK_INTEN_XOTUNEERROR_Min (0x0UL)        /*!< Min enumerator value of XOTUNEERROR field.                           */
  #define CLOCK_INTEN_XOTUNEERROR_Max (0x1UL)        /*!< Max enumerator value of XOTUNEERROR field.                           */
  #define CLOCK_INTEN_XOTUNEERROR_Disabled (0x0UL)   /*!< Disable                                                              */
  #define CLOCK_INTEN_XOTUNEERROR_Enabled (0x1UL)    /*!< Enable                                                               */

/* XOTUNEFAILED @Bit 6 : Enable or disable interrupt for event XOTUNEFAILED */
  #define CLOCK_INTEN_XOTUNEFAILED_Pos (6UL)         /*!< Position of XOTUNEFAILED field.                                      */
  #define CLOCK_INTEN_XOTUNEFAILED_Msk (0x1UL << CLOCK_INTEN_XOTUNEFAILED_Pos) /*!< Bit mask of XOTUNEFAILED field.            */
  #define CLOCK_INTEN_XOTUNEFAILED_Min (0x0UL)       /*!< Min enumerator value of XOTUNEFAILED field.                          */
  #define CLOCK_INTEN_XOTUNEFAILED_Max (0x1UL)       /*!< Max enumerator value of XOTUNEFAILED field.                          */
  #define CLOCK_INTEN_XOTUNEFAILED_Disabled (0x0UL)  /*!< Disable                                                              */
  #define CLOCK_INTEN_XOTUNEFAILED_Enabled (0x1UL)   /*!< Enable                                                               */

/* XO24MSTARTED @Bit 7 : Enable or disable interrupt for event XO24MSTARTED */
  #define CLOCK_INTEN_XO24MSTARTED_Pos (7UL)         /*!< Position of XO24MSTARTED field.                                      */
  #define CLOCK_INTEN_XO24MSTARTED_Msk (0x1UL << CLOCK_INTEN_XO24MSTARTED_Pos) /*!< Bit mask of XO24MSTARTED field.            */
  #define CLOCK_INTEN_XO24MSTARTED_Min (0x0UL)       /*!< Min enumerator value of XO24MSTARTED field.                          */
  #define CLOCK_INTEN_XO24MSTARTED_Max (0x1UL)       /*!< Max enumerator value of XO24MSTARTED field.                          */
  #define CLOCK_INTEN_XO24MSTARTED_Disabled (0x0UL)  /*!< Disable                                                              */
  #define CLOCK_INTEN_XO24MSTARTED_Enabled (0x1UL)   /*!< Enable                                                               */


