nrfconnect/sdk-hal_nordic/nrfx/bsp/stable/mdk/nrf54lm20a_enga_types.h
/* FLAGB @Bit 30 : Flag B. */
  #define CRACENCORE_PK_COMMAND_FLAGB_Pos (30UL)     /*!< Position of FLAGB field.                                             */
  #define CRACENCORE_PK_COMMAND_FLAGB_Msk (0x1UL << CRACENCORE_PK_COMMAND_FLAGB_Pos) /*!< Bit mask of FLAGB field.             */

/* CALCR2 @Bit 31 : This bit indicates if the IP has to calculate R**2 mod N for the next operation. */
  #define CRACENCORE_PK_COMMAND_CALCR2_Pos (31UL)    /*!< Position of CALCR2 field.                                            */
  #define CRACENCORE_PK_COMMAND_CALCR2_Msk (0x1UL << CRACENCORE_PK_COMMAND_CALCR2_Pos) /*!< Bit mask of CALCR2 field.          */
  #define CRACENCORE_PK_COMMAND_CALCR2_Min (0x0UL)   /*!< Min enumerator value of CALCR2 field.                                */
  #define CRACENCORE_PK_COMMAND_CALCR2_Max (0x1UL)   /*!< Max enumerator value of CALCR2 field.                                */
  #define CRACENCORE_PK_COMMAND_CALCR2_NRECALCULATE (0x0UL) /*!< don't recalculate R² mod N                                    */
  #define CRACENCORE_PK_COMMAND_CALCR2_RECALCULATE (0x1UL) /*!< re-calculate R² mod N                                          */


/* CRACENCORE_PK_CONTROL: Command register. */
  #define CRACENCORE_PK_CONTROL_ResetValue (0x00000000UL) /*!< Reset value of CONTROL register.                                */

/* START @Bit 0 : Writing a 1 starts the processing. */
  #define CRACENCORE_PK_CONTROL_START_Pos (0UL)      /*!< Position of START field.                                             */
  #define CRACENCORE_PK_CONTROL_START_Msk (0x1UL << CRACENCORE_PK_CONTROL_START_Pos) /*!< Bit mask of START field.             */

/* CLEARIRQ @Bit 1 : Writing a 1 clears the IRQ output. */
  #define CRACENCORE_PK_CONTROL_CLEARIRQ_Pos (1UL)   /*!< Position of CLEARIRQ field.                                          */
  #define CRACENCORE_PK_CONTROL_CLEARIRQ_Msk (0x1UL << CRACENCORE_PK_CONTROL_CLEARIRQ_Pos) /*!< Bit mask of CLEARIRQ field.    */


/* CRACENCORE_PK_STATUS: Status register. */
  #define CRACENCORE_PK_STATUS_ResetValue (0x00000000UL) /*!< Reset value of STATUS register.                                  */

/* ERRORFLAGS @Bits 4..15 : These bits indicate an error condition. */
  #define CRACENCORE_PK_STATUS_ERRORFLAGS_Pos (4UL)  /*!< Position of ERRORFLAGS field.                                        */
  #define CRACENCORE_PK_STATUS_ERRORFLAGS_Msk (0xFFFUL << CRACENCORE_PK_STATUS_ERRORFLAGS_Pos) /*!< Bit mask of ERRORFLAGS
                                                                            field.*/

/* PKBUSY @Bit 16 : This bit reflects the BUSY output value. */
  #define CRACENCORE_PK_STATUS_PKBUSY_Pos (16UL)     /*!< Position of PKBUSY field.                                            */
  #define CRACENCORE_PK_STATUS_PKBUSY_Msk (0x1UL << CRACENCORE_PK_STATUS_PKBUSY_Pos) /*!< Bit mask of PKBUSY field.            */

/* INTRPTSTATUS @Bit 17 : This bit reflects the IRQ output value. */
  #define CRACENCORE_PK_STATUS_INTRPTSTATUS_Pos (17UL) /*!< Position of INTRPTSTATUS field.                                    */
  #define CRACENCORE_PK_STATUS_INTRPTSTATUS_Msk (0x1UL << CRACENCORE_PK_STATUS_INTRPTSTATUS_Pos) /*!< Bit mask of INTRPTSTATUS
                                                                            field.*/

/* FAILPTR @Bits 24..28 : These bits indicate which data location generated the error flag. */
  #define CRACENCORE_PK_STATUS_FAILPTR_Pos (24UL)    /*!< Position of FAILPTR field.                                           */
  #define CRACENCORE_PK_STATUS_FAILPTR_Msk (0x1FUL << CRACENCORE_PK_STATUS_FAILPTR_Pos) /*!< Bit mask of FAILPTR field.        */


/* CRACENCORE_PK_TIMER: Timer register. */
  #define CRACENCORE_PK_TIMER_ResetValue (0x00000000UL) /*!< Reset value of TIMER register.                                    */

/* TIMER @Bits 1..31 : Number of clock cycles (as the number of core cycles is always even, register bit 0 is tied to zero). */
  #define CRACENCORE_PK_TIMER_TIMER_Pos (1UL)        /*!< Position of TIMER field.                                             */
  #define CRACENCORE_PK_TIMER_TIMER_Msk (0x7FFFFFFFUL << CRACENCORE_PK_TIMER_TIMER_Pos) /*!< Bit mask of TIMER field.          */


/* CRACENCORE_PK_HWCONFIG: Hardware configuration register. */
  #define CRACENCORE_PK_HWCONFIG_ResetValue (0x01F30200UL) /*!< Reset value of HWCONFIG register.                              */

/* MAXOPSIZE @Bits 0..11 : Maximum operand size (number of bytes). */
  #define CRACENCORE_PK_HWCONFIG_MAXOPSIZE_Pos (0UL) /*!< Position of MAXOPSIZE field.                                         */
  #define CRACENCORE_PK_HWCONFIG_MAXOPSIZE_Msk (0xFFFUL << CRACENCORE_PK_HWCONFIG_MAXOPSIZE_Pos) /*!< Bit mask of MAXOPSIZE
                                                                            field.*/

/* NBMULT @Bits 12..15 : Number of multipliers: */
  #define CRACENCORE_PK_HWCONFIG_NBMULT_Pos (12UL)   /*!< Position of NBMULT field.                                            */
  #define CRACENCORE_PK_HWCONFIG_NBMULT_Msk (0xFUL << CRACENCORE_PK_HWCONFIG_NBMULT_Pos) /*!< Bit mask of NBMULT field.        */
  #define CRACENCORE_PK_HWCONFIG_NBMULT_Min (0x0UL)  /*!< Min enumerator value of NBMULT field.                                */
  #define CRACENCORE_PK_HWCONFIG_NBMULT_Max (0x8UL)  /*!< Max enumerator value of NBMULT field.                                */
  #define CRACENCORE_PK_HWCONFIG_NBMULT_MULT1 (0x0UL) /*!< 1 multiplier                                                        */
  #define CRACENCORE_PK_HWCONFIG_NBMULT_MULT4 (0x1UL) /*!< 4 multipliers                                                       */
  #define CRACENCORE_PK_HWCONFIG_NBMULT_MULT16 (0x2UL) /*!< 16 multipliers                                                     */
  #define CRACENCORE_PK_HWCONFIG_NBMULT_MULT64 (0x4UL) /*!< 64 multipliers                                                     */
  #define CRACENCORE_PK_HWCONFIG_NBMULT_MULT256 (0x8UL) /*!< 256 multipliers                                                   */

/* PRIMEFIELD @Bit 16 : Support prime field. */
  #define CRACENCORE_PK_HWCONFIG_PRIMEFIELD_Pos (16UL) /*!< Position of PRIMEFIELD field.                                      */
  #define CRACENCORE_PK_HWCONFIG_PRIMEFIELD_Msk (0x1UL << CRACENCORE_PK_HWCONFIG_PRIMEFIELD_Pos) /*!< Bit mask of PRIMEFIELD
                                                                            field.*/

/* BINARYFIELD @Bit 17 : Support binary field. */
  #define CRACENCORE_PK_HWCONFIG_BINARYFIELD_Pos (17UL) /*!< Position of BINARYFIELD field.                                    */
  #define CRACENCORE_PK_HWCONFIG_BINARYFIELD_Msk (0x1UL << CRACENCORE_PK_HWCONFIG_BINARYFIELD_Pos) /*!< Bit mask of BINARYFIELD
                                                                            field.*/

/* DATAMEMECC @Bit 18 : Support data memory error correction. */
  #define CRACENCORE_PK_HWCONFIG_DATAMEMECC_Pos (18UL) /*!< Position of DATAMEMECC field.                                      */
  #define CRACENCORE_PK_HWCONFIG_DATAMEMECC_Msk (0x1UL << CRACENCORE_PK_HWCONFIG_DATAMEMECC_Pos) /*!< Bit mask of DATAMEMECC
                                                                            field.*/

