nrfconnect/sdk-hal_nordic/nrfx/bsp/stable/mdk/nrf54lm20a_enga_types.h
/* CRACENCORE_IKG_STATUS: Status register. */
  #define CRACENCORE_IKG_STATUS_ResetValue (0x00000000UL) /*!< Reset value of STATUS register.                                 */

/* SEEDERROR @Bit 0 : Seed Error during Isolated Key Generation. */
  #define CRACENCORE_IKG_STATUS_SEEDERROR_Pos (0UL)  /*!< Position of SEEDERROR field.                                         */
  #define CRACENCORE_IKG_STATUS_SEEDERROR_Msk (0x1UL << CRACENCORE_IKG_STATUS_SEEDERROR_Pos) /*!< Bit mask of SEEDERROR field. */

/* ENTROPYERROR @Bit 1 : Entropy Error during Isolated Key Generation. */
  #define CRACENCORE_IKG_STATUS_ENTROPYERROR_Pos (1UL) /*!< Position of ENTROPYERROR field.                                    */
  #define CRACENCORE_IKG_STATUS_ENTROPYERROR_Msk (0x1UL << CRACENCORE_IKG_STATUS_ENTROPYERROR_Pos) /*!< Bit mask of ENTROPYERROR
                                                                            field.*/

/* OKAY @Bit 2 : Isolated Key Generation is okay. */
  #define CRACENCORE_IKG_STATUS_OKAY_Pos (2UL)       /*!< Position of OKAY field.                                              */
  #define CRACENCORE_IKG_STATUS_OKAY_Msk (0x1UL << CRACENCORE_IKG_STATUS_OKAY_Pos) /*!< Bit mask of OKAY field.                */

/* CTRDRBGBUSY @Bit 4 : CTR_DRBG health test is busy (only when g_hw_health_test = true). */
  #define CRACENCORE_IKG_STATUS_CTRDRBGBUSY_Pos (4UL) /*!< Position of CTRDRBGBUSY field.                                      */
  #define CRACENCORE_IKG_STATUS_CTRDRBGBUSY_Msk (0x1UL << CRACENCORE_IKG_STATUS_CTRDRBGBUSY_Pos) /*!< Bit mask of CTRDRBGBUSY
                                                                            field.*/

/* CATASTROPHICERROR @Bit 5 : Catastrophic error during CTR_DRBG health test (only when g_hw_health_test = true). */
  #define CRACENCORE_IKG_STATUS_CATASTROPHICERROR_Pos (5UL) /*!< Position of CATASTROPHICERROR field.                          */
  #define CRACENCORE_IKG_STATUS_CATASTROPHICERROR_Msk (0x1UL << CRACENCORE_IKG_STATUS_CATASTROPHICERROR_Pos) /*!< Bit mask of
                                                                            CATASTROPHICERROR field.*/

/* SYMKEYSTORED @Bit 6 : Symmetric Keys are stored. */
  #define CRACENCORE_IKG_STATUS_SYMKEYSTORED_Pos (6UL) /*!< Position of SYMKEYSTORED field.                                    */
  #define CRACENCORE_IKG_STATUS_SYMKEYSTORED_Msk (0x1UL << CRACENCORE_IKG_STATUS_SYMKEYSTORED_Pos) /*!< Bit mask of SYMKEYSTORED
                                                                            field.*/

/* PRIVKEYSTORED @Bit 7 : Private Keys are stored. */
  #define CRACENCORE_IKG_STATUS_PRIVKEYSTORED_Pos (7UL) /*!< Position of PRIVKEYSTORED field.                                  */
  #define CRACENCORE_IKG_STATUS_PRIVKEYSTORED_Msk (0x1UL << CRACENCORE_IKG_STATUS_PRIVKEYSTORED_Pos) /*!< Bit mask of
                                                                            PRIVKEYSTORED field.*/


/* CRACENCORE_IKG_INITDATA: InitData register. */
  #define CRACENCORE_IKG_INITDATA_ResetValue (0x00000000UL) /*!< Reset value of INITDATA register.                             */

/* INITDATA @Bit 0 : Writing a 1 initialise Nonce and Personalisation_String registers counters, i.e. start writing from the 32
                     LSB. */

  #define CRACENCORE_IKG_INITDATA_INITDATA_Pos (0UL) /*!< Position of INITDATA field.                                          */
  #define CRACENCORE_IKG_INITDATA_INITDATA_Msk (0x1UL << CRACENCORE_IKG_INITDATA_INITDATA_Pos) /*!< Bit mask of INITDATA field.*/


/* CRACENCORE_IKG_NONCE: Nonce register. */
  #define CRACENCORE_IKG_NONCE_ResetValue (0x00000000UL) /*!< Reset value of NONCE register.                                   */

/* NONCE @Bits 0..31 : Nonce (write/read value 32-bit by 32-bit). */
  #define CRACENCORE_IKG_NONCE_NONCE_Pos (0UL)       /*!< Position of NONCE field.                                             */
  #define CRACENCORE_IKG_NONCE_NONCE_Msk (0xFFFFFFFFUL << CRACENCORE_IKG_NONCE_NONCE_Pos) /*!< Bit mask of NONCE field.        */


/* CRACENCORE_IKG_PERSONALISATIONSTRING: Personalisation String register. */
  #define CRACENCORE_IKG_PERSONALISATIONSTRING_ResetValue (0x00000000UL) /*!< Reset value of PERSONALISATIONSTRING register.   */

/* PERSONALISATIONSTRING @Bits 0..31 : Personalisation String (write/read value 32-bit by 32-bit). */
  #define CRACENCORE_IKG_PERSONALISATIONSTRING_PERSONALISATIONSTRING_Pos (0UL) /*!< Position of PERSONALISATIONSTRING field.   */
  #define CRACENCORE_IKG_PERSONALISATIONSTRING_PERSONALISATIONSTRING_Msk (0xFFFFFFFFUL << CRACENCORE_IKG_PERSONALISATIONSTRING_PERSONALISATIONSTRING_Pos)
                                                                            /*!< Bit mask of PERSONALISATIONSTRING field.*/


/* CRACENCORE_IKG_RESEEDINTERVALLSB: Reseed Interval LSB register. */
  #define CRACENCORE_IKG_RESEEDINTERVALLSB_ResetValue (0x80000000UL) /*!< Reset value of RESEEDINTERVALLSB register.           */

/* RESEEDINTERVALLSB @Bits 0..31 : Reseed Interval LSB. */
  #define CRACENCORE_IKG_RESEEDINTERVALLSB_RESEEDINTERVALLSB_Pos (0UL) /*!< Position of RESEEDINTERVALLSB field.               */
  #define CRACENCORE_IKG_RESEEDINTERVALLSB_RESEEDINTERVALLSB_Msk (0xFFFFFFFFUL << CRACENCORE_IKG_RESEEDINTERVALLSB_RESEEDINTERVALLSB_Pos)
                                                                            /*!< Bit mask of RESEEDINTERVALLSB field.*/


/* CRACENCORE_IKG_RESEEDINTERVALMSB: Reseed Interval MSB register. */
  #define CRACENCORE_IKG_RESEEDINTERVALMSB_ResetValue (0x00000000UL) /*!< Reset value of RESEEDINTERVALMSB register.           */

/* RESEEDINTERVALMSB @Bits 0..15 : Reseed Interval MSB. */
  #define CRACENCORE_IKG_RESEEDINTERVALMSB_RESEEDINTERVALMSB_Pos (0UL) /*!< Position of RESEEDINTERVALMSB field.               */
  #define CRACENCORE_IKG_RESEEDINTERVALMSB_RESEEDINTERVALMSB_Msk (0xFFFFUL << CRACENCORE_IKG_RESEEDINTERVALMSB_RESEEDINTERVALMSB_Pos)
                                                                            /*!< Bit mask of RESEEDINTERVALMSB field.*/


/* CRACENCORE_IKG_PKECONTROL: PKE Control register. */
  #define CRACENCORE_IKG_PKECONTROL_ResetValue (0x00000000UL) /*!< Reset value of PKECONTROL register.                         */

/* PKESTART @Bit 0 : Start the PKE operation or trigger for Secure mode exit. */
  #define CRACENCORE_IKG_PKECONTROL_PKESTART_Pos (0UL) /*!< Position of PKESTART field.                                        */
  #define CRACENCORE_IKG_PKECONTROL_PKESTART_Msk (0x1UL << CRACENCORE_IKG_PKECONTROL_PKESTART_Pos) /*!< Bit mask of PKESTART
                                                                            field.*/

/* CLEARIRQ @Bit 1 : Clear the IRQ output. */
  #define CRACENCORE_IKG_PKECONTROL_CLEARIRQ_Pos (1UL) /*!< Position of CLEARIRQ field.                                        */
  #define CRACENCORE_IKG_PKECONTROL_CLEARIRQ_Msk (0x1UL << CRACENCORE_IKG_PKECONTROL_CLEARIRQ_Pos) /*!< Bit mask of CLEARIRQ
                                                                            field.*/


/* CRACENCORE_IKG_PKECOMMAND: PKE Command register. */
  #define CRACENCORE_IKG_PKECOMMAND_ResetValue (0x00000000UL) /*!< Reset value of PKECOMMAND register.                         */

/* SECUREMODE @Bit 0 : Secure mode. */
  #define CRACENCORE_IKG_PKECOMMAND_SECUREMODE_Pos (0UL) /*!< Position of SECUREMODE field.                                    */
  #define CRACENCORE_IKG_PKECOMMAND_SECUREMODE_Msk (0x1UL << CRACENCORE_IKG_PKECOMMAND_SECUREMODE_Pos) /*!< Bit mask of
                                                                            SECUREMODE field.*/
  #define CRACENCORE_IKG_PKECOMMAND_SECUREMODE_Min (0x0UL) /*!< Min enumerator value of SECUREMODE field.                      */
  #define CRACENCORE_IKG_PKECOMMAND_SECUREMODE_Max (0x1UL) /*!< Max enumerator value of SECUREMODE field.                      */
  #define CRACENCORE_IKG_PKECOMMAND_SECUREMODE_DEACTIVATED (0x0UL) /*!< (unspecified)                                          */
  #define CRACENCORE_IKG_PKECOMMAND_SECUREMODE_ACTIVATED (0x1UL) /*!< (unspecified)                                            */

/* SELECTEDKEY @Bits 4..7 : Select Generated Private Key for PKE operation. */
  #define CRACENCORE_IKG_PKECOMMAND_SELECTEDKEY_Pos (4UL) /*!< Position of SELECTEDKEY field.                                  */
  #define CRACENCORE_IKG_PKECOMMAND_SELECTEDKEY_Msk (0xFUL << CRACENCORE_IKG_PKECOMMAND_SELECTEDKEY_Pos) /*!< Bit mask of
                                                                            SELECTEDKEY field.*/

/* OPSEL @Bits 8..9 : Select PKE operation with Isolated Key */
  #define CRACENCORE_IKG_PKECOMMAND_OPSEL_Pos (8UL)  /*!< Position of OPSEL field.                                             */
  #define CRACENCORE_IKG_PKECOMMAND_OPSEL_Msk (0x3UL << CRACENCORE_IKG_PKECOMMAND_OPSEL_Pos) /*!< Bit mask of OPSEL field.     */
  #define CRACENCORE_IKG_PKECOMMAND_OPSEL_Min (0x0UL) /*!< Min enumerator value of OPSEL field.                                */
  #define CRACENCORE_IKG_PKECOMMAND_OPSEL_Max (0x2UL) /*!< Max enumerator value of OPSEL field.                                */
  #define CRACENCORE_IKG_PKECOMMAND_OPSEL_PUBKEY (0x0UL) /*!< Public Key Generation                                            */
  #define CRACENCORE_IKG_PKECOMMAND_OPSEL_ECDSA (0x1UL) /*!< ECDSA Signature                                                   */
  #define CRACENCORE_IKG_PKECOMMAND_OPSEL_PTMUL (0x2UL) /*!< Point Multiplication                                              */


/* CRACENCORE_IKG_PKESTATUS: PKE Status register. */
  #define CRACENCORE_IKG_PKESTATUS_ResetValue (0x00000000UL) /*!< Reset value of PKESTATUS register.                           */

