nrfconnect/sdk-hal_nordic/nrfx/bsp/stable/mdk/nrf54lm20a_enga_types.h
/* CTRLAPPERI_INTPEND: Pending interrupts */
  #define CTRLAPPERI_INTPEND_ResetValue (0x00000000UL) /*!< Reset value of INTPEND register.                                   */

/* RXREADY @Bit 0 : Read pending status of interrupt for event RXREADY */
  #define CTRLAPPERI_INTPEND_RXREADY_Pos (0UL)       /*!< Position of RXREADY field.                                           */
  #define CTRLAPPERI_INTPEND_RXREADY_Msk (0x1UL << CTRLAPPERI_INTPEND_RXREADY_Pos) /*!< Bit mask of RXREADY field.             */
  #define CTRLAPPERI_INTPEND_RXREADY_Min (0x0UL)     /*!< Min enumerator value of RXREADY field.                               */
  #define CTRLAPPERI_INTPEND_RXREADY_Max (0x1UL)     /*!< Max enumerator value of RXREADY field.                               */
  #define CTRLAPPERI_INTPEND_RXREADY_NotPending (0x0UL) /*!< Read: Not pending                                                 */
  #define CTRLAPPERI_INTPEND_RXREADY_Pending (0x1UL) /*!< Read: Pending                                                        */

/* TXDONE @Bit 1 : Read pending status of interrupt for event TXDONE */
  #define CTRLAPPERI_INTPEND_TXDONE_Pos (1UL)        /*!< Position of TXDONE field.                                            */
  #define CTRLAPPERI_INTPEND_TXDONE_Msk (0x1UL << CTRLAPPERI_INTPEND_TXDONE_Pos) /*!< Bit mask of TXDONE field.                */
  #define CTRLAPPERI_INTPEND_TXDONE_Min (0x0UL)      /*!< Min enumerator value of TXDONE field.                                */
  #define CTRLAPPERI_INTPEND_TXDONE_Max (0x1UL)      /*!< Max enumerator value of TXDONE field.                                */
  #define CTRLAPPERI_INTPEND_TXDONE_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define CTRLAPPERI_INTPEND_TXDONE_Pending (0x1UL)  /*!< Read: Pending                                                        */


/* CTRLAPPERI_RESET: System reset request. */
  #define CTRLAPPERI_RESET_ResetValue (0x00000000UL) /*!< Reset value of RESET register.                                       */

/* RESET @Bits 0..2 : Reset request */
  #define CTRLAPPERI_RESET_RESET_Pos (0UL)           /*!< Position of RESET field.                                             */
  #define CTRLAPPERI_RESET_RESET_Msk (0x7UL << CTRLAPPERI_RESET_RESET_Pos) /*!< Bit mask of RESET field.                       */
  #define CTRLAPPERI_RESET_RESET_Min (0x0UL)         /*!< Min enumerator value of RESET field.                                 */
  #define CTRLAPPERI_RESET_RESET_Max (0x4UL)         /*!< Max enumerator value of RESET field.                                 */
  #define CTRLAPPERI_RESET_RESET_NoReset (0x0UL)     /*!< No reset is generated                                                */
  #define CTRLAPPERI_RESET_RESET_SoftReset (0x1UL)   /*!< Perform a device soft reset                                          */
  #define CTRLAPPERI_RESET_RESET_HardReset (0x2UL)   /*!< Perform a device hard reset                                          */
  #define CTRLAPPERI_RESET_RESET_PinReset (0x4UL)    /*!< Perform a device pin reset                                           */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           DPPIC                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================= Struct DPPIC_TASKS_CHG ================================================== */
/**
  * @brief TASKS_CHG [DPPIC_TASKS_CHG] Channel group tasks
  */
typedef struct {
  __OM  uint32_t  EN;                                /*!< (@ 0x00000000) Enable channel group n                                */
  __OM  uint32_t  DIS;                               /*!< (@ 0x00000004) Disable channel group n                               */
} NRF_DPPIC_TASKS_CHG_Type;                          /*!< Size = 8 (0x008)                                                     */
  #define DPPIC_TASKS_CHG_MaxCount (6UL)             /*!< Size of TASKS_CHG[6] array.                                          */
  #define DPPIC_TASKS_CHG_MaxIndex (5UL)             /*!< Max index of TASKS_CHG[6] array.                                     */
  #define DPPIC_TASKS_CHG_MinIndex (0UL)             /*!< Min index of TASKS_CHG[6] array.                                     */

/* DPPIC_TASKS_CHG_EN: Enable channel group n */
  #define DPPIC_TASKS_CHG_EN_ResetValue (0x00000000UL) /*!< Reset value of EN register.                                        */

/* EN @Bit 0 : Enable channel group n */
  #define DPPIC_TASKS_CHG_EN_EN_Pos (0UL)            /*!< Position of EN field.                                                */
  #define DPPIC_TASKS_CHG_EN_EN_Msk (0x1UL << DPPIC_TASKS_CHG_EN_EN_Pos) /*!< Bit mask of EN field.                            */
  #define DPPIC_TASKS_CHG_EN_EN_Min (0x1UL)          /*!< Min enumerator value of EN field.                                    */
  #define DPPIC_TASKS_CHG_EN_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define DPPIC_TASKS_CHG_EN_EN_Trigger (0x1UL)      /*!< Trigger task                                                         */


/* DPPIC_TASKS_CHG_DIS: Disable channel group n */
  #define DPPIC_TASKS_CHG_DIS_ResetValue (0x00000000UL) /*!< Reset value of DIS register.                                      */

/* DIS @Bit 0 : Disable channel group n */
  #define DPPIC_TASKS_CHG_DIS_DIS_Pos (0UL)          /*!< Position of DIS field.                                               */
  #define DPPIC_TASKS_CHG_DIS_DIS_Msk (0x1UL << DPPIC_TASKS_CHG_DIS_DIS_Pos) /*!< Bit mask of DIS field.                       */
  #define DPPIC_TASKS_CHG_DIS_DIS_Min (0x1UL)        /*!< Min enumerator value of DIS field.                                   */
  #define DPPIC_TASKS_CHG_DIS_DIS_Max (0x1UL)        /*!< Max enumerator value of DIS field.                                   */
  #define DPPIC_TASKS_CHG_DIS_DIS_Trigger (0x1UL)    /*!< Trigger task                                                         */



