nrfconnect/sdk-hal_nordic/nrfx/bsp/stable/mdk/nrf54lm20a_enga_types.h
/* CH4 @Bit 4 : Include or exclude channel 4 */
  #define DPPIC_CHG_CH4_Pos (4UL)                    /*!< Position of CH4 field.                                               */
  #define DPPIC_CHG_CH4_Msk (0x1UL << DPPIC_CHG_CH4_Pos) /*!< Bit mask of CH4 field.                                           */
  #define DPPIC_CHG_CH4_Min (0x0UL)                  /*!< Min enumerator value of CH4 field.                                   */
  #define DPPIC_CHG_CH4_Max (0x1UL)                  /*!< Max enumerator value of CH4 field.                                   */
  #define DPPIC_CHG_CH4_Excluded (0x0UL)             /*!< Exclude                                                              */
  #define DPPIC_CHG_CH4_Included (0x1UL)             /*!< Include                                                              */

/* CH5 @Bit 5 : Include or exclude channel 5 */
  #define DPPIC_CHG_CH5_Pos (5UL)                    /*!< Position of CH5 field.                                               */
  #define DPPIC_CHG_CH5_Msk (0x1UL << DPPIC_CHG_CH5_Pos) /*!< Bit mask of CH5 field.                                           */
  #define DPPIC_CHG_CH5_Min (0x0UL)                  /*!< Min enumerator value of CH5 field.                                   */
  #define DPPIC_CHG_CH5_Max (0x1UL)                  /*!< Max enumerator value of CH5 field.                                   */
  #define DPPIC_CHG_CH5_Excluded (0x0UL)             /*!< Exclude                                                              */
  #define DPPIC_CHG_CH5_Included (0x1UL)             /*!< Include                                                              */

/* CH6 @Bit 6 : Include or exclude channel 6 */
  #define DPPIC_CHG_CH6_Pos (6UL)                    /*!< Position of CH6 field.                                               */
  #define DPPIC_CHG_CH6_Msk (0x1UL << DPPIC_CHG_CH6_Pos) /*!< Bit mask of CH6 field.                                           */
  #define DPPIC_CHG_CH6_Min (0x0UL)                  /*!< Min enumerator value of CH6 field.                                   */
  #define DPPIC_CHG_CH6_Max (0x1UL)                  /*!< Max enumerator value of CH6 field.                                   */
  #define DPPIC_CHG_CH6_Excluded (0x0UL)             /*!< Exclude                                                              */
  #define DPPIC_CHG_CH6_Included (0x1UL)             /*!< Include                                                              */

/* CH7 @Bit 7 : Include or exclude channel 7 */
  #define DPPIC_CHG_CH7_Pos (7UL)                    /*!< Position of CH7 field.                                               */
  #define DPPIC_CHG_CH7_Msk (0x1UL << DPPIC_CHG_CH7_Pos) /*!< Bit mask of CH7 field.                                           */
  #define DPPIC_CHG_CH7_Min (0x0UL)                  /*!< Min enumerator value of CH7 field.                                   */
  #define DPPIC_CHG_CH7_Max (0x1UL)                  /*!< Max enumerator value of CH7 field.                                   */
  #define DPPIC_CHG_CH7_Excluded (0x0UL)             /*!< Exclude                                                              */
  #define DPPIC_CHG_CH7_Included (0x1UL)             /*!< Include                                                              */

/* CH8 @Bit 8 : Include or exclude channel 8 */
  #define DPPIC_CHG_CH8_Pos (8UL)                    /*!< Position of CH8 field.                                               */
  #define DPPIC_CHG_CH8_Msk (0x1UL << DPPIC_CHG_CH8_Pos) /*!< Bit mask of CH8 field.                                           */
  #define DPPIC_CHG_CH8_Min (0x0UL)                  /*!< Min enumerator value of CH8 field.                                   */
  #define DPPIC_CHG_CH8_Max (0x1UL)                  /*!< Max enumerator value of CH8 field.                                   */
  #define DPPIC_CHG_CH8_Excluded (0x0UL)             /*!< Exclude                                                              */
  #define DPPIC_CHG_CH8_Included (0x1UL)             /*!< Include                                                              */

/* CH9 @Bit 9 : Include or exclude channel 9 */
  #define DPPIC_CHG_CH9_Pos (9UL)                    /*!< Position of CH9 field.                                               */
  #define DPPIC_CHG_CH9_Msk (0x1UL << DPPIC_CHG_CH9_Pos) /*!< Bit mask of CH9 field.                                           */
  #define DPPIC_CHG_CH9_Min (0x0UL)                  /*!< Min enumerator value of CH9 field.                                   */
  #define DPPIC_CHG_CH9_Max (0x1UL)                  /*!< Max enumerator value of CH9 field.                                   */
  #define DPPIC_CHG_CH9_Excluded (0x0UL)             /*!< Exclude                                                              */
  #define DPPIC_CHG_CH9_Included (0x1UL)             /*!< Include                                                              */

/* CH10 @Bit 10 : Include or exclude channel 10 */
  #define DPPIC_CHG_CH10_Pos (10UL)                  /*!< Position of CH10 field.                                              */
  #define DPPIC_CHG_CH10_Msk (0x1UL << DPPIC_CHG_CH10_Pos) /*!< Bit mask of CH10 field.                                        */
  #define DPPIC_CHG_CH10_Min (0x0UL)                 /*!< Min enumerator value of CH10 field.                                  */
  #define DPPIC_CHG_CH10_Max (0x1UL)                 /*!< Max enumerator value of CH10 field.                                  */
  #define DPPIC_CHG_CH10_Excluded (0x0UL)            /*!< Exclude                                                              */
  #define DPPIC_CHG_CH10_Included (0x1UL)            /*!< Include                                                              */

/* CH11 @Bit 11 : Include or exclude channel 11 */
  #define DPPIC_CHG_CH11_Pos (11UL)                  /*!< Position of CH11 field.                                              */
  #define DPPIC_CHG_CH11_Msk (0x1UL << DPPIC_CHG_CH11_Pos) /*!< Bit mask of CH11 field.                                        */
  #define DPPIC_CHG_CH11_Min (0x0UL)                 /*!< Min enumerator value of CH11 field.                                  */
  #define DPPIC_CHG_CH11_Max (0x1UL)                 /*!< Max enumerator value of CH11 field.                                  */
  #define DPPIC_CHG_CH11_Excluded (0x0UL)            /*!< Exclude                                                              */
  #define DPPIC_CHG_CH11_Included (0x1UL)            /*!< Include                                                              */

/* CH12 @Bit 12 : Include or exclude channel 12 */
  #define DPPIC_CHG_CH12_Pos (12UL)                  /*!< Position of CH12 field.                                              */
  #define DPPIC_CHG_CH12_Msk (0x1UL << DPPIC_CHG_CH12_Pos) /*!< Bit mask of CH12 field.                                        */
  #define DPPIC_CHG_CH12_Min (0x0UL)                 /*!< Min enumerator value of CH12 field.                                  */
  #define DPPIC_CHG_CH12_Max (0x1UL)                 /*!< Max enumerator value of CH12 field.                                  */
  #define DPPIC_CHG_CH12_Excluded (0x0UL)            /*!< Exclude                                                              */
  #define DPPIC_CHG_CH12_Included (0x1UL)            /*!< Include                                                              */

/* CH13 @Bit 13 : Include or exclude channel 13 */
  #define DPPIC_CHG_CH13_Pos (13UL)                  /*!< Position of CH13 field.                                              */
  #define DPPIC_CHG_CH13_Msk (0x1UL << DPPIC_CHG_CH13_Pos) /*!< Bit mask of CH13 field.                                        */
  #define DPPIC_CHG_CH13_Min (0x0UL)                 /*!< Min enumerator value of CH13 field.                                  */
  #define DPPIC_CHG_CH13_Max (0x1UL)                 /*!< Max enumerator value of CH13 field.                                  */
  #define DPPIC_CHG_CH13_Excluded (0x0UL)            /*!< Exclude                                                              */
  #define DPPIC_CHG_CH13_Included (0x1UL)            /*!< Include                                                              */

/* CH14 @Bit 14 : Include or exclude channel 14 */
  #define DPPIC_CHG_CH14_Pos (14UL)                  /*!< Position of CH14 field.                                              */
  #define DPPIC_CHG_CH14_Msk (0x1UL << DPPIC_CHG_CH14_Pos) /*!< Bit mask of CH14 field.                                        */
  #define DPPIC_CHG_CH14_Min (0x0UL)                 /*!< Min enumerator value of CH14 field.                                  */
  #define DPPIC_CHG_CH14_Max (0x1UL)                 /*!< Max enumerator value of CH14 field.                                  */
  #define DPPIC_CHG_CH14_Excluded (0x0UL)            /*!< Exclude                                                              */
  #define DPPIC_CHG_CH14_Included (0x1UL)            /*!< Include                                                              */

/* CH15 @Bit 15 : Include or exclude channel 15 */
  #define DPPIC_CHG_CH15_Pos (15UL)                  /*!< Position of CH15 field.                                              */
  #define DPPIC_CHG_CH15_Msk (0x1UL << DPPIC_CHG_CH15_Pos) /*!< Bit mask of CH15 field.                                        */
  #define DPPIC_CHG_CH15_Min (0x0UL)                 /*!< Min enumerator value of CH15 field.                                  */
  #define DPPIC_CHG_CH15_Max (0x1UL)                 /*!< Max enumerator value of CH15 field.                                  */
  #define DPPIC_CHG_CH15_Excluded (0x0UL)            /*!< Exclude                                                              */
  #define DPPIC_CHG_CH15_Included (0x1UL)            /*!< Include                                                              */

/* CH16 @Bit 16 : Include or exclude channel 16 */
  #define DPPIC_CHG_CH16_Pos (16UL)                  /*!< Position of CH16 field.                                              */
  #define DPPIC_CHG_CH16_Msk (0x1UL << DPPIC_CHG_CH16_Pos) /*!< Bit mask of CH16 field.                                        */
  #define DPPIC_CHG_CH16_Min (0x0UL)                 /*!< Min enumerator value of CH16 field.                                  */
  #define DPPIC_CHG_CH16_Max (0x1UL)                 /*!< Max enumerator value of CH16 field.                                  */
  #define DPPIC_CHG_CH16_Excluded (0x0UL)            /*!< Exclude                                                              */
  #define DPPIC_CHG_CH16_Included (0x1UL)            /*!< Include                                                              */

/* CH17 @Bit 17 : Include or exclude channel 17 */
  #define DPPIC_CHG_CH17_Pos (17UL)                  /*!< Position of CH17 field.                                              */
  #define DPPIC_CHG_CH17_Msk (0x1UL << DPPIC_CHG_CH17_Pos) /*!< Bit mask of CH17 field.                                        */
  #define DPPIC_CHG_CH17_Min (0x0UL)                 /*!< Min enumerator value of CH17 field.                                  */
  #define DPPIC_CHG_CH17_Max (0x1UL)                 /*!< Max enumerator value of CH17 field.                                  */
  #define DPPIC_CHG_CH17_Excluded (0x0UL)            /*!< Exclude                                                              */
  #define DPPIC_CHG_CH17_Included (0x1UL)            /*!< Include                                                              */

/* CH18 @Bit 18 : Include or exclude channel 18 */
  #define DPPIC_CHG_CH18_Pos (18UL)                  /*!< Position of CH18 field.                                              */
  #define DPPIC_CHG_CH18_Msk (0x1UL << DPPIC_CHG_CH18_Pos) /*!< Bit mask of CH18 field.                                        */
  #define DPPIC_CHG_CH18_Min (0x0UL)                 /*!< Min enumerator value of CH18 field.                                  */
  #define DPPIC_CHG_CH18_Max (0x1UL)                 /*!< Max enumerator value of CH18 field.                                  */
  #define DPPIC_CHG_CH18_Excluded (0x0UL)            /*!< Exclude                                                              */
  #define DPPIC_CHG_CH18_Included (0x1UL)            /*!< Include                                                              */

/* CH19 @Bit 19 : Include or exclude channel 19 */
  #define DPPIC_CHG_CH19_Pos (19UL)                  /*!< Position of CH19 field.                                              */
  #define DPPIC_CHG_CH19_Msk (0x1UL << DPPIC_CHG_CH19_Pos) /*!< Bit mask of CH19 field.                                        */
  #define DPPIC_CHG_CH19_Min (0x0UL)                 /*!< Min enumerator value of CH19 field.                                  */
  #define DPPIC_CHG_CH19_Max (0x1UL)                 /*!< Max enumerator value of CH19 field.                                  */
  #define DPPIC_CHG_CH19_Excluded (0x0UL)            /*!< Exclude                                                              */
  #define DPPIC_CHG_CH19_Included (0x1UL)            /*!< Include                                                              */

