nrfconnect/sdk-hal_nordic/nrfx/bsp/stable/mdk/nrf54lm20a_enga_types.h
/* PIN23 @Bit 23 : Pin 23 */
  #define GPIO_OUTSET_PIN23_Pos (23UL)               /*!< Position of PIN23 field.                                             */
  #define GPIO_OUTSET_PIN23_Msk (0x1UL << GPIO_OUTSET_PIN23_Pos) /*!< Bit mask of PIN23 field.                                 */
  #define GPIO_OUTSET_PIN23_Min (0x0UL)              /*!< Min enumerator value of PIN23 field.                                 */
  #define GPIO_OUTSET_PIN23_Max (0x1UL)              /*!< Max enumerator value of PIN23 field.                                 */
  #define GPIO_OUTSET_PIN23_Low (0x0UL)              /*!< Read: pin driver is low                                              */
  #define GPIO_OUTSET_PIN23_High (0x1UL)             /*!< Read: pin driver is high                                             */
  #define GPIO_OUTSET_PIN23_Set (0x1UL)              /*!< Write: writing a '1' sets the pin high; writing a '0' has no effect  */

/* PIN24 @Bit 24 : Pin 24 */
  #define GPIO_OUTSET_PIN24_Pos (24UL)               /*!< Position of PIN24 field.                                             */
  #define GPIO_OUTSET_PIN24_Msk (0x1UL << GPIO_OUTSET_PIN24_Pos) /*!< Bit mask of PIN24 field.                                 */
  #define GPIO_OUTSET_PIN24_Min (0x0UL)              /*!< Min enumerator value of PIN24 field.                                 */
  #define GPIO_OUTSET_PIN24_Max (0x1UL)              /*!< Max enumerator value of PIN24 field.                                 */
  #define GPIO_OUTSET_PIN24_Low (0x0UL)              /*!< Read: pin driver is low                                              */
  #define GPIO_OUTSET_PIN24_High (0x1UL)             /*!< Read: pin driver is high                                             */
  #define GPIO_OUTSET_PIN24_Set (0x1UL)              /*!< Write: writing a '1' sets the pin high; writing a '0' has no effect  */

/* PIN25 @Bit 25 : Pin 25 */
  #define GPIO_OUTSET_PIN25_Pos (25UL)               /*!< Position of PIN25 field.                                             */
  #define GPIO_OUTSET_PIN25_Msk (0x1UL << GPIO_OUTSET_PIN25_Pos) /*!< Bit mask of PIN25 field.                                 */
  #define GPIO_OUTSET_PIN25_Min (0x0UL)              /*!< Min enumerator value of PIN25 field.                                 */
  #define GPIO_OUTSET_PIN25_Max (0x1UL)              /*!< Max enumerator value of PIN25 field.                                 */
  #define GPIO_OUTSET_PIN25_Low (0x0UL)              /*!< Read: pin driver is low                                              */
  #define GPIO_OUTSET_PIN25_High (0x1UL)             /*!< Read: pin driver is high                                             */
  #define GPIO_OUTSET_PIN25_Set (0x1UL)              /*!< Write: writing a '1' sets the pin high; writing a '0' has no effect  */

/* PIN26 @Bit 26 : Pin 26 */
  #define GPIO_OUTSET_PIN26_Pos (26UL)               /*!< Position of PIN26 field.                                             */
  #define GPIO_OUTSET_PIN26_Msk (0x1UL << GPIO_OUTSET_PIN26_Pos) /*!< Bit mask of PIN26 field.                                 */
  #define GPIO_OUTSET_PIN26_Min (0x0UL)              /*!< Min enumerator value of PIN26 field.                                 */
  #define GPIO_OUTSET_PIN26_Max (0x1UL)              /*!< Max enumerator value of PIN26 field.                                 */
  #define GPIO_OUTSET_PIN26_Low (0x0UL)              /*!< Read: pin driver is low                                              */
  #define GPIO_OUTSET_PIN26_High (0x1UL)             /*!< Read: pin driver is high                                             */
  #define GPIO_OUTSET_PIN26_Set (0x1UL)              /*!< Write: writing a '1' sets the pin high; writing a '0' has no effect  */

/* PIN27 @Bit 27 : Pin 27 */
  #define GPIO_OUTSET_PIN27_Pos (27UL)               /*!< Position of PIN27 field.                                             */
  #define GPIO_OUTSET_PIN27_Msk (0x1UL << GPIO_OUTSET_PIN27_Pos) /*!< Bit mask of PIN27 field.                                 */
  #define GPIO_OUTSET_PIN27_Min (0x0UL)              /*!< Min enumerator value of PIN27 field.                                 */
  #define GPIO_OUTSET_PIN27_Max (0x1UL)              /*!< Max enumerator value of PIN27 field.                                 */
  #define GPIO_OUTSET_PIN27_Low (0x0UL)              /*!< Read: pin driver is low                                              */
  #define GPIO_OUTSET_PIN27_High (0x1UL)             /*!< Read: pin driver is high                                             */
  #define GPIO_OUTSET_PIN27_Set (0x1UL)              /*!< Write: writing a '1' sets the pin high; writing a '0' has no effect  */

/* PIN28 @Bit 28 : Pin 28 */
  #define GPIO_OUTSET_PIN28_Pos (28UL)               /*!< Position of PIN28 field.                                             */
  #define GPIO_OUTSET_PIN28_Msk (0x1UL << GPIO_OUTSET_PIN28_Pos) /*!< Bit mask of PIN28 field.                                 */
  #define GPIO_OUTSET_PIN28_Min (0x0UL)              /*!< Min enumerator value of PIN28 field.                                 */
  #define GPIO_OUTSET_PIN28_Max (0x1UL)              /*!< Max enumerator value of PIN28 field.                                 */
  #define GPIO_OUTSET_PIN28_Low (0x0UL)              /*!< Read: pin driver is low                                              */
  #define GPIO_OUTSET_PIN28_High (0x1UL)             /*!< Read: pin driver is high                                             */
  #define GPIO_OUTSET_PIN28_Set (0x1UL)              /*!< Write: writing a '1' sets the pin high; writing a '0' has no effect  */

/* PIN29 @Bit 29 : Pin 29 */
  #define GPIO_OUTSET_PIN29_Pos (29UL)               /*!< Position of PIN29 field.                                             */
  #define GPIO_OUTSET_PIN29_Msk (0x1UL << GPIO_OUTSET_PIN29_Pos) /*!< Bit mask of PIN29 field.                                 */
  #define GPIO_OUTSET_PIN29_Min (0x0UL)              /*!< Min enumerator value of PIN29 field.                                 */
  #define GPIO_OUTSET_PIN29_Max (0x1UL)              /*!< Max enumerator value of PIN29 field.                                 */
  #define GPIO_OUTSET_PIN29_Low (0x0UL)              /*!< Read: pin driver is low                                              */
  #define GPIO_OUTSET_PIN29_High (0x1UL)             /*!< Read: pin driver is high                                             */
  #define GPIO_OUTSET_PIN29_Set (0x1UL)              /*!< Write: writing a '1' sets the pin high; writing a '0' has no effect  */

/* PIN30 @Bit 30 : Pin 30 */
  #define GPIO_OUTSET_PIN30_Pos (30UL)               /*!< Position of PIN30 field.                                             */
  #define GPIO_OUTSET_PIN30_Msk (0x1UL << GPIO_OUTSET_PIN30_Pos) /*!< Bit mask of PIN30 field.                                 */
  #define GPIO_OUTSET_PIN30_Min (0x0UL)              /*!< Min enumerator value of PIN30 field.                                 */
  #define GPIO_OUTSET_PIN30_Max (0x1UL)              /*!< Max enumerator value of PIN30 field.                                 */
  #define GPIO_OUTSET_PIN30_Low (0x0UL)              /*!< Read: pin driver is low                                              */
  #define GPIO_OUTSET_PIN30_High (0x1UL)             /*!< Read: pin driver is high                                             */
  #define GPIO_OUTSET_PIN30_Set (0x1UL)              /*!< Write: writing a '1' sets the pin high; writing a '0' has no effect  */

/* PIN31 @Bit 31 : Pin 31 */
  #define GPIO_OUTSET_PIN31_Pos (31UL)               /*!< Position of PIN31 field.                                             */
  #define GPIO_OUTSET_PIN31_Msk (0x1UL << GPIO_OUTSET_PIN31_Pos) /*!< Bit mask of PIN31 field.                                 */
  #define GPIO_OUTSET_PIN31_Min (0x0UL)              /*!< Min enumerator value of PIN31 field.                                 */
  #define GPIO_OUTSET_PIN31_Max (0x1UL)              /*!< Max enumerator value of PIN31 field.                                 */
  #define GPIO_OUTSET_PIN31_Low (0x0UL)              /*!< Read: pin driver is low                                              */
  #define GPIO_OUTSET_PIN31_High (0x1UL)             /*!< Read: pin driver is high                                             */
  #define GPIO_OUTSET_PIN31_Set (0x1UL)              /*!< Write: writing a '1' sets the pin high; writing a '0' has no effect  */


/* GPIO_OUTCLR: Clear individual bits in GPIO port */
  #define GPIO_OUTCLR_ResetValue (0x00000000UL)      /*!< Reset value of OUTCLR register.                                      */

/* PIN0 @Bit 0 : Pin 0 */
  #define GPIO_OUTCLR_PIN0_Pos (0UL)                 /*!< Position of PIN0 field.                                              */
  #define GPIO_OUTCLR_PIN0_Msk (0x1UL << GPIO_OUTCLR_PIN0_Pos) /*!< Bit mask of PIN0 field.                                    */
  #define GPIO_OUTCLR_PIN0_Min (0x0UL)               /*!< Min enumerator value of PIN0 field.                                  */
  #define GPIO_OUTCLR_PIN0_Max (0x1UL)               /*!< Max enumerator value of PIN0 field.                                  */
  #define GPIO_OUTCLR_PIN0_Low (0x0UL)               /*!< Read: pin driver is low                                              */
  #define GPIO_OUTCLR_PIN0_High (0x1UL)              /*!< Read: pin driver is high                                             */
  #define GPIO_OUTCLR_PIN0_Clear (0x1UL)             /*!< Write: writing a '1' sets the pin low; writing a '0' has no effect   */

