nrfconnect/sdk-hal_nordic/nrfx/bsp/stable/mdk/nrf54lm20a_enga_types.h
/* GRTC_CC_CCL: The lower 32-bits of Capture/Compare register CC[n] */
  #define GRTC_CC_CCL_ResetValue (0x00000000UL)      /*!< Reset value of CCL register.                                         */

/* CCL @Bits 0..31 : Capture/Compare low value in 1 us */
  #define GRTC_CC_CCL_CCL_Pos (0UL)                  /*!< Position of CCL field.                                               */
  #define GRTC_CC_CCL_CCL_Msk (0xFFFFFFFFUL << GRTC_CC_CCL_CCL_Pos) /*!< Bit mask of CCL field.                                */


/* GRTC_CC_CCH: The higher 32-bits of Capture/Compare register CC[n] */
  #define GRTC_CC_CCH_ResetValue (0x00000000UL)      /*!< Reset value of CCH register.                                         */

/* CCH @Bits 0..19 : Capture/Compare high value in 1 us */
  #define GRTC_CC_CCH_CCH_Pos (0UL)                  /*!< Position of CCH field.                                               */
  #define GRTC_CC_CCH_CCH_Msk (0xFFFFFUL << GRTC_CC_CCH_CCH_Pos) /*!< Bit mask of CCH field.                                   */


/* GRTC_CC_CCADD: Count to add to CC[n] when this register is written. */
  #define GRTC_CC_CCADD_ResetValue (0x00000000UL)    /*!< Reset value of CCADD register.                                       */

/* VALUE @Bits 0..30 : Count to add to CC[n] */
  #define GRTC_CC_CCADD_VALUE_Pos (0UL)              /*!< Position of VALUE field.                                             */
  #define GRTC_CC_CCADD_VALUE_Msk (0x7FFFFFFFUL << GRTC_CC_CCADD_VALUE_Pos) /*!< Bit mask of VALUE field.                      */

/* REFERENCE @Bit 31 : Configure the Capture/Compare register */
  #define GRTC_CC_CCADD_REFERENCE_Pos (31UL)         /*!< Position of REFERENCE field.                                         */
  #define GRTC_CC_CCADD_REFERENCE_Msk (0x1UL << GRTC_CC_CCADD_REFERENCE_Pos) /*!< Bit mask of REFERENCE field.                 */
  #define GRTC_CC_CCADD_REFERENCE_Min (0x0UL)        /*!< Min enumerator value of REFERENCE field.                             */
  #define GRTC_CC_CCADD_REFERENCE_Max (0x1UL)        /*!< Max enumerator value of REFERENCE field.                             */
  #define GRTC_CC_CCADD_REFERENCE_SYSCOUNTER (0x0UL) /*!< Adds SYSCOUNTER value.                                               */
  #define GRTC_CC_CCADD_REFERENCE_CC (0x1UL)         /*!< Adds CC value.                                                       */


/* GRTC_CC_CCEN: Configure Capture/Compare register CC[n] */
  #define GRTC_CC_CCEN_ResetValue (0x00000000UL)     /*!< Reset value of CCEN register.                                        */

/* ACTIVE @Bit 0 : Configure the Capture/Compare register */
  #define GRTC_CC_CCEN_ACTIVE_Pos (0UL)              /*!< Position of ACTIVE field.                                            */
  #define GRTC_CC_CCEN_ACTIVE_Msk (0x1UL << GRTC_CC_CCEN_ACTIVE_Pos) /*!< Bit mask of ACTIVE field.                            */
  #define GRTC_CC_CCEN_ACTIVE_Min (0x0UL)            /*!< Min enumerator value of ACTIVE field.                                */
  #define GRTC_CC_CCEN_ACTIVE_Max (0x1UL)            /*!< Max enumerator value of ACTIVE field.                                */
  #define GRTC_CC_CCEN_ACTIVE_Disable (0x0UL)        /*!< Capture/Compare register CC[n] Disabled.                             */
  #define GRTC_CC_CCEN_ACTIVE_Enable (0x1UL)         /*!< Capture/Compare register CC[n] enabled.                              */

/* PASTCC @Bit 1 : Status of event EVENTS_COMPARE[n] caused by the configured CC value is in past */
  #define GRTC_CC_CCEN_PASTCC_Pos (1UL)              /*!< Position of PASTCC field.                                            */
  #define GRTC_CC_CCEN_PASTCC_Msk (0x1UL << GRTC_CC_CCEN_PASTCC_Pos) /*!< Bit mask of PASTCC field.                            */
  #define GRTC_CC_CCEN_PASTCC_Min (0x0UL)            /*!< Min enumerator value of PASTCC field.                                */
  #define GRTC_CC_CCEN_PASTCC_Max (0x1UL)            /*!< Max enumerator value of PASTCC field.                                */
  #define GRTC_CC_CCEN_PASTCC_Inactive (0x0UL)       /*!< Inactive                                                             */
  #define GRTC_CC_CCEN_PASTCC_Active (0x1UL)         /*!< Active                                                               */



/* =================================================== Struct GRTC_STATUS ==================================================== */
/**
  * @brief STATUS [GRTC_STATUS] (unspecified)
  */
typedef struct {
  __IOM uint32_t  LFTIMER;                           /*!< (@ 0x00000000) Low frequency timer status.                           */
  __IOM uint32_t  PWM;                               /*!< (@ 0x00000004) PWM status.                                           */
  __IOM uint32_t  CLKOUT;                            /*!< (@ 0x00000008) CLKOUT configuration status.                          */
} NRF_GRTC_STATUS_Type;                              /*!< Size = 12 (0x00C)                                                    */

/* GRTC_STATUS_LFTIMER: Low frequency timer status. */
  #define GRTC_STATUS_LFTIMER_ResetValue (0x00000001UL) /*!< Reset value of LFTIMER register.                                  */

/* READY @Bit 0 : Low frequency timer is ready or busy. */
  #define GRTC_STATUS_LFTIMER_READY_Pos (0UL)        /*!< Position of READY field.                                             */
  #define GRTC_STATUS_LFTIMER_READY_Msk (0x1UL << GRTC_STATUS_LFTIMER_READY_Pos) /*!< Bit mask of READY field.                 */
  #define GRTC_STATUS_LFTIMER_READY_Min (0x0UL)      /*!< Min enumerator value of READY field.                                 */
  #define GRTC_STATUS_LFTIMER_READY_Max (0x1UL)      /*!< Max enumerator value of READY field.                                 */
  #define GRTC_STATUS_LFTIMER_READY_Busy (0x0UL)     /*!< Busy                                                                 */
  #define GRTC_STATUS_LFTIMER_READY_Ready (0x1UL)    /*!< Ready                                                                */


/* GRTC_STATUS_PWM: PWM status. */
  #define GRTC_STATUS_PWM_ResetValue (0x00000001UL)  /*!< Reset value of PWM register.                                         */

/* READY @Bit 0 : PWM is ready or busy. */
  #define GRTC_STATUS_PWM_READY_Pos (0UL)            /*!< Position of READY field.                                             */
  #define GRTC_STATUS_PWM_READY_Msk (0x1UL << GRTC_STATUS_PWM_READY_Pos) /*!< Bit mask of READY field.                         */
  #define GRTC_STATUS_PWM_READY_Min (0x0UL)          /*!< Min enumerator value of READY field.                                 */
  #define GRTC_STATUS_PWM_READY_Max (0x1UL)          /*!< Max enumerator value of READY field.                                 */
  #define GRTC_STATUS_PWM_READY_Busy (0x0UL)         /*!< Busy                                                                 */
  #define GRTC_STATUS_PWM_READY_Ready (0x1UL)        /*!< Ready                                                                */


/* GRTC_STATUS_CLKOUT: CLKOUT configuration status. */
  #define GRTC_STATUS_CLKOUT_ResetValue (0x00000001UL) /*!< Reset value of CLKOUT register.                                    */

