nrfconnect/sdk-hal_nordic/nrfx/bsp/stable/mdk/nrf54lm20a_enga_types.h
/* ERROR @Bit 7 : Write '1' to disable interrupt for event ERROR */
  #define NFCT_INTENCLR_ERROR_Pos (7UL)              /*!< Position of ERROR field.                                             */
  #define NFCT_INTENCLR_ERROR_Msk (0x1UL << NFCT_INTENCLR_ERROR_Pos) /*!< Bit mask of ERROR field.                             */
  #define NFCT_INTENCLR_ERROR_Min (0x0UL)            /*!< Min enumerator value of ERROR field.                                 */
  #define NFCT_INTENCLR_ERROR_Max (0x1UL)            /*!< Max enumerator value of ERROR field.                                 */
  #define NFCT_INTENCLR_ERROR_Clear (0x1UL)          /*!< Disable                                                              */
  #define NFCT_INTENCLR_ERROR_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define NFCT_INTENCLR_ERROR_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* RXERROR @Bit 10 : Write '1' to disable interrupt for event RXERROR */
  #define NFCT_INTENCLR_RXERROR_Pos (10UL)           /*!< Position of RXERROR field.                                           */
  #define NFCT_INTENCLR_RXERROR_Msk (0x1UL << NFCT_INTENCLR_RXERROR_Pos) /*!< Bit mask of RXERROR field.                       */
  #define NFCT_INTENCLR_RXERROR_Min (0x0UL)          /*!< Min enumerator value of RXERROR field.                               */
  #define NFCT_INTENCLR_RXERROR_Max (0x1UL)          /*!< Max enumerator value of RXERROR field.                               */
  #define NFCT_INTENCLR_RXERROR_Clear (0x1UL)        /*!< Disable                                                              */
  #define NFCT_INTENCLR_RXERROR_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define NFCT_INTENCLR_RXERROR_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* ENDRX @Bit 11 : Write '1' to disable interrupt for event ENDRX */
  #define NFCT_INTENCLR_ENDRX_Pos (11UL)             /*!< Position of ENDRX field.                                             */
  #define NFCT_INTENCLR_ENDRX_Msk (0x1UL << NFCT_INTENCLR_ENDRX_Pos) /*!< Bit mask of ENDRX field.                             */
  #define NFCT_INTENCLR_ENDRX_Min (0x0UL)            /*!< Min enumerator value of ENDRX field.                                 */
  #define NFCT_INTENCLR_ENDRX_Max (0x1UL)            /*!< Max enumerator value of ENDRX field.                                 */
  #define NFCT_INTENCLR_ENDRX_Clear (0x1UL)          /*!< Disable                                                              */
  #define NFCT_INTENCLR_ENDRX_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define NFCT_INTENCLR_ENDRX_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* ENDTX @Bit 12 : Write '1' to disable interrupt for event ENDTX */
  #define NFCT_INTENCLR_ENDTX_Pos (12UL)             /*!< Position of ENDTX field.                                             */
  #define NFCT_INTENCLR_ENDTX_Msk (0x1UL << NFCT_INTENCLR_ENDTX_Pos) /*!< Bit mask of ENDTX field.                             */
  #define NFCT_INTENCLR_ENDTX_Min (0x0UL)            /*!< Min enumerator value of ENDTX field.                                 */
  #define NFCT_INTENCLR_ENDTX_Max (0x1UL)            /*!< Max enumerator value of ENDTX field.                                 */
  #define NFCT_INTENCLR_ENDTX_Clear (0x1UL)          /*!< Disable                                                              */
  #define NFCT_INTENCLR_ENDTX_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define NFCT_INTENCLR_ENDTX_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* AUTOCOLRESSTARTED @Bit 14 : Write '1' to disable interrupt for event AUTOCOLRESSTARTED */
  #define NFCT_INTENCLR_AUTOCOLRESSTARTED_Pos (14UL) /*!< Position of AUTOCOLRESSTARTED field.                                 */
  #define NFCT_INTENCLR_AUTOCOLRESSTARTED_Msk (0x1UL << NFCT_INTENCLR_AUTOCOLRESSTARTED_Pos) /*!< Bit mask of AUTOCOLRESSTARTED
                                                                            field.*/
  #define NFCT_INTENCLR_AUTOCOLRESSTARTED_Min (0x0UL) /*!< Min enumerator value of AUTOCOLRESSTARTED field.                    */
  #define NFCT_INTENCLR_AUTOCOLRESSTARTED_Max (0x1UL) /*!< Max enumerator value of AUTOCOLRESSTARTED field.                    */
  #define NFCT_INTENCLR_AUTOCOLRESSTARTED_Clear (0x1UL) /*!< Disable                                                           */
  #define NFCT_INTENCLR_AUTOCOLRESSTARTED_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define NFCT_INTENCLR_AUTOCOLRESSTARTED_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* COLLISION @Bit 18 : Write '1' to disable interrupt for event COLLISION */
  #define NFCT_INTENCLR_COLLISION_Pos (18UL)         /*!< Position of COLLISION field.                                         */
  #define NFCT_INTENCLR_COLLISION_Msk (0x1UL << NFCT_INTENCLR_COLLISION_Pos) /*!< Bit mask of COLLISION field.                 */
  #define NFCT_INTENCLR_COLLISION_Min (0x0UL)        /*!< Min enumerator value of COLLISION field.                             */
  #define NFCT_INTENCLR_COLLISION_Max (0x1UL)        /*!< Max enumerator value of COLLISION field.                             */
  #define NFCT_INTENCLR_COLLISION_Clear (0x1UL)      /*!< Disable                                                              */
  #define NFCT_INTENCLR_COLLISION_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define NFCT_INTENCLR_COLLISION_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* SELECTED @Bit 19 : Write '1' to disable interrupt for event SELECTED */
  #define NFCT_INTENCLR_SELECTED_Pos (19UL)          /*!< Position of SELECTED field.                                          */
  #define NFCT_INTENCLR_SELECTED_Msk (0x1UL << NFCT_INTENCLR_SELECTED_Pos) /*!< Bit mask of SELECTED field.                    */
  #define NFCT_INTENCLR_SELECTED_Min (0x0UL)         /*!< Min enumerator value of SELECTED field.                              */
  #define NFCT_INTENCLR_SELECTED_Max (0x1UL)         /*!< Max enumerator value of SELECTED field.                              */
  #define NFCT_INTENCLR_SELECTED_Clear (0x1UL)       /*!< Disable                                                              */
  #define NFCT_INTENCLR_SELECTED_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define NFCT_INTENCLR_SELECTED_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* STARTED @Bit 20 : Write '1' to disable interrupt for event STARTED */
  #define NFCT_INTENCLR_STARTED_Pos (20UL)           /*!< Position of STARTED field.                                           */
  #define NFCT_INTENCLR_STARTED_Msk (0x1UL << NFCT_INTENCLR_STARTED_Pos) /*!< Bit mask of STARTED field.                       */
  #define NFCT_INTENCLR_STARTED_Min (0x0UL)          /*!< Min enumerator value of STARTED field.                               */
  #define NFCT_INTENCLR_STARTED_Max (0x1UL)          /*!< Max enumerator value of STARTED field.                               */
  #define NFCT_INTENCLR_STARTED_Clear (0x1UL)        /*!< Disable                                                              */
  #define NFCT_INTENCLR_STARTED_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define NFCT_INTENCLR_STARTED_Enabled (0x1UL)      /*!< Read: Enabled                                                        */


/* NFCT_ERRORSTATUS: NFC Error Status register */
  #define NFCT_ERRORSTATUS_ResetValue (0x00000000UL) /*!< Reset value of ERRORSTATUS register.                                 */

/* FRAMEDELAYTIMEOUT @Bit 0 : No STARTTX task triggered before expiration of the time set in FRAMEDELAYMAX */
  #define NFCT_ERRORSTATUS_FRAMEDELAYTIMEOUT_Pos (0UL) /*!< Position of FRAMEDELAYTIMEOUT field.                               */
  #define NFCT_ERRORSTATUS_FRAMEDELAYTIMEOUT_Msk (0x1UL << NFCT_ERRORSTATUS_FRAMEDELAYTIMEOUT_Pos) /*!< Bit mask of
                                                                            FRAMEDELAYTIMEOUT field.*/


/* NFCT_NFCTAGSTATE: Current operating state of NFC tag */
  #define NFCT_NFCTAGSTATE_ResetValue (0x00000000UL) /*!< Reset value of NFCTAGSTATE register.                                 */

/* NFCTAGSTATE @Bits 0..2 : NfcTag state */
  #define NFCT_NFCTAGSTATE_NFCTAGSTATE_Pos (0UL)     /*!< Position of NFCTAGSTATE field.                                       */
  #define NFCT_NFCTAGSTATE_NFCTAGSTATE_Msk (0x7UL << NFCT_NFCTAGSTATE_NFCTAGSTATE_Pos) /*!< Bit mask of NFCTAGSTATE field.     */
  #define NFCT_NFCTAGSTATE_NFCTAGSTATE_Min (0x0UL)   /*!< Min enumerator value of NFCTAGSTATE field.                           */
  #define NFCT_NFCTAGSTATE_NFCTAGSTATE_Max (0x6UL)   /*!< Max enumerator value of NFCTAGSTATE field.                           */
  #define NFCT_NFCTAGSTATE_NFCTAGSTATE_Disabled (0x0UL) /*!< Disabled or sense                                                 */
  #define NFCT_NFCTAGSTATE_NFCTAGSTATE_RampUp (0x2UL) /*!< RampUp                                                              */
  #define NFCT_NFCTAGSTATE_NFCTAGSTATE_Idle (0x3UL)  /*!< Idle                                                                 */
  #define NFCT_NFCTAGSTATE_NFCTAGSTATE_Receive (0x4UL) /*!< Receive                                                            */
  #define NFCT_NFCTAGSTATE_NFCTAGSTATE_FrameDelay (0x5UL) /*!< FrameDelay                                                      */
  #define NFCT_NFCTAGSTATE_NFCTAGSTATE_Transmit (0x6UL) /*!< Transmit                                                          */


