nrfconnect/sdk-hal_nordic/nrfx/bsp/stable/mdk/nrf54lm20a_enga_types.h
/* =================================================== Struct OSCILLATORS ==================================================== */
/**
  * @brief Oscillator control
  */
  typedef struct {                                   /*!< OSCILLATORS Structure                                                */
    __IM uint32_t RESERVED[448];
    __IOM NRF_OSCILLATORS_XOSC32M_Type XOSC32M;      /*!< (@ 0x00000700) 32 MHz oscillator control                             */
    __IM uint32_t RESERVED1[56];
    __IOM NRF_OSCILLATORS_PLL_Type PLL;              /*!< (@ 0x00000800) Oscillator control                                    */
    __IM uint32_t RESERVED2[62];
    __IOM NRF_OSCILLATORS_XOSC32KI_Type XOSC32KI;    /*!< (@ 0x00000900) 32.768 kHz oscillator control                         */
  } NRF_OSCILLATORS_Type;                            /*!< Size = 2312 (0x908)                                                  */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            PDM                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct PDM_EVENTS_DMA ================================================== */
/**
  * @brief EVENTS_DMA [PDM_EVENTS_DMA] Peripheral events.
  */
typedef struct {
  __IOM uint32_t  BUSERROR;                          /*!< (@ 0x00000000) This event is generated if an error occurs during the
                                                                         bus transfer.*/
} NRF_PDM_EVENTS_DMA_Type;                           /*!< Size = 4 (0x004)                                                     */

/* PDM_EVENTS_DMA_BUSERROR: This event is generated if an error occurs during the bus transfer. */
  #define PDM_EVENTS_DMA_BUSERROR_ResetValue (0x00000000UL) /*!< Reset value of BUSERROR register.                             */

/* BUSERROR @Bit 0 : This event is generated if an error occurs during the bus transfer. */
  #define PDM_EVENTS_DMA_BUSERROR_BUSERROR_Pos (0UL) /*!< Position of BUSERROR field.                                          */
  #define PDM_EVENTS_DMA_BUSERROR_BUSERROR_Msk (0x1UL << PDM_EVENTS_DMA_BUSERROR_BUSERROR_Pos) /*!< Bit mask of BUSERROR field.*/
  #define PDM_EVENTS_DMA_BUSERROR_BUSERROR_Min (0x0UL) /*!< Min enumerator value of BUSERROR field.                            */
  #define PDM_EVENTS_DMA_BUSERROR_BUSERROR_Max (0x1UL) /*!< Max enumerator value of BUSERROR field.                            */
  #define PDM_EVENTS_DMA_BUSERROR_BUSERROR_NotGenerated (0x0UL) /*!< Event not generated                                       */
  #define PDM_EVENTS_DMA_BUSERROR_BUSERROR_Generated (0x1UL) /*!< Event generated                                              */



/* ================================================= Struct PDM_PUBLISH_DMA ================================================== */
/**
  * @brief PUBLISH_DMA [PDM_PUBLISH_DMA] Publish configuration for events
  */
typedef struct {
  __IOM uint32_t  BUSERROR;                          /*!< (@ 0x00000000) Publish configuration for event DMA.BUSERROR          */
} NRF_PDM_PUBLISH_DMA_Type;                          /*!< Size = 4 (0x004)                                                     */

/* PDM_PUBLISH_DMA_BUSERROR: Publish configuration for event DMA.BUSERROR */
  #define PDM_PUBLISH_DMA_BUSERROR_ResetValue (0x00000000UL) /*!< Reset value of BUSERROR register.                            */

/* CHIDX @Bits 0..7 : DPPI channel that event DMA.BUSERROR will publish to */
  #define PDM_PUBLISH_DMA_BUSERROR_CHIDX_Pos (0UL)   /*!< Position of CHIDX field.                                             */
  #define PDM_PUBLISH_DMA_BUSERROR_CHIDX_Msk (0xFFUL << PDM_PUBLISH_DMA_BUSERROR_CHIDX_Pos) /*!< Bit mask of CHIDX field.      */
  #define PDM_PUBLISH_DMA_BUSERROR_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                           */
  #define PDM_PUBLISH_DMA_BUSERROR_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                            */

/* EN @Bit 31 : (unspecified) */
  #define PDM_PUBLISH_DMA_BUSERROR_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define PDM_PUBLISH_DMA_BUSERROR_EN_Msk (0x1UL << PDM_PUBLISH_DMA_BUSERROR_EN_Pos) /*!< Bit mask of EN field.                */
  #define PDM_PUBLISH_DMA_BUSERROR_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define PDM_PUBLISH_DMA_BUSERROR_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define PDM_PUBLISH_DMA_BUSERROR_EN_Disabled (0x0UL) /*!< Disable publishing                                                 */
  #define PDM_PUBLISH_DMA_BUSERROR_EN_Enabled (0x1UL) /*!< Enable publishing                                                   */



/* ==================================================== Struct PDM_FILTER ==================================================== */
/**
  * @brief FILTER [PDM_FILTER] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CTRL;                              /*!< (@ 0x00000000) Aditional PDM configurability                         */
  __IOM uint32_t  HPPOLE;                            /*!< (@ 0x00000004) Settings for the high-pass filter                     */
  __IOM uint32_t  HPDISABLE;                         /*!< (@ 0x00000008) High pass filter disable                              */
  __IOM uint32_t  SOFTMUTE;                          /*!< (@ 0x0000000C) Soft mute function                                    */
  __IOM uint32_t  SOFTCYCLES;                        /*!< (@ 0x00000010) Soft mute settings                                    */
  __IOM uint32_t  SAMPLEDELAY;                       /*!< (@ 0x00000014) Input Data Sampling with Number of ckFilterL (double
                                                                         frequency of PDM_CLK) Clock Cycle Delay.
                                                                         Optionally,input sample point can be delayed
                                                                         independently on left and right channels using
                                                                         FILTER:CTRL[20:19] bits*/
} NRF_PDM_FILTER_Type;                               /*!< Size = 24 (0x018)                                                    */

