nrfconnect/sdk-hal_nordic/nrfx/bsp/stable/mdk/nrf54lm20a_enga_types.h
/* PDM_FILTER_CTRL: Aditional PDM configurability */
  #define PDM_FILTER_CTRL_ResetValue (0x4EE0D200UL)  /*!< Reset value of CTRL register.                                        */

/* OVERRIDERIGHTSOFTMUTE @Bit 6 : Override soft mute enable for right channel */
  #define PDM_FILTER_CTRL_OVERRIDERIGHTSOFTMUTE_Pos (6UL) /*!< Position of OVERRIDERIGHTSOFTMUTE field.                        */
  #define PDM_FILTER_CTRL_OVERRIDERIGHTSOFTMUTE_Msk (0x1UL << PDM_FILTER_CTRL_OVERRIDERIGHTSOFTMUTE_Pos) /*!< Bit mask of
                                                                            OVERRIDERIGHTSOFTMUTE field.*/
  #define PDM_FILTER_CTRL_OVERRIDERIGHTSOFTMUTE_Min (0x0UL) /*!< Min enumerator value of OVERRIDERIGHTSOFTMUTE field.          */
  #define PDM_FILTER_CTRL_OVERRIDERIGHTSOFTMUTE_Max (0x1UL) /*!< Max enumerator value of OVERRIDERIGHTSOFTMUTE field.          */
  #define PDM_FILTER_CTRL_OVERRIDERIGHTSOFTMUTE_Disable (0x0UL) /*!< No action                                                 */
  #define PDM_FILTER_CTRL_OVERRIDERIGHTSOFTMUTE_Enable (0x1UL) /*!< override and disable soft mute                             */

/* OVERRIDELEFTSOFTMUTE @Bit 7 : Override soft mute enable for left channel */
  #define PDM_FILTER_CTRL_OVERRIDELEFTSOFTMUTE_Pos (7UL) /*!< Position of OVERRIDELEFTSOFTMUTE field.                          */
  #define PDM_FILTER_CTRL_OVERRIDELEFTSOFTMUTE_Msk (0x1UL << PDM_FILTER_CTRL_OVERRIDELEFTSOFTMUTE_Pos) /*!< Bit mask of
                                                                            OVERRIDELEFTSOFTMUTE field.*/
  #define PDM_FILTER_CTRL_OVERRIDELEFTSOFTMUTE_Min (0x0UL) /*!< Min enumerator value of OVERRIDELEFTSOFTMUTE field.            */
  #define PDM_FILTER_CTRL_OVERRIDELEFTSOFTMUTE_Max (0x1UL) /*!< Max enumerator value of OVERRIDELEFTSOFTMUTE field.            */
  #define PDM_FILTER_CTRL_OVERRIDELEFTSOFTMUTE_Disable (0x0UL) /*!< No action                                                  */
  #define PDM_FILTER_CTRL_OVERRIDELEFTSOFTMUTE_Enable (0x1UL) /*!< override and disable soft mute                              */

/* GAINADD0P25 @Bit 8 : Add +0.25dB to the gain stage */
  #define PDM_FILTER_CTRL_GAINADD0P25_Pos (8UL)      /*!< Position of GAINADD0P25 field.                                       */
  #define PDM_FILTER_CTRL_GAINADD0P25_Msk (0x1UL << PDM_FILTER_CTRL_GAINADD0P25_Pos) /*!< Bit mask of GAINADD0P25 field.       */
  #define PDM_FILTER_CTRL_GAINADD0P25_Min (0x0UL)    /*!< Min enumerator value of GAINADD0P25 field.                           */
  #define PDM_FILTER_CTRL_GAINADD0P25_Max (0x1UL)    /*!< Max enumerator value of GAINADD0P25 field.                           */
  #define PDM_FILTER_CTRL_GAINADD0P25_Disable (0x0UL) /*!< Nothing added                                                       */
  #define PDM_FILTER_CTRL_GAINADD0P25_Enable (0x1UL) /*!< +0.25dB added                                                        */

/* MINORSTEP025CUSTOM @Bit 9 : Compensates Gain with +0.25dB */
  #define PDM_FILTER_CTRL_MINORSTEP025CUSTOM_Pos (9UL) /*!< Position of MINORSTEP025CUSTOM field.                              */
  #define PDM_FILTER_CTRL_MINORSTEP025CUSTOM_Msk (0x1UL << PDM_FILTER_CTRL_MINORSTEP025CUSTOM_Pos) /*!< Bit mask of
                                                                            MINORSTEP025CUSTOM field.*/
  #define PDM_FILTER_CTRL_MINORSTEP025CUSTOM_Min (0x0UL) /*!< Min enumerator value of MINORSTEP025CUSTOM field.                */
  #define PDM_FILTER_CTRL_MINORSTEP025CUSTOM_Max (0x1UL) /*!< Max enumerator value of MINORSTEP025CUSTOM field.                */
  #define PDM_FILTER_CTRL_MINORSTEP025CUSTOM_Disable (0x0UL) /*!< Nothing added                                                */
  #define PDM_FILTER_CTRL_MINORSTEP025CUSTOM_Enable (0x1UL) /*!< +0.25dB added                                                 */

/* MINORSTEP050CUSTOM @Bits 10..13 : Compensates Gain with +0.5dB steps */
  #define PDM_FILTER_CTRL_MINORSTEP050CUSTOM_Pos (10UL) /*!< Position of MINORSTEP050CUSTOM field.                             */
  #define PDM_FILTER_CTRL_MINORSTEP050CUSTOM_Msk (0xFUL << PDM_FILTER_CTRL_MINORSTEP050CUSTOM_Pos) /*!< Bit mask of
                                                                            MINORSTEP050CUSTOM field.*/
  #define PDM_FILTER_CTRL_MINORSTEP050CUSTOM_Min (0x0UL) /*!< Min value of MINORSTEP050CUSTOM field.                           */
  #define PDM_FILTER_CTRL_MINORSTEP050CUSTOM_Max (0xCUL) /*!< Max size of MINORSTEP050CUSTOM field.                            */

/* SOFTCYCLES @Bits 14..17 : Custom number of cycles for soft gain/mute function 32*(Multiplication+1) steps */
  #define PDM_FILTER_CTRL_SOFTCYCLES_Pos (14UL)      /*!< Position of SOFTCYCLES field.                                        */
  #define PDM_FILTER_CTRL_SOFTCYCLES_Msk (0xFUL << PDM_FILTER_CTRL_SOFTCYCLES_Pos) /*!< Bit mask of SOFTCYCLES field.          */
  #define PDM_FILTER_CTRL_SOFTCYCLES_Min (0x0UL)     /*!< Min value of SOFTCYCLES field.                                       */
  #define PDM_FILTER_CTRL_SOFTCYCLES_Max (0xFUL)     /*!< Max size of SOFTCYCLES field.                                        */

/* DATASAMPLEDELAY @Bits 19..20 : Input data sampling point delay in PDM_CLK cycels */
  #define PDM_FILTER_CTRL_DATASAMPLEDELAY_Pos (19UL) /*!< Position of DATASAMPLEDELAY field.                                   */
  #define PDM_FILTER_CTRL_DATASAMPLEDELAY_Msk (0x3UL << PDM_FILTER_CTRL_DATASAMPLEDELAY_Pos) /*!< Bit mask of DATASAMPLEDELAY
                                                                            field.*/
  #define PDM_FILTER_CTRL_DATASAMPLEDELAY_Min (0x0UL) /*!< Min enumerator value of DATASAMPLEDELAY field.                      */
  #define PDM_FILTER_CTRL_DATASAMPLEDELAY_Max (0x3UL) /*!< Max enumerator value of DATASAMPLEDELAY field.                      */
  #define PDM_FILTER_CTRL_DATASAMPLEDELAY_NoDelay (0x0UL) /*!< No added delay                                                  */
  #define PDM_FILTER_CTRL_DATASAMPLEDELAY_DelayOnLeft (0x1UL) /*!< 1 clock cycle delay on left channel                         */
  #define PDM_FILTER_CTRL_DATASAMPLEDELAY_DelayOnRight (0x2UL) /*!< 1 clock cycle delay on right channel                       */
  #define PDM_FILTER_CTRL_DATASAMPLEDELAY_DelayOnBoth (0x3UL) /*!< 1 clock cycle delay on both channels                        */

/* CICFILTERMSBCUSTOM @Bits 21..24 : Defines MSB for CIC fliter when RATIO is set to 'custom' */
  #define PDM_FILTER_CTRL_CICFILTERMSBCUSTOM_Pos (21UL) /*!< Position of CICFILTERMSBCUSTOM field.                             */
  #define PDM_FILTER_CTRL_CICFILTERMSBCUSTOM_Msk (0xFUL << PDM_FILTER_CTRL_CICFILTERMSBCUSTOM_Pos) /*!< Bit mask of
                                                                            CICFILTERMSBCUSTOM field.*/
  #define PDM_FILTER_CTRL_CICFILTERMSBCUSTOM_Min (0x0UL) /*!< Min enumerator value of CICFILTERMSBCUSTOM field.                */
  #define PDM_FILTER_CTRL_CICFILTERMSBCUSTOM_Max (0xFUL) /*!< Max enumerator value of CICFILTERMSBCUSTOM field.                */
  #define PDM_FILTER_CTRL_CICFILTERMSBCUSTOM_Range0 (0x0UL) /*!< OSR range low 4 OSR range high 32                             */
  #define PDM_FILTER_CTRL_CICFILTERMSBCUSTOM_Range1 (0x1UL) /*!< OSR range low 34 OSR range high 36                            */
  #define PDM_FILTER_CTRL_CICFILTERMSBCUSTOM_Range2 (0x2UL) /*!< OSR range low 38 OSR range high 42                            */
  #define PDM_FILTER_CTRL_CICFILTERMSBCUSTOM_Range3 (0x3UL) /*!< OSR range low 44 OSR range high 48                            */
  #define PDM_FILTER_CTRL_CICFILTERMSBCUSTOM_Range4 (0x4UL) /*!< OSR range low 50 OSR range high 54                            */
  #define PDM_FILTER_CTRL_CICFILTERMSBCUSTOM_Range5 (0x5UL) /*!< OSR range low 56 OSR range high 64                            */
  #define PDM_FILTER_CTRL_CICFILTERMSBCUSTOM_Range6 (0x6UL) /*!< OSR range low 66 OSR range high 72                            */
  #define PDM_FILTER_CTRL_CICFILTERMSBCUSTOM_Range7 (0x7UL) /*!< OSR range low 74 OSR range high 84                            */
  #define PDM_FILTER_CTRL_CICFILTERMSBCUSTOM_Range8 (0x8UL) /*!< OSR range low 86 OSR range high 96                            */
  #define PDM_FILTER_CTRL_CICFILTERMSBCUSTOM_Range9 (0x9UL) /*!< OSR range low 98 OSR range high 110                           */
  #define PDM_FILTER_CTRL_CICFILTERMSBCUSTOM_Range10 (0xAUL) /*!< OSR range low 112 OSR range high 128                         */
  #define PDM_FILTER_CTRL_CICFILTERMSBCUSTOM_Range11 (0xBUL) /*!< OSR range low 130 OSR range high 146                         */
  #define PDM_FILTER_CTRL_CICFILTERMSBCUSTOM_Range12 (0xCUL) /*!< OSR range low 148 OSR range high 168                         */
  #define PDM_FILTER_CTRL_CICFILTERMSBCUSTOM_Range13 (0xDUL) /*!< OSR range low 170 OSR range high 194                         */
  #define PDM_FILTER_CTRL_CICFILTERMSBCUSTOM_Range14 (0xEUL) /*!< OSR range low 196 OSR range high 222                         */
  #define PDM_FILTER_CTRL_CICFILTERMSBCUSTOM_Range15 (0xFUL) /*!< OSR range low 224 OSR range high 256                         */

/* DECRATIO @Bits 25..31 : Configures decimation ratio to any even number between 6 and 256 */
  #define PDM_FILTER_CTRL_DECRATIO_Pos (25UL)        /*!< Position of DECRATIO field.                                          */
  #define PDM_FILTER_CTRL_DECRATIO_Msk (0x7FUL << PDM_FILTER_CTRL_DECRATIO_Pos) /*!< Bit mask of DECRATIO field.               */
  #define PDM_FILTER_CTRL_DECRATIO_Min (0x02UL)      /*!< Min value of DECRATIO field.                                         */
  #define PDM_FILTER_CTRL_DECRATIO_Max (0x7FUL)      /*!< Max size of DECRATIO field.                                          */


