nrfconnect/sdk-hal_nordic/nrfx/bsp/stable/mdk/nrf54lm20a_enga_types.h
/* PDM_FILTER_SAMPLEDELAY: Input Data Sampling with Number of ckFilterL (double frequency of PDM_CLK) Clock Cycle Delay.
                            Optionally,input sample point can be delayed independently on left and right channels using
                            FILTER:CTRL[20:19] bits */

  #define PDM_FILTER_SAMPLEDELAY_ResetValue (0x00000000UL) /*!< Reset value of SAMPLEDELAY register.                           */

/* DELAY @Bit 0 : Input Data Sampling with Number of ckFilterL (double frequency of PDM_CLK) Clock Cycle Delay */
  #define PDM_FILTER_SAMPLEDELAY_DELAY_Pos (0UL)     /*!< Position of DELAY field.                                             */
  #define PDM_FILTER_SAMPLEDELAY_DELAY_Msk (0x1UL << PDM_FILTER_SAMPLEDELAY_DELAY_Pos) /*!< Bit mask of DELAY field.           */
  #define PDM_FILTER_SAMPLEDELAY_DELAY_Min (0x0UL)   /*!< Min enumerator value of DELAY field.                                 */
  #define PDM_FILTER_SAMPLEDELAY_DELAY_Max (0x1UL)   /*!< Max enumerator value of DELAY field.                                 */
  #define PDM_FILTER_SAMPLEDELAY_DELAY_no_delay (0x0UL) /*!< No delay                                                          */
  #define PDM_FILTER_SAMPLEDELAY_DELAY_x1 (0x1UL)    /*!< 1 cycle                                                              */



/* ===================================================== Struct PDM_PSEL ===================================================== */
/**
  * @brief PSEL [PDM_PSEL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CLK;                               /*!< (@ 0x00000000) Pin number configuration for PDM CLK signal           */
  __IOM uint32_t  DIN;                               /*!< (@ 0x00000004) Pin number configuration for PDM DIN signal           */
} NRF_PDM_PSEL_Type;                                 /*!< Size = 8 (0x008)                                                     */

/* PDM_PSEL_CLK: Pin number configuration for PDM CLK signal */
  #define PDM_PSEL_CLK_ResetValue (0xFFFFFFFFUL)     /*!< Reset value of CLK register.                                         */

/* PIN @Bits 0..4 : Pin number */
  #define PDM_PSEL_CLK_PIN_Pos (0UL)                 /*!< Position of PIN field.                                               */
  #define PDM_PSEL_CLK_PIN_Msk (0x1FUL << PDM_PSEL_CLK_PIN_Pos) /*!< Bit mask of PIN field.                                    */
  #define PDM_PSEL_CLK_PIN_Min (0x00UL)              /*!< Min value of PIN field.                                              */
  #define PDM_PSEL_CLK_PIN_Max (0x1FUL)              /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..7 : Port number */
  #define PDM_PSEL_CLK_PORT_Pos (5UL)                /*!< Position of PORT field.                                              */
  #define PDM_PSEL_CLK_PORT_Msk (0x7UL << PDM_PSEL_CLK_PORT_Pos) /*!< Bit mask of PORT field.                                  */
  #define PDM_PSEL_CLK_PORT_Min (0x0UL)              /*!< Min value of PORT field.                                             */
  #define PDM_PSEL_CLK_PORT_Max (0x7UL)              /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define PDM_PSEL_CLK_CONNECT_Pos (31UL)            /*!< Position of CONNECT field.                                           */
  #define PDM_PSEL_CLK_CONNECT_Msk (0x1UL << PDM_PSEL_CLK_CONNECT_Pos) /*!< Bit mask of CONNECT field.                         */
  #define PDM_PSEL_CLK_CONNECT_Min (0x0UL)           /*!< Min enumerator value of CONNECT field.                               */
  #define PDM_PSEL_CLK_CONNECT_Max (0x1UL)           /*!< Max enumerator value of CONNECT field.                               */
  #define PDM_PSEL_CLK_CONNECT_Disconnected (0x1UL)  /*!< Disconnect                                                           */
  #define PDM_PSEL_CLK_CONNECT_Connected (0x0UL)     /*!< Connect                                                              */


/* PDM_PSEL_DIN: Pin number configuration for PDM DIN signal */
  #define PDM_PSEL_DIN_ResetValue (0xFFFFFFFFUL)     /*!< Reset value of DIN register.                                         */

/* PIN @Bits 0..4 : Pin number */
  #define PDM_PSEL_DIN_PIN_Pos (0UL)                 /*!< Position of PIN field.                                               */
  #define PDM_PSEL_DIN_PIN_Msk (0x1FUL << PDM_PSEL_DIN_PIN_Pos) /*!< Bit mask of PIN field.                                    */
  #define PDM_PSEL_DIN_PIN_Min (0x00UL)              /*!< Min value of PIN field.                                              */
  #define PDM_PSEL_DIN_PIN_Max (0x1FUL)              /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..7 : Port number */
  #define PDM_PSEL_DIN_PORT_Pos (5UL)                /*!< Position of PORT field.                                              */
  #define PDM_PSEL_DIN_PORT_Msk (0x7UL << PDM_PSEL_DIN_PORT_Pos) /*!< Bit mask of PORT field.                                  */
  #define PDM_PSEL_DIN_PORT_Min (0x0UL)              /*!< Min value of PORT field.                                             */
  #define PDM_PSEL_DIN_PORT_Max (0x7UL)              /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define PDM_PSEL_DIN_CONNECT_Pos (31UL)            /*!< Position of CONNECT field.                                           */
  #define PDM_PSEL_DIN_CONNECT_Msk (0x1UL << PDM_PSEL_DIN_CONNECT_Pos) /*!< Bit mask of CONNECT field.                         */
  #define PDM_PSEL_DIN_CONNECT_Min (0x0UL)           /*!< Min enumerator value of CONNECT field.                               */
  #define PDM_PSEL_DIN_CONNECT_Max (0x1UL)           /*!< Max enumerator value of CONNECT field.                               */
  #define PDM_PSEL_DIN_CONNECT_Disconnected (0x1UL)  /*!< Disconnect                                                           */
  #define PDM_PSEL_DIN_CONNECT_Connected (0x0UL)     /*!< Connect                                                              */



/* ==================================================== Struct PDM_SAMPLE ==================================================== */
/**
  * @brief SAMPLE [PDM_SAMPLE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PTR;                               /*!< (@ 0x00000000) RAM address pointer to write samples to with EasyDMA  */
  __IOM uint32_t  MAXCNT;                            /*!< (@ 0x00000004) Number of bytes to allocate memory for in EasyDMA mode*/
} NRF_PDM_SAMPLE_Type;                               /*!< Size = 8 (0x008)                                                     */

