nrfconnect/sdk-hal_nordic/nrfx/bsp/stable/mdk/nrf54lm20a_enga_types.h
/* CHIDX @Bits 0..7 : DPPI channel that task CONSTLAT will subscribe to */
  #define POWER_SUBSCRIBE_CONSTLAT_CHIDX_Pos (0UL)   /*!< Position of CHIDX field.                                             */
  #define POWER_SUBSCRIBE_CONSTLAT_CHIDX_Msk (0xFFUL << POWER_SUBSCRIBE_CONSTLAT_CHIDX_Pos) /*!< Bit mask of CHIDX field.      */
  #define POWER_SUBSCRIBE_CONSTLAT_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                           */
  #define POWER_SUBSCRIBE_CONSTLAT_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                            */

/* EN @Bit 31 : (unspecified) */
  #define POWER_SUBSCRIBE_CONSTLAT_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define POWER_SUBSCRIBE_CONSTLAT_EN_Msk (0x1UL << POWER_SUBSCRIBE_CONSTLAT_EN_Pos) /*!< Bit mask of EN field.                */
  #define POWER_SUBSCRIBE_CONSTLAT_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define POWER_SUBSCRIBE_CONSTLAT_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define POWER_SUBSCRIBE_CONSTLAT_EN_Disabled (0x0UL) /*!< Disable subscription                                               */
  #define POWER_SUBSCRIBE_CONSTLAT_EN_Enabled (0x1UL) /*!< Enable subscription                                                 */


/* POWER_SUBSCRIBE_LOWPWR: Subscribe configuration for task LOWPWR */
  #define POWER_SUBSCRIBE_LOWPWR_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_LOWPWR register.                      */

/* CHIDX @Bits 0..7 : DPPI channel that task LOWPWR will subscribe to */
  #define POWER_SUBSCRIBE_LOWPWR_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define POWER_SUBSCRIBE_LOWPWR_CHIDX_Msk (0xFFUL << POWER_SUBSCRIBE_LOWPWR_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define POWER_SUBSCRIBE_LOWPWR_CHIDX_Min (0x00UL)  /*!< Min value of CHIDX field.                                            */
  #define POWER_SUBSCRIBE_LOWPWR_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define POWER_SUBSCRIBE_LOWPWR_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define POWER_SUBSCRIBE_LOWPWR_EN_Msk (0x1UL << POWER_SUBSCRIBE_LOWPWR_EN_Pos) /*!< Bit mask of EN field.                    */
  #define POWER_SUBSCRIBE_LOWPWR_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define POWER_SUBSCRIBE_LOWPWR_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define POWER_SUBSCRIBE_LOWPWR_EN_Disabled (0x0UL) /*!< Disable subscription                                                 */
  #define POWER_SUBSCRIBE_LOWPWR_EN_Enabled (0x1UL)  /*!< Enable subscription                                                  */


/* POWER_EVENTS_POFWARN: Power failure warning */
  #define POWER_EVENTS_POFWARN_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_POFWARN register.                          */

/* EVENTS_POFWARN @Bit 0 : Power failure warning */
  #define POWER_EVENTS_POFWARN_EVENTS_POFWARN_Pos (0UL) /*!< Position of EVENTS_POFWARN field.                                 */
  #define POWER_EVENTS_POFWARN_EVENTS_POFWARN_Msk (0x1UL << POWER_EVENTS_POFWARN_EVENTS_POFWARN_Pos) /*!< Bit mask of
                                                                            EVENTS_POFWARN field.*/
  #define POWER_EVENTS_POFWARN_EVENTS_POFWARN_Min (0x0UL) /*!< Min enumerator value of EVENTS_POFWARN field.                   */
  #define POWER_EVENTS_POFWARN_EVENTS_POFWARN_Max (0x1UL) /*!< Max enumerator value of EVENTS_POFWARN field.                   */
  #define POWER_EVENTS_POFWARN_EVENTS_POFWARN_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define POWER_EVENTS_POFWARN_EVENTS_POFWARN_Generated (0x1UL) /*!< Event generated                                           */


/* POWER_EVENTS_SLEEPENTER: CPU entered WFI/WFE sleep */
  #define POWER_EVENTS_SLEEPENTER_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_SLEEPENTER register.                    */

/* EVENTS_SLEEPENTER @Bit 0 : CPU entered WFI/WFE sleep */
  #define POWER_EVENTS_SLEEPENTER_EVENTS_SLEEPENTER_Pos (0UL) /*!< Position of EVENTS_SLEEPENTER field.                        */
  #define POWER_EVENTS_SLEEPENTER_EVENTS_SLEEPENTER_Msk (0x1UL << POWER_EVENTS_SLEEPENTER_EVENTS_SLEEPENTER_Pos) /*!< Bit mask
                                                                            of EVENTS_SLEEPENTER field.*/
  #define POWER_EVENTS_SLEEPENTER_EVENTS_SLEEPENTER_Min (0x0UL) /*!< Min enumerator value of EVENTS_SLEEPENTER field.          */
  #define POWER_EVENTS_SLEEPENTER_EVENTS_SLEEPENTER_Max (0x1UL) /*!< Max enumerator value of EVENTS_SLEEPENTER field.          */
  #define POWER_EVENTS_SLEEPENTER_EVENTS_SLEEPENTER_NotGenerated (0x0UL) /*!< Event not generated                              */
  #define POWER_EVENTS_SLEEPENTER_EVENTS_SLEEPENTER_Generated (0x1UL) /*!< Event generated                                     */


/* POWER_EVENTS_SLEEPEXIT: CPU exited WFI/WFE sleep */
  #define POWER_EVENTS_SLEEPEXIT_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_SLEEPEXIT register.                      */

/* EVENTS_SLEEPEXIT @Bit 0 : CPU exited WFI/WFE sleep */
  #define POWER_EVENTS_SLEEPEXIT_EVENTS_SLEEPEXIT_Pos (0UL) /*!< Position of EVENTS_SLEEPEXIT field.                           */
  #define POWER_EVENTS_SLEEPEXIT_EVENTS_SLEEPEXIT_Msk (0x1UL << POWER_EVENTS_SLEEPEXIT_EVENTS_SLEEPEXIT_Pos) /*!< Bit mask of
                                                                            EVENTS_SLEEPEXIT field.*/
  #define POWER_EVENTS_SLEEPEXIT_EVENTS_SLEEPEXIT_Min (0x0UL) /*!< Min enumerator value of EVENTS_SLEEPEXIT field.             */
  #define POWER_EVENTS_SLEEPEXIT_EVENTS_SLEEPEXIT_Max (0x1UL) /*!< Max enumerator value of EVENTS_SLEEPEXIT field.             */
  #define POWER_EVENTS_SLEEPEXIT_EVENTS_SLEEPEXIT_NotGenerated (0x0UL) /*!< Event not generated                                */
  #define POWER_EVENTS_SLEEPEXIT_EVENTS_SLEEPEXIT_Generated (0x1UL) /*!< Event generated                                       */


/* POWER_PUBLISH_POFWARN: Publish configuration for event POFWARN */
  #define POWER_PUBLISH_POFWARN_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_POFWARN register.                        */

/* CHIDX @Bits 0..7 : DPPI channel that event POFWARN will publish to */
  #define POWER_PUBLISH_POFWARN_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define POWER_PUBLISH_POFWARN_CHIDX_Msk (0xFFUL << POWER_PUBLISH_POFWARN_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define POWER_PUBLISH_POFWARN_CHIDX_Min (0x00UL)   /*!< Min value of CHIDX field.                                            */
  #define POWER_PUBLISH_POFWARN_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define POWER_PUBLISH_POFWARN_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define POWER_PUBLISH_POFWARN_EN_Msk (0x1UL << POWER_PUBLISH_POFWARN_EN_Pos) /*!< Bit mask of EN field.                      */
  #define POWER_PUBLISH_POFWARN_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define POWER_PUBLISH_POFWARN_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define POWER_PUBLISH_POFWARN_EN_Disabled (0x0UL)  /*!< Disable publishing                                                   */
  #define POWER_PUBLISH_POFWARN_EN_Enabled (0x1UL)   /*!< Enable publishing                                                    */


