nrfconnect/sdk-hal_nordic/nrfx/bsp/stable/mdk/nrf54lm20a_enga_types.h
/* DMASEQ1END @Bit 12 : Write '1' to enable interrupt for event DMASEQ1END */
  #define PWM_INTENSET_DMASEQ1END_Pos (12UL)         /*!< Position of DMASEQ1END field.                                        */
  #define PWM_INTENSET_DMASEQ1END_Msk (0x1UL << PWM_INTENSET_DMASEQ1END_Pos) /*!< Bit mask of DMASEQ1END field.                */
  #define PWM_INTENSET_DMASEQ1END_Min (0x0UL)        /*!< Min enumerator value of DMASEQ1END field.                            */
  #define PWM_INTENSET_DMASEQ1END_Max (0x1UL)        /*!< Max enumerator value of DMASEQ1END field.                            */
  #define PWM_INTENSET_DMASEQ1END_Set (0x1UL)        /*!< Enable                                                               */
  #define PWM_INTENSET_DMASEQ1END_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define PWM_INTENSET_DMASEQ1END_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* DMASEQ1READY @Bit 13 : Write '1' to enable interrupt for event DMASEQ1READY */
  #define PWM_INTENSET_DMASEQ1READY_Pos (13UL)       /*!< Position of DMASEQ1READY field.                                      */
  #define PWM_INTENSET_DMASEQ1READY_Msk (0x1UL << PWM_INTENSET_DMASEQ1READY_Pos) /*!< Bit mask of DMASEQ1READY field.          */
  #define PWM_INTENSET_DMASEQ1READY_Min (0x0UL)      /*!< Min enumerator value of DMASEQ1READY field.                          */
  #define PWM_INTENSET_DMASEQ1READY_Max (0x1UL)      /*!< Max enumerator value of DMASEQ1READY field.                          */
  #define PWM_INTENSET_DMASEQ1READY_Set (0x1UL)      /*!< Enable                                                               */
  #define PWM_INTENSET_DMASEQ1READY_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define PWM_INTENSET_DMASEQ1READY_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* DMASEQ1BUSERROR @Bit 14 : Write '1' to enable interrupt for event DMASEQ1BUSERROR */
  #define PWM_INTENSET_DMASEQ1BUSERROR_Pos (14UL)    /*!< Position of DMASEQ1BUSERROR field.                                   */
  #define PWM_INTENSET_DMASEQ1BUSERROR_Msk (0x1UL << PWM_INTENSET_DMASEQ1BUSERROR_Pos) /*!< Bit mask of DMASEQ1BUSERROR field. */
  #define PWM_INTENSET_DMASEQ1BUSERROR_Min (0x0UL)   /*!< Min enumerator value of DMASEQ1BUSERROR field.                       */
  #define PWM_INTENSET_DMASEQ1BUSERROR_Max (0x1UL)   /*!< Max enumerator value of DMASEQ1BUSERROR field.                       */
  #define PWM_INTENSET_DMASEQ1BUSERROR_Set (0x1UL)   /*!< Enable                                                               */
  #define PWM_INTENSET_DMASEQ1BUSERROR_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define PWM_INTENSET_DMASEQ1BUSERROR_Enabled (0x1UL) /*!< Read: Enabled                                                      */

/* COMPAREMATCH0 @Bit 15 : Write '1' to enable interrupt for event COMPAREMATCH[0] */
  #define PWM_INTENSET_COMPAREMATCH0_Pos (15UL)      /*!< Position of COMPAREMATCH0 field.                                     */
  #define PWM_INTENSET_COMPAREMATCH0_Msk (0x1UL << PWM_INTENSET_COMPAREMATCH0_Pos) /*!< Bit mask of COMPAREMATCH0 field.       */
  #define PWM_INTENSET_COMPAREMATCH0_Min (0x0UL)     /*!< Min enumerator value of COMPAREMATCH0 field.                         */
  #define PWM_INTENSET_COMPAREMATCH0_Max (0x1UL)     /*!< Max enumerator value of COMPAREMATCH0 field.                         */
  #define PWM_INTENSET_COMPAREMATCH0_Set (0x1UL)     /*!< Enable                                                               */
  #define PWM_INTENSET_COMPAREMATCH0_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define PWM_INTENSET_COMPAREMATCH0_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* COMPAREMATCH1 @Bit 16 : Write '1' to enable interrupt for event COMPAREMATCH[1] */
  #define PWM_INTENSET_COMPAREMATCH1_Pos (16UL)      /*!< Position of COMPAREMATCH1 field.                                     */
  #define PWM_INTENSET_COMPAREMATCH1_Msk (0x1UL << PWM_INTENSET_COMPAREMATCH1_Pos) /*!< Bit mask of COMPAREMATCH1 field.       */
  #define PWM_INTENSET_COMPAREMATCH1_Min (0x0UL)     /*!< Min enumerator value of COMPAREMATCH1 field.                         */
  #define PWM_INTENSET_COMPAREMATCH1_Max (0x1UL)     /*!< Max enumerator value of COMPAREMATCH1 field.                         */
  #define PWM_INTENSET_COMPAREMATCH1_Set (0x1UL)     /*!< Enable                                                               */
  #define PWM_INTENSET_COMPAREMATCH1_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define PWM_INTENSET_COMPAREMATCH1_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* COMPAREMATCH2 @Bit 17 : Write '1' to enable interrupt for event COMPAREMATCH[2] */
  #define PWM_INTENSET_COMPAREMATCH2_Pos (17UL)      /*!< Position of COMPAREMATCH2 field.                                     */
  #define PWM_INTENSET_COMPAREMATCH2_Msk (0x1UL << PWM_INTENSET_COMPAREMATCH2_Pos) /*!< Bit mask of COMPAREMATCH2 field.       */
  #define PWM_INTENSET_COMPAREMATCH2_Min (0x0UL)     /*!< Min enumerator value of COMPAREMATCH2 field.                         */
  #define PWM_INTENSET_COMPAREMATCH2_Max (0x1UL)     /*!< Max enumerator value of COMPAREMATCH2 field.                         */
  #define PWM_INTENSET_COMPAREMATCH2_Set (0x1UL)     /*!< Enable                                                               */
  #define PWM_INTENSET_COMPAREMATCH2_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define PWM_INTENSET_COMPAREMATCH2_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* COMPAREMATCH3 @Bit 18 : Write '1' to enable interrupt for event COMPAREMATCH[3] */
  #define PWM_INTENSET_COMPAREMATCH3_Pos (18UL)      /*!< Position of COMPAREMATCH3 field.                                     */
  #define PWM_INTENSET_COMPAREMATCH3_Msk (0x1UL << PWM_INTENSET_COMPAREMATCH3_Pos) /*!< Bit mask of COMPAREMATCH3 field.       */
  #define PWM_INTENSET_COMPAREMATCH3_Min (0x0UL)     /*!< Min enumerator value of COMPAREMATCH3 field.                         */
  #define PWM_INTENSET_COMPAREMATCH3_Max (0x1UL)     /*!< Max enumerator value of COMPAREMATCH3 field.                         */
  #define PWM_INTENSET_COMPAREMATCH3_Set (0x1UL)     /*!< Enable                                                               */
  #define PWM_INTENSET_COMPAREMATCH3_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define PWM_INTENSET_COMPAREMATCH3_Enabled (0x1UL) /*!< Read: Enabled                                                        */


/* PWM_INTENCLR: Disable interrupt */
  #define PWM_INTENCLR_ResetValue (0x00000000UL)     /*!< Reset value of INTENCLR register.                                    */

/* STOPPED @Bit 1 : Write '1' to disable interrupt for event STOPPED */
  #define PWM_INTENCLR_STOPPED_Pos (1UL)             /*!< Position of STOPPED field.                                           */
  #define PWM_INTENCLR_STOPPED_Msk (0x1UL << PWM_INTENCLR_STOPPED_Pos) /*!< Bit mask of STOPPED field.                         */
  #define PWM_INTENCLR_STOPPED_Min (0x0UL)           /*!< Min enumerator value of STOPPED field.                               */
  #define PWM_INTENCLR_STOPPED_Max (0x1UL)           /*!< Max enumerator value of STOPPED field.                               */
  #define PWM_INTENCLR_STOPPED_Clear (0x1UL)         /*!< Disable                                                              */
  #define PWM_INTENCLR_STOPPED_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define PWM_INTENCLR_STOPPED_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* SEQSTARTED0 @Bit 2 : Write '1' to disable interrupt for event SEQSTARTED[0] */
  #define PWM_INTENCLR_SEQSTARTED0_Pos (2UL)         /*!< Position of SEQSTARTED0 field.                                       */
  #define PWM_INTENCLR_SEQSTARTED0_Msk (0x1UL << PWM_INTENCLR_SEQSTARTED0_Pos) /*!< Bit mask of SEQSTARTED0 field.             */
  #define PWM_INTENCLR_SEQSTARTED0_Min (0x0UL)       /*!< Min enumerator value of SEQSTARTED0 field.                           */
  #define PWM_INTENCLR_SEQSTARTED0_Max (0x1UL)       /*!< Max enumerator value of SEQSTARTED0 field.                           */
  #define PWM_INTENCLR_SEQSTARTED0_Clear (0x1UL)     /*!< Disable                                                              */
  #define PWM_INTENCLR_SEQSTARTED0_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define PWM_INTENCLR_SEQSTARTED0_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* SEQSTARTED1 @Bit 3 : Write '1' to disable interrupt for event SEQSTARTED[1] */
  #define PWM_INTENCLR_SEQSTARTED1_Pos (3UL)         /*!< Position of SEQSTARTED1 field.                                       */
  #define PWM_INTENCLR_SEQSTARTED1_Msk (0x1UL << PWM_INTENCLR_SEQSTARTED1_Pos) /*!< Bit mask of SEQSTARTED1 field.             */
  #define PWM_INTENCLR_SEQSTARTED1_Min (0x0UL)       /*!< Min enumerator value of SEQSTARTED1 field.                           */
  #define PWM_INTENCLR_SEQSTARTED1_Max (0x1UL)       /*!< Max enumerator value of SEQSTARTED1 field.                           */
  #define PWM_INTENCLR_SEQSTARTED1_Clear (0x1UL)     /*!< Disable                                                              */
  #define PWM_INTENCLR_SEQSTARTED1_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define PWM_INTENCLR_SEQSTARTED1_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* SEQEND0 @Bit 4 : Write '1' to disable interrupt for event SEQEND[0] */
  #define PWM_INTENCLR_SEQEND0_Pos (4UL)             /*!< Position of SEQEND0 field.                                           */
  #define PWM_INTENCLR_SEQEND0_Msk (0x1UL << PWM_INTENCLR_SEQEND0_Pos) /*!< Bit mask of SEQEND0 field.                         */
  #define PWM_INTENCLR_SEQEND0_Min (0x0UL)           /*!< Min enumerator value of SEQEND0 field.                               */
  #define PWM_INTENCLR_SEQEND0_Max (0x1UL)           /*!< Max enumerator value of SEQEND0 field.                               */
  #define PWM_INTENCLR_SEQEND0_Clear (0x1UL)         /*!< Disable                                                              */
  #define PWM_INTENCLR_SEQEND0_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define PWM_INTENCLR_SEQEND0_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* SEQEND1 @Bit 5 : Write '1' to disable interrupt for event SEQEND[1] */
  #define PWM_INTENCLR_SEQEND1_Pos (5UL)             /*!< Position of SEQEND1 field.                                           */
  #define PWM_INTENCLR_SEQEND1_Msk (0x1UL << PWM_INTENCLR_SEQEND1_Pos) /*!< Bit mask of SEQEND1 field.                         */
  #define PWM_INTENCLR_SEQEND1_Min (0x0UL)           /*!< Min enumerator value of SEQEND1 field.                               */
  #define PWM_INTENCLR_SEQEND1_Max (0x1UL)           /*!< Max enumerator value of SEQEND1 field.                               */
  #define PWM_INTENCLR_SEQEND1_Clear (0x1UL)         /*!< Disable                                                              */
  #define PWM_INTENCLR_SEQEND1_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define PWM_INTENCLR_SEQEND1_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* PWMPERIODEND @Bit 6 : Write '1' to disable interrupt for event PWMPERIODEND */
  #define PWM_INTENCLR_PWMPERIODEND_Pos (6UL)        /*!< Position of PWMPERIODEND field.                                      */
  #define PWM_INTENCLR_PWMPERIODEND_Msk (0x1UL << PWM_INTENCLR_PWMPERIODEND_Pos) /*!< Bit mask of PWMPERIODEND field.          */
  #define PWM_INTENCLR_PWMPERIODEND_Min (0x0UL)      /*!< Min enumerator value of PWMPERIODEND field.                          */
  #define PWM_INTENCLR_PWMPERIODEND_Max (0x1UL)      /*!< Max enumerator value of PWMPERIODEND field.                          */
  #define PWM_INTENCLR_PWMPERIODEND_Clear (0x1UL)    /*!< Disable                                                              */
  #define PWM_INTENCLR_PWMPERIODEND_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define PWM_INTENCLR_PWMPERIODEND_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* LOOPSDONE @Bit 7 : Write '1' to disable interrupt for event LOOPSDONE */
  #define PWM_INTENCLR_LOOPSDONE_Pos (7UL)           /*!< Position of LOOPSDONE field.                                         */
  #define PWM_INTENCLR_LOOPSDONE_Msk (0x1UL << PWM_INTENCLR_LOOPSDONE_Pos) /*!< Bit mask of LOOPSDONE field.                   */
  #define PWM_INTENCLR_LOOPSDONE_Min (0x0UL)         /*!< Min enumerator value of LOOPSDONE field.                             */
  #define PWM_INTENCLR_LOOPSDONE_Max (0x1UL)         /*!< Max enumerator value of LOOPSDONE field.                             */
  #define PWM_INTENCLR_LOOPSDONE_Clear (0x1UL)       /*!< Disable                                                              */
  #define PWM_INTENCLR_LOOPSDONE_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define PWM_INTENCLR_LOOPSDONE_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* RAMUNDERFLOW @Bit 8 : Write '1' to disable interrupt for event RAMUNDERFLOW */
  #define PWM_INTENCLR_RAMUNDERFLOW_Pos (8UL)        /*!< Position of RAMUNDERFLOW field.                                      */
  #define PWM_INTENCLR_RAMUNDERFLOW_Msk (0x1UL << PWM_INTENCLR_RAMUNDERFLOW_Pos) /*!< Bit mask of RAMUNDERFLOW field.          */
  #define PWM_INTENCLR_RAMUNDERFLOW_Min (0x0UL)      /*!< Min enumerator value of RAMUNDERFLOW field.                          */
  #define PWM_INTENCLR_RAMUNDERFLOW_Max (0x1UL)      /*!< Max enumerator value of RAMUNDERFLOW field.                          */
  #define PWM_INTENCLR_RAMUNDERFLOW_Clear (0x1UL)    /*!< Disable                                                              */
  #define PWM_INTENCLR_RAMUNDERFLOW_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define PWM_INTENCLR_RAMUNDERFLOW_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* DMASEQ0END @Bit 9 : Write '1' to disable interrupt for event DMASEQ0END */
  #define PWM_INTENCLR_DMASEQ0END_Pos (9UL)          /*!< Position of DMASEQ0END field.                                        */
  #define PWM_INTENCLR_DMASEQ0END_Msk (0x1UL << PWM_INTENCLR_DMASEQ0END_Pos) /*!< Bit mask of DMASEQ0END field.                */
  #define PWM_INTENCLR_DMASEQ0END_Min (0x0UL)        /*!< Min enumerator value of DMASEQ0END field.                            */
  #define PWM_INTENCLR_DMASEQ0END_Max (0x1UL)        /*!< Max enumerator value of DMASEQ0END field.                            */
  #define PWM_INTENCLR_DMASEQ0END_Clear (0x1UL)      /*!< Disable                                                              */
  #define PWM_INTENCLR_DMASEQ0END_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define PWM_INTENCLR_DMASEQ0END_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* DMASEQ0READY @Bit 10 : Write '1' to disable interrupt for event DMASEQ0READY */
  #define PWM_INTENCLR_DMASEQ0READY_Pos (10UL)       /*!< Position of DMASEQ0READY field.                                      */
  #define PWM_INTENCLR_DMASEQ0READY_Msk (0x1UL << PWM_INTENCLR_DMASEQ0READY_Pos) /*!< Bit mask of DMASEQ0READY field.          */
  #define PWM_INTENCLR_DMASEQ0READY_Min (0x0UL)      /*!< Min enumerator value of DMASEQ0READY field.                          */
  #define PWM_INTENCLR_DMASEQ0READY_Max (0x1UL)      /*!< Max enumerator value of DMASEQ0READY field.                          */
  #define PWM_INTENCLR_DMASEQ0READY_Clear (0x1UL)    /*!< Disable                                                              */
  #define PWM_INTENCLR_DMASEQ0READY_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define PWM_INTENCLR_DMASEQ0READY_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* DMASEQ0BUSERROR @Bit 11 : Write '1' to disable interrupt for event DMASEQ0BUSERROR */
  #define PWM_INTENCLR_DMASEQ0BUSERROR_Pos (11UL)    /*!< Position of DMASEQ0BUSERROR field.                                   */
  #define PWM_INTENCLR_DMASEQ0BUSERROR_Msk (0x1UL << PWM_INTENCLR_DMASEQ0BUSERROR_Pos) /*!< Bit mask of DMASEQ0BUSERROR field. */
  #define PWM_INTENCLR_DMASEQ0BUSERROR_Min (0x0UL)   /*!< Min enumerator value of DMASEQ0BUSERROR field.                       */
  #define PWM_INTENCLR_DMASEQ0BUSERROR_Max (0x1UL)   /*!< Max enumerator value of DMASEQ0BUSERROR field.                       */
  #define PWM_INTENCLR_DMASEQ0BUSERROR_Clear (0x1UL) /*!< Disable                                                              */
  #define PWM_INTENCLR_DMASEQ0BUSERROR_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define PWM_INTENCLR_DMASEQ0BUSERROR_Enabled (0x1UL) /*!< Read: Enabled                                                      */

/* DMASEQ1END @Bit 12 : Write '1' to disable interrupt for event DMASEQ1END */
  #define PWM_INTENCLR_DMASEQ1END_Pos (12UL)         /*!< Position of DMASEQ1END field.                                        */
  #define PWM_INTENCLR_DMASEQ1END_Msk (0x1UL << PWM_INTENCLR_DMASEQ1END_Pos) /*!< Bit mask of DMASEQ1END field.                */
  #define PWM_INTENCLR_DMASEQ1END_Min (0x0UL)        /*!< Min enumerator value of DMASEQ1END field.                            */
  #define PWM_INTENCLR_DMASEQ1END_Max (0x1UL)        /*!< Max enumerator value of DMASEQ1END field.                            */
  #define PWM_INTENCLR_DMASEQ1END_Clear (0x1UL)      /*!< Disable                                                              */
  #define PWM_INTENCLR_DMASEQ1END_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define PWM_INTENCLR_DMASEQ1END_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* DMASEQ1READY @Bit 13 : Write '1' to disable interrupt for event DMASEQ1READY */
  #define PWM_INTENCLR_DMASEQ1READY_Pos (13UL)       /*!< Position of DMASEQ1READY field.                                      */
  #define PWM_INTENCLR_DMASEQ1READY_Msk (0x1UL << PWM_INTENCLR_DMASEQ1READY_Pos) /*!< Bit mask of DMASEQ1READY field.          */
  #define PWM_INTENCLR_DMASEQ1READY_Min (0x0UL)      /*!< Min enumerator value of DMASEQ1READY field.                          */
  #define PWM_INTENCLR_DMASEQ1READY_Max (0x1UL)      /*!< Max enumerator value of DMASEQ1READY field.                          */
  #define PWM_INTENCLR_DMASEQ1READY_Clear (0x1UL)    /*!< Disable                                                              */
  #define PWM_INTENCLR_DMASEQ1READY_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define PWM_INTENCLR_DMASEQ1READY_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

