nrfconnect/sdk-hal_nordic/nrfx/bsp/stable/mdk/nrf54lm20a_enga_types.h
/* ACCDBL @Bits 0..3 : Register accumulating the number of detected double or illegal transitions. ( SAMPLE = 2 ). */
  #define QDEC_ACCDBL_ACCDBL_Pos (0UL)               /*!< Position of ACCDBL field.                                            */
  #define QDEC_ACCDBL_ACCDBL_Msk (0xFUL << QDEC_ACCDBL_ACCDBL_Pos) /*!< Bit mask of ACCDBL field.                              */
  #define QDEC_ACCDBL_ACCDBL_Min (0x0UL)             /*!< Min value of ACCDBL field.                                           */
  #define QDEC_ACCDBL_ACCDBL_Max (0xFUL)             /*!< Max size of ACCDBL field.                                            */


/* QDEC_ACCDBLREAD: Snapshot of the ACCDBL, updated by the READCLRACC or RDCLRDBL task */
  #define QDEC_ACCDBLREAD_ResetValue (0x00000000UL)  /*!< Reset value of ACCDBLREAD register.                                  */

/* ACCDBLREAD @Bits 0..3 : Snapshot of the ACCDBL register. This field is updated when the READCLRACC or RDCLRDBL task is
                           triggered. */

  #define QDEC_ACCDBLREAD_ACCDBLREAD_Pos (0UL)       /*!< Position of ACCDBLREAD field.                                        */
  #define QDEC_ACCDBLREAD_ACCDBLREAD_Msk (0xFUL << QDEC_ACCDBLREAD_ACCDBLREAD_Pos) /*!< Bit mask of ACCDBLREAD field.          */
  #define QDEC_ACCDBLREAD_ACCDBLREAD_Min (0x0UL)     /*!< Min value of ACCDBLREAD field.                                       */
  #define QDEC_ACCDBLREAD_ACCDBLREAD_Max (0xFUL)     /*!< Max size of ACCDBLREAD field.                                        */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           RADIO                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct RADIO_AUXDATA =================================================== */
/**
  * @brief AUXDATA [RADIO_AUXDATA] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CNF[2];                            /*!< (@ 0x00000000) AUXDATA configuration                                 */
} NRF_RADIO_AUXDATA_Type;                            /*!< Size = 8 (0x008)                                                     */

/* RADIO_AUXDATA_CNF: AUXDATA configuration */
  #define RADIO_AUXDATA_CNF_MaxCount (2UL)           /*!< Max size of CNF[2] array.                                            */
  #define RADIO_AUXDATA_CNF_MaxIndex (1UL)           /*!< Max index of CNF[2] array.                                           */
  #define RADIO_AUXDATA_CNF_MinIndex (0UL)           /*!< Min index of CNF[2] array.                                           */
  #define RADIO_AUXDATA_CNF_ResetValue (0x00000000UL) /*!< Reset value of CNF[2] register.                                     */

/* ACQMODE @Bits 0..4 : Acquisition mode (data from RADIO written to memory) */
  #define RADIO_AUXDATA_CNF_ACQMODE_Pos (0UL)        /*!< Position of ACQMODE field.                                           */
  #define RADIO_AUXDATA_CNF_ACQMODE_Msk (0x1FUL << RADIO_AUXDATA_CNF_ACQMODE_Pos) /*!< Bit mask of ACQMODE field.              */
  #define RADIO_AUXDATA_CNF_ACQMODE_Min (0x07UL)     /*!< Min enumerator value of ACQMODE field.                               */
  #define RADIO_AUXDATA_CNF_ACQMODE_Max (0x07UL)     /*!< Max enumerator value of ACQMODE field.                               */
  #define RADIO_AUXDATA_CNF_ACQMODE_Rtt (0x07UL)     /*!< Baseband Channel Sounding RTT Data                                   */

/* DIR @Bit 31 : Data acquisition or injection */
  #define RADIO_AUXDATA_CNF_DIR_Pos (31UL)           /*!< Position of DIR field.                                               */
  #define RADIO_AUXDATA_CNF_DIR_Msk (0x1UL << RADIO_AUXDATA_CNF_DIR_Pos) /*!< Bit mask of DIR field.                           */
  #define RADIO_AUXDATA_CNF_DIR_Min (0x0UL)          /*!< Min enumerator value of DIR field.                                   */
  #define RADIO_AUXDATA_CNF_DIR_Max (0x1UL)          /*!< Max enumerator value of DIR field.                                   */
  #define RADIO_AUXDATA_CNF_DIR_Acq (0x0UL)          /*!< Peripheral to memory                                                 */
  #define RADIO_AUXDATA_CNF_DIR_Inj (0x1UL)          /*!< Memory to peripheral                                                 */



/* ================================================= Struct RADIO_AUXDATADMA ================================================= */
/**
  * @brief AUXDATADMA [RADIO_AUXDATADMA] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ENABLE;                            /*!< (@ 0x00000000) Enable or disable data acquisition                    */
  __IOM uint32_t  PTR;                               /*!< (@ 0x00000004) DMA pointer                                           */
  __IOM uint32_t  MAXCNT;                            /*!< (@ 0x00000008) Maximum number of 32-bit words to transfer            */
  __IM  uint32_t  AMOUNT;                            /*!< (@ 0x0000000C) Number of 32-bit words transferred in the last
                                                                         transaction*/
} NRF_RADIO_AUXDATADMA_Type;                         /*!< Size = 16 (0x010)                                                    */
  #define RADIO_AUXDATADMA_MaxCount (2UL)            /*!< Size of AUXDATADMA[2] array.                                         */
  #define RADIO_AUXDATADMA_MaxIndex (1UL)            /*!< Max index of AUXDATADMA[2] array.                                    */
  #define RADIO_AUXDATADMA_MinIndex (0UL)            /*!< Min index of AUXDATADMA[2] array.                                    */

