nrfconnect/sdk-hal_nordic/nrfx/bsp/stable/mdk/nrf54lm20a_enga_types.h
/* RADIO_DFECTRL1: Various configuration for Direction finding */
  #define RADIO_DFECTRL1_ResetValue (0x00023282UL)   /*!< Reset value of DFECTRL1 register.                                    */

/* NUMBEROF8US @Bits 0..5 : Length of the AoA/AoD procedure in number of 8 us units */
  #define RADIO_DFECTRL1_NUMBEROF8US_Pos (0UL)       /*!< Position of NUMBEROF8US field.                                       */
  #define RADIO_DFECTRL1_NUMBEROF8US_Msk (0x3FUL << RADIO_DFECTRL1_NUMBEROF8US_Pos) /*!< Bit mask of NUMBEROF8US field.        */

/* DFEINEXTENSION @Bit 7 : Add CTE extension and do antenna switching/sampling in this extension */
  #define RADIO_DFECTRL1_DFEINEXTENSION_Pos (7UL)    /*!< Position of DFEINEXTENSION field.                                    */
  #define RADIO_DFECTRL1_DFEINEXTENSION_Msk (0x1UL << RADIO_DFECTRL1_DFEINEXTENSION_Pos) /*!< Bit mask of DFEINEXTENSION field.*/
  #define RADIO_DFECTRL1_DFEINEXTENSION_Min (0x0UL)  /*!< Min enumerator value of DFEINEXTENSION field.                        */
  #define RADIO_DFECTRL1_DFEINEXTENSION_Max (0x1UL)  /*!< Max enumerator value of DFEINEXTENSION field.                        */
  #define RADIO_DFECTRL1_DFEINEXTENSION_CRC (0x1UL)  /*!< AoA/AoD procedure triggered at end of CRC                            */
  #define RADIO_DFECTRL1_DFEINEXTENSION_Payload (0x0UL) /*!< Antenna switching/sampling is done in the packet payload          */

/* TSWITCHSPACING @Bits 8..10 : Interval between every time the antenna is changed in the SWITCHING state */
  #define RADIO_DFECTRL1_TSWITCHSPACING_Pos (8UL)    /*!< Position of TSWITCHSPACING field.                                    */
  #define RADIO_DFECTRL1_TSWITCHSPACING_Msk (0x7UL << RADIO_DFECTRL1_TSWITCHSPACING_Pos) /*!< Bit mask of TSWITCHSPACING field.*/
  #define RADIO_DFECTRL1_TSWITCHSPACING_Min (0x1UL)  /*!< Min enumerator value of TSWITCHSPACING field.                        */
  #define RADIO_DFECTRL1_TSWITCHSPACING_Max (0x3UL)  /*!< Max enumerator value of TSWITCHSPACING field.                        */
  #define RADIO_DFECTRL1_TSWITCHSPACING_4us (0x1UL)  /*!< 4us                                                                  */
  #define RADIO_DFECTRL1_TSWITCHSPACING_2us (0x2UL)  /*!< 2us                                                                  */
  #define RADIO_DFECTRL1_TSWITCHSPACING_1us (0x3UL)  /*!< 1us                                                                  */

/* TSAMPLESPACINGREF @Bits 12..14 : Interval between samples in the REFERENCE period */
  #define RADIO_DFECTRL1_TSAMPLESPACINGREF_Pos (12UL) /*!< Position of TSAMPLESPACINGREF field.                                */
  #define RADIO_DFECTRL1_TSAMPLESPACINGREF_Msk (0x7UL << RADIO_DFECTRL1_TSAMPLESPACINGREF_Pos) /*!< Bit mask of
                                                                            TSAMPLESPACINGREF field.*/
  #define RADIO_DFECTRL1_TSAMPLESPACINGREF_Min (0x1UL) /*!< Min enumerator value of TSAMPLESPACINGREF field.                   */
  #define RADIO_DFECTRL1_TSAMPLESPACINGREF_Max (0x6UL) /*!< Max enumerator value of TSAMPLESPACINGREF field.                   */
  #define RADIO_DFECTRL1_TSAMPLESPACINGREF_4us (0x1UL) /*!< 4us                                                                */
  #define RADIO_DFECTRL1_TSAMPLESPACINGREF_2us (0x2UL) /*!< 2us                                                                */
  #define RADIO_DFECTRL1_TSAMPLESPACINGREF_1us (0x3UL) /*!< 1us                                                                */
  #define RADIO_DFECTRL1_TSAMPLESPACINGREF_500ns (0x4UL) /*!< 0.5us                                                            */
  #define RADIO_DFECTRL1_TSAMPLESPACINGREF_250ns (0x5UL) /*!< 0.25us                                                           */
  #define RADIO_DFECTRL1_TSAMPLESPACINGREF_125ns (0x6UL) /*!< 0.125us                                                          */

/* SAMPLETYPE @Bit 15 : Whether to sample I/Q or magnitude/phase */
  #define RADIO_DFECTRL1_SAMPLETYPE_Pos (15UL)       /*!< Position of SAMPLETYPE field.                                        */
  #define RADIO_DFECTRL1_SAMPLETYPE_Msk (0x1UL << RADIO_DFECTRL1_SAMPLETYPE_Pos) /*!< Bit mask of SAMPLETYPE field.            */
  #define RADIO_DFECTRL1_SAMPLETYPE_Min (0x0UL)      /*!< Min enumerator value of SAMPLETYPE field.                            */
  #define RADIO_DFECTRL1_SAMPLETYPE_Max (0x1UL)      /*!< Max enumerator value of SAMPLETYPE field.                            */
  #define RADIO_DFECTRL1_SAMPLETYPE_IQ (0x0UL)       /*!< Complex samples in I and Q                                           */
  #define RADIO_DFECTRL1_SAMPLETYPE_MagPhase (0x1UL) /*!< Complex samples as magnitude and phase                               */

/* TSAMPLESPACING @Bits 16..18 : Interval between samples in the SWITCHING period when CTEINLINECTRLEN is 0 */
  #define RADIO_DFECTRL1_TSAMPLESPACING_Pos (16UL)   /*!< Position of TSAMPLESPACING field.                                    */
  #define RADIO_DFECTRL1_TSAMPLESPACING_Msk (0x7UL << RADIO_DFECTRL1_TSAMPLESPACING_Pos) /*!< Bit mask of TSAMPLESPACING field.*/
  #define RADIO_DFECTRL1_TSAMPLESPACING_Min (0x1UL)  /*!< Min enumerator value of TSAMPLESPACING field.                        */
  #define RADIO_DFECTRL1_TSAMPLESPACING_Max (0x6UL)  /*!< Max enumerator value of TSAMPLESPACING field.                        */
  #define RADIO_DFECTRL1_TSAMPLESPACING_4us (0x1UL)  /*!< 4us                                                                  */
  #define RADIO_DFECTRL1_TSAMPLESPACING_2us (0x2UL)  /*!< 2us                                                                  */
  #define RADIO_DFECTRL1_TSAMPLESPACING_1us (0x3UL)  /*!< 1us                                                                  */
  #define RADIO_DFECTRL1_TSAMPLESPACING_500ns (0x4UL) /*!< 0.5us                                                               */
  #define RADIO_DFECTRL1_TSAMPLESPACING_250ns (0x5UL) /*!< 0.25us                                                              */
  #define RADIO_DFECTRL1_TSAMPLESPACING_125ns (0x6UL) /*!< 0.125us                                                             */

/* REPEATPATTERN @Bits 20..23 : Repeat every antenna pattern N times. */
  #define RADIO_DFECTRL1_REPEATPATTERN_Pos (20UL)    /*!< Position of REPEATPATTERN field.                                     */
  #define RADIO_DFECTRL1_REPEATPATTERN_Msk (0xFUL << RADIO_DFECTRL1_REPEATPATTERN_Pos) /*!< Bit mask of REPEATPATTERN field.   */
  #define RADIO_DFECTRL1_REPEATPATTERN_Min (0x0UL)   /*!< Min enumerator value of REPEATPATTERN field.                         */
  #define RADIO_DFECTRL1_REPEATPATTERN_Max (0x0UL)   /*!< Max enumerator value of REPEATPATTERN field.                         */
  #define RADIO_DFECTRL1_REPEATPATTERN_NoRepeat (0x0UL) /*!< Do not repeat (1 time in total)                                   */

/* AGCBACKOFFGAIN @Bits 24..27 : Gain will be lowered by the specified number of gain steps at the start of CTE */
  #define RADIO_DFECTRL1_AGCBACKOFFGAIN_Pos (24UL)   /*!< Position of AGCBACKOFFGAIN field.                                    */
  #define RADIO_DFECTRL1_AGCBACKOFFGAIN_Msk (0xFUL << RADIO_DFECTRL1_AGCBACKOFFGAIN_Pos) /*!< Bit mask of AGCBACKOFFGAIN field.*/


/* RADIO_DFECTRL2: Start offset for Direction finding */
  #define RADIO_DFECTRL2_ResetValue (0x00000000UL)   /*!< Reset value of DFECTRL2 register.                                    */

/* TSWITCHOFFSET @Bits 0..12 : Signed value offset after the end of the CRC before starting switching in number of 16M cycles */
  #define RADIO_DFECTRL2_TSWITCHOFFSET_Pos (0UL)     /*!< Position of TSWITCHOFFSET field.                                     */
  #define RADIO_DFECTRL2_TSWITCHOFFSET_Msk (0x1FFFUL << RADIO_DFECTRL2_TSWITCHOFFSET_Pos) /*!< Bit mask of TSWITCHOFFSET field.*/

