nrfconnect/sdk-hal_nordic/nrfx/bsp/stable/mdk/nrf54lm20a_enga_types.h
/* END @Bit 2 : Write '1' to disable interrupt for event END */
  #define SPIM_INTENCLR_END_Pos (2UL)                /*!< Position of END field.                                               */
  #define SPIM_INTENCLR_END_Msk (0x1UL << SPIM_INTENCLR_END_Pos) /*!< Bit mask of END field.                                   */
  #define SPIM_INTENCLR_END_Min (0x0UL)              /*!< Min enumerator value of END field.                                   */
  #define SPIM_INTENCLR_END_Max (0x1UL)              /*!< Max enumerator value of END field.                                   */
  #define SPIM_INTENCLR_END_Clear (0x1UL)            /*!< Disable                                                              */
  #define SPIM_INTENCLR_END_Disabled (0x0UL)         /*!< Read: Disabled                                                       */
  #define SPIM_INTENCLR_END_Enabled (0x1UL)          /*!< Read: Enabled                                                        */

/* DMARXEND @Bit 19 : Write '1' to disable interrupt for event DMARXEND */
  #define SPIM_INTENCLR_DMARXEND_Pos (19UL)          /*!< Position of DMARXEND field.                                          */
  #define SPIM_INTENCLR_DMARXEND_Msk (0x1UL << SPIM_INTENCLR_DMARXEND_Pos) /*!< Bit mask of DMARXEND field.                    */
  #define SPIM_INTENCLR_DMARXEND_Min (0x0UL)         /*!< Min enumerator value of DMARXEND field.                              */
  #define SPIM_INTENCLR_DMARXEND_Max (0x1UL)         /*!< Max enumerator value of DMARXEND field.                              */
  #define SPIM_INTENCLR_DMARXEND_Clear (0x1UL)       /*!< Disable                                                              */
  #define SPIM_INTENCLR_DMARXEND_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define SPIM_INTENCLR_DMARXEND_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* DMARXREADY @Bit 20 : Write '1' to disable interrupt for event DMARXREADY */
  #define SPIM_INTENCLR_DMARXREADY_Pos (20UL)        /*!< Position of DMARXREADY field.                                        */
  #define SPIM_INTENCLR_DMARXREADY_Msk (0x1UL << SPIM_INTENCLR_DMARXREADY_Pos) /*!< Bit mask of DMARXREADY field.              */
  #define SPIM_INTENCLR_DMARXREADY_Min (0x0UL)       /*!< Min enumerator value of DMARXREADY field.                            */
  #define SPIM_INTENCLR_DMARXREADY_Max (0x1UL)       /*!< Max enumerator value of DMARXREADY field.                            */
  #define SPIM_INTENCLR_DMARXREADY_Clear (0x1UL)     /*!< Disable                                                              */
  #define SPIM_INTENCLR_DMARXREADY_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define SPIM_INTENCLR_DMARXREADY_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* DMARXBUSERROR @Bit 21 : Write '1' to disable interrupt for event DMARXBUSERROR */
  #define SPIM_INTENCLR_DMARXBUSERROR_Pos (21UL)     /*!< Position of DMARXBUSERROR field.                                     */
  #define SPIM_INTENCLR_DMARXBUSERROR_Msk (0x1UL << SPIM_INTENCLR_DMARXBUSERROR_Pos) /*!< Bit mask of DMARXBUSERROR field.     */
  #define SPIM_INTENCLR_DMARXBUSERROR_Min (0x0UL)    /*!< Min enumerator value of DMARXBUSERROR field.                         */
  #define SPIM_INTENCLR_DMARXBUSERROR_Max (0x1UL)    /*!< Max enumerator value of DMARXBUSERROR field.                         */
  #define SPIM_INTENCLR_DMARXBUSERROR_Clear (0x1UL)  /*!< Disable                                                              */
  #define SPIM_INTENCLR_DMARXBUSERROR_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define SPIM_INTENCLR_DMARXBUSERROR_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* DMARXMATCH0 @Bit 22 : Write '1' to disable interrupt for event DMARXMATCH[0] */
  #define SPIM_INTENCLR_DMARXMATCH0_Pos (22UL)       /*!< Position of DMARXMATCH0 field.                                       */
  #define SPIM_INTENCLR_DMARXMATCH0_Msk (0x1UL << SPIM_INTENCLR_DMARXMATCH0_Pos) /*!< Bit mask of DMARXMATCH0 field.           */
  #define SPIM_INTENCLR_DMARXMATCH0_Min (0x0UL)      /*!< Min enumerator value of DMARXMATCH0 field.                           */
  #define SPIM_INTENCLR_DMARXMATCH0_Max (0x1UL)      /*!< Max enumerator value of DMARXMATCH0 field.                           */
  #define SPIM_INTENCLR_DMARXMATCH0_Clear (0x1UL)    /*!< Disable                                                              */
  #define SPIM_INTENCLR_DMARXMATCH0_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define SPIM_INTENCLR_DMARXMATCH0_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* DMARXMATCH1 @Bit 23 : Write '1' to disable interrupt for event DMARXMATCH[1] */
  #define SPIM_INTENCLR_DMARXMATCH1_Pos (23UL)       /*!< Position of DMARXMATCH1 field.                                       */
  #define SPIM_INTENCLR_DMARXMATCH1_Msk (0x1UL << SPIM_INTENCLR_DMARXMATCH1_Pos) /*!< Bit mask of DMARXMATCH1 field.           */
  #define SPIM_INTENCLR_DMARXMATCH1_Min (0x0UL)      /*!< Min enumerator value of DMARXMATCH1 field.                           */
  #define SPIM_INTENCLR_DMARXMATCH1_Max (0x1UL)      /*!< Max enumerator value of DMARXMATCH1 field.                           */
  #define SPIM_INTENCLR_DMARXMATCH1_Clear (0x1UL)    /*!< Disable                                                              */
  #define SPIM_INTENCLR_DMARXMATCH1_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define SPIM_INTENCLR_DMARXMATCH1_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* DMARXMATCH2 @Bit 24 : Write '1' to disable interrupt for event DMARXMATCH[2] */
  #define SPIM_INTENCLR_DMARXMATCH2_Pos (24UL)       /*!< Position of DMARXMATCH2 field.                                       */
  #define SPIM_INTENCLR_DMARXMATCH2_Msk (0x1UL << SPIM_INTENCLR_DMARXMATCH2_Pos) /*!< Bit mask of DMARXMATCH2 field.           */
  #define SPIM_INTENCLR_DMARXMATCH2_Min (0x0UL)      /*!< Min enumerator value of DMARXMATCH2 field.                           */
  #define SPIM_INTENCLR_DMARXMATCH2_Max (0x1UL)      /*!< Max enumerator value of DMARXMATCH2 field.                           */
  #define SPIM_INTENCLR_DMARXMATCH2_Clear (0x1UL)    /*!< Disable                                                              */
  #define SPIM_INTENCLR_DMARXMATCH2_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define SPIM_INTENCLR_DMARXMATCH2_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* DMARXMATCH3 @Bit 25 : Write '1' to disable interrupt for event DMARXMATCH[3] */
  #define SPIM_INTENCLR_DMARXMATCH3_Pos (25UL)       /*!< Position of DMARXMATCH3 field.                                       */
  #define SPIM_INTENCLR_DMARXMATCH3_Msk (0x1UL << SPIM_INTENCLR_DMARXMATCH3_Pos) /*!< Bit mask of DMARXMATCH3 field.           */
  #define SPIM_INTENCLR_DMARXMATCH3_Min (0x0UL)      /*!< Min enumerator value of DMARXMATCH3 field.                           */
  #define SPIM_INTENCLR_DMARXMATCH3_Max (0x1UL)      /*!< Max enumerator value of DMARXMATCH3 field.                           */
  #define SPIM_INTENCLR_DMARXMATCH3_Clear (0x1UL)    /*!< Disable                                                              */
  #define SPIM_INTENCLR_DMARXMATCH3_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define SPIM_INTENCLR_DMARXMATCH3_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* DMATXEND @Bit 26 : Write '1' to disable interrupt for event DMATXEND */
  #define SPIM_INTENCLR_DMATXEND_Pos (26UL)          /*!< Position of DMATXEND field.                                          */
  #define SPIM_INTENCLR_DMATXEND_Msk (0x1UL << SPIM_INTENCLR_DMATXEND_Pos) /*!< Bit mask of DMATXEND field.                    */
  #define SPIM_INTENCLR_DMATXEND_Min (0x0UL)         /*!< Min enumerator value of DMATXEND field.                              */
  #define SPIM_INTENCLR_DMATXEND_Max (0x1UL)         /*!< Max enumerator value of DMATXEND field.                              */
  #define SPIM_INTENCLR_DMATXEND_Clear (0x1UL)       /*!< Disable                                                              */
  #define SPIM_INTENCLR_DMATXEND_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define SPIM_INTENCLR_DMATXEND_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* DMATXREADY @Bit 27 : Write '1' to disable interrupt for event DMATXREADY */
  #define SPIM_INTENCLR_DMATXREADY_Pos (27UL)        /*!< Position of DMATXREADY field.                                        */
  #define SPIM_INTENCLR_DMATXREADY_Msk (0x1UL << SPIM_INTENCLR_DMATXREADY_Pos) /*!< Bit mask of DMATXREADY field.              */
  #define SPIM_INTENCLR_DMATXREADY_Min (0x0UL)       /*!< Min enumerator value of DMATXREADY field.                            */
  #define SPIM_INTENCLR_DMATXREADY_Max (0x1UL)       /*!< Max enumerator value of DMATXREADY field.                            */
  #define SPIM_INTENCLR_DMATXREADY_Clear (0x1UL)     /*!< Disable                                                              */
  #define SPIM_INTENCLR_DMATXREADY_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define SPIM_INTENCLR_DMATXREADY_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* DMATXBUSERROR @Bit 28 : Write '1' to disable interrupt for event DMATXBUSERROR */
  #define SPIM_INTENCLR_DMATXBUSERROR_Pos (28UL)     /*!< Position of DMATXBUSERROR field.                                     */
  #define SPIM_INTENCLR_DMATXBUSERROR_Msk (0x1UL << SPIM_INTENCLR_DMATXBUSERROR_Pos) /*!< Bit mask of DMATXBUSERROR field.     */
  #define SPIM_INTENCLR_DMATXBUSERROR_Min (0x0UL)    /*!< Min enumerator value of DMATXBUSERROR field.                         */
  #define SPIM_INTENCLR_DMATXBUSERROR_Max (0x1UL)    /*!< Max enumerator value of DMATXBUSERROR field.                         */
  #define SPIM_INTENCLR_DMATXBUSERROR_Clear (0x1UL)  /*!< Disable                                                              */
  #define SPIM_INTENCLR_DMATXBUSERROR_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define SPIM_INTENCLR_DMATXBUSERROR_Enabled (0x1UL) /*!< Read: Enabled                                                       */


/* SPIM_ENABLE: Enable SPIM */
  #define SPIM_ENABLE_ResetValue (0x00000000UL)      /*!< Reset value of ENABLE register.                                      */

/* ENABLE @Bits 0..3 : Enable or disable SPIM */
  #define SPIM_ENABLE_ENABLE_Pos (0UL)               /*!< Position of ENABLE field.                                            */
  #define SPIM_ENABLE_ENABLE_Msk (0xFUL << SPIM_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                              */
  #define SPIM_ENABLE_ENABLE_Min (0x0UL)             /*!< Min enumerator value of ENABLE field.                                */
  #define SPIM_ENABLE_ENABLE_Max (0x7UL)             /*!< Max enumerator value of ENABLE field.                                */
  #define SPIM_ENABLE_ENABLE_Disabled (0x0UL)        /*!< Disable SPIM                                                         */
  #define SPIM_ENABLE_ENABLE_Enabled (0x7UL)         /*!< Enable SPIM                                                          */


/* SPIM_PRESCALER: The prescaler is used to set the SPI frequency. */
  #define SPIM_PRESCALER_ResetValue (0x00000040UL)   /*!< Reset value of PRESCALER register.                                   */

/* DIVISOR @Bits 0..6 : Core clock to SCK divisor */
  #define SPIM_PRESCALER_DIVISOR_Pos (0UL)           /*!< Position of DIVISOR field.                                           */
  #define SPIM_PRESCALER_DIVISOR_Msk (0x7FUL << SPIM_PRESCALER_DIVISOR_Pos) /*!< Bit mask of DIVISOR field.                    */
  #define SPIM_PRESCALER_DIVISOR_Min (0x02UL)        /*!< Min value of DIVISOR field.                                          */
  #define SPIM_PRESCALER_DIVISOR_Max (0x7EUL)        /*!< Max size of DIVISOR field.                                           */


/* SPIM_CONFIG: Configuration register */
  #define SPIM_CONFIG_ResetValue (0x00000000UL)      /*!< Reset value of CONFIG register.                                      */

/* ORDER @Bit 0 : Bit order */
  #define SPIM_CONFIG_ORDER_Pos (0UL)                /*!< Position of ORDER field.                                             */
  #define SPIM_CONFIG_ORDER_Msk (0x1UL << SPIM_CONFIG_ORDER_Pos) /*!< Bit mask of ORDER field.                                 */
  #define SPIM_CONFIG_ORDER_Min (0x0UL)              /*!< Min enumerator value of ORDER field.                                 */
  #define SPIM_CONFIG_ORDER_Max (0x1UL)              /*!< Max enumerator value of ORDER field.                                 */
  #define SPIM_CONFIG_ORDER_MsbFirst (0x0UL)         /*!< Most significant bit shifted out first                               */
  #define SPIM_CONFIG_ORDER_LsbFirst (0x1UL)         /*!< Least significant bit shifted out first                              */

