nrfconnect/sdk-hal_nordic/nrfx/bsp/stable/mdk/nrf54lm20a_enga_types.h
/* TDM_RXD_CURRENTAMOUNT: Number of bytes transferred in the current transaction */
  #define TDM_RXD_CURRENTAMOUNT_ResetValue (0x00000000UL) /*!< Reset value of CURRENTAMOUNT register.                          */

/* AMOUNT @Bits 0..15 : Number of bytes transferred in the current transaction. Continuously updated. */
  #define TDM_RXD_CURRENTAMOUNT_AMOUNT_Pos (0UL)     /*!< Position of AMOUNT field.                                            */
  #define TDM_RXD_CURRENTAMOUNT_AMOUNT_Msk (0xFFFFUL << TDM_RXD_CURRENTAMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT field.       */
  #define TDM_RXD_CURRENTAMOUNT_AMOUNT_Min (0x0001UL) /*!< Min value of AMOUNT field.                                          */
  #define TDM_RXD_CURRENTAMOUNT_AMOUNT_Max (0x3FFFUL) /*!< Max size of AMOUNT field.                                           */


/* TDM_RXD_MODE: Configure EasyDMA mode */
  #define TDM_RXD_MODE_ResetValue (0x00000001UL)     /*!< Reset value of MODE register.                                        */

/* LPOP @Bits 0..1 : Enable low-power operation, or use low-latency */
  #define TDM_RXD_MODE_LPOP_Pos (0UL)                /*!< Position of LPOP field.                                              */
  #define TDM_RXD_MODE_LPOP_Msk (0x3UL << TDM_RXD_MODE_LPOP_Pos) /*!< Bit mask of LPOP field.                                  */
  #define TDM_RXD_MODE_LPOP_Min (0x0UL)              /*!< Min enumerator value of LPOP field.                                  */
  #define TDM_RXD_MODE_LPOP_Max (0x1UL)              /*!< Max enumerator value of LPOP field.                                  */
  #define TDM_RXD_MODE_LPOP_LowLat (0x0UL)           /*!< Low-latency operation                                                */
  #define TDM_RXD_MODE_LPOP_LowPower (0x1UL)         /*!< Low-power operation                                                  */


/* TDM_RXD_TERMINATEONBUSERROR: Terminate the transaction if a BUSERROR event is detected. */
  #define TDM_RXD_TERMINATEONBUSERROR_ResetValue (0x00000000UL) /*!< Reset value of TERMINATEONBUSERROR register.              */

/* ENABLE @Bit 0 : (unspecified) */
  #define TDM_RXD_TERMINATEONBUSERROR_ENABLE_Pos (0UL) /*!< Position of ENABLE field.                                          */
  #define TDM_RXD_TERMINATEONBUSERROR_ENABLE_Msk (0x1UL << TDM_RXD_TERMINATEONBUSERROR_ENABLE_Pos) /*!< Bit mask of ENABLE
                                                                            field.*/
  #define TDM_RXD_TERMINATEONBUSERROR_ENABLE_Min (0x0UL) /*!< Min enumerator value of ENABLE field.                            */
  #define TDM_RXD_TERMINATEONBUSERROR_ENABLE_Max (0x1UL) /*!< Max enumerator value of ENABLE field.                            */
  #define TDM_RXD_TERMINATEONBUSERROR_ENABLE_Disabled (0x0UL) /*!< Disable                                                     */
  #define TDM_RXD_TERMINATEONBUSERROR_ENABLE_Enabled (0x1UL) /*!< Enable                                                       */


/* TDM_RXD_BUSERRORADDRESS: Address of transaction that generated the last BUSERROR event. */
  #define TDM_RXD_BUSERRORADDRESS_ResetValue (0x00000000UL) /*!< Reset value of BUSERRORADDRESS register.                      */

/* ADDRESS @Bits 0..31 : (unspecified) */
  #define TDM_RXD_BUSERRORADDRESS_ADDRESS_Pos (0UL)  /*!< Position of ADDRESS field.                                           */
  #define TDM_RXD_BUSERRORADDRESS_ADDRESS_Msk (0xFFFFFFFFUL << TDM_RXD_BUSERRORADDRESS_ADDRESS_Pos) /*!< Bit mask of ADDRESS
                                                                            field.*/



/* ===================================================== Struct TDM_TXD ====================================================== */
/**
  * @brief TXD [TDM_TXD] (unspecified)
  */
typedef struct {
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  PTR;                               /*!< (@ 0x00000004) RAM buffer start address                              */
  __IOM uint32_t  MAXCNT;                            /*!< (@ 0x00000008) Maximum number of bytes in channel buffer             */
  __IM  uint32_t  AMOUNT;                            /*!< (@ 0x0000000C) Number of bytes transferred in the last transaction,
                                                                         updated after the END event.*/
  __IM  uint32_t  CURRENTAMOUNT;                     /*!< (@ 0x00000010) Number of bytes transferred in the current transaction*/
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  MODE;                              /*!< (@ 0x00000018) Configure EasyDMA mode                                */
  __IOM uint32_t  TERMINATEONBUSERROR;               /*!< (@ 0x0000001C) Terminate the transaction if a BUSERROR event is
                                                                         detected.*/
  __IM  uint32_t  BUSERRORADDRESS;                   /*!< (@ 0x00000020) Address of transaction that generated the last BUSERROR
                                                                         event.*/
} NRF_TDM_TXD_Type;                                  /*!< Size = 36 (0x024)                                                    */

/* TDM_TXD_PTR: RAM buffer start address */
  #define TDM_TXD_PTR_ResetValue (0x20000000UL)      /*!< Reset value of PTR register.                                         */

/* PTR @Bits 0..31 : RAM buffer start address for this EasyDMA channel. This address is a word aligned Data RAM address. */
  #define TDM_TXD_PTR_PTR_Pos (0UL)                  /*!< Position of PTR field.                                               */
  #define TDM_TXD_PTR_PTR_Msk (0xFFFFFFFFUL << TDM_TXD_PTR_PTR_Pos) /*!< Bit mask of PTR field.                                */


/* TDM_TXD_MAXCNT: Maximum number of bytes in channel buffer */
  #define TDM_TXD_MAXCNT_ResetValue (0x00000000UL)   /*!< Reset value of MAXCNT register.                                      */

/* MAXCNT @Bits 0..15 : Maximum number of bytes in channel buffer */
  #define TDM_TXD_MAXCNT_MAXCNT_Pos (0UL)            /*!< Position of MAXCNT field.                                            */
  #define TDM_TXD_MAXCNT_MAXCNT_Msk (0xFFFFUL << TDM_TXD_MAXCNT_MAXCNT_Pos) /*!< Bit mask of MAXCNT field.                     */
  #define TDM_TXD_MAXCNT_MAXCNT_Min (0x0001UL)       /*!< Min value of MAXCNT field.                                           */
  #define TDM_TXD_MAXCNT_MAXCNT_Max (0x3FFFUL)       /*!< Max size of MAXCNT field.                                            */


/* TDM_TXD_AMOUNT: Number of bytes transferred in the last transaction, updated after the END event. */
  #define TDM_TXD_AMOUNT_ResetValue (0x00000000UL)   /*!< Reset value of AMOUNT register.                                      */

/* AMOUNT @Bits 0..15 : Number of bytes transferred in the last transaction. In case of NACK error, includes the NACK'ed byte. */
  #define TDM_TXD_AMOUNT_AMOUNT_Pos (0UL)            /*!< Position of AMOUNT field.                                            */
  #define TDM_TXD_AMOUNT_AMOUNT_Msk (0xFFFFUL << TDM_TXD_AMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT field.                     */
  #define TDM_TXD_AMOUNT_AMOUNT_Min (0x0001UL)       /*!< Min value of AMOUNT field.                                           */
  #define TDM_TXD_AMOUNT_AMOUNT_Max (0x3FFFUL)       /*!< Max size of AMOUNT field.                                            */


/* TDM_TXD_CURRENTAMOUNT: Number of bytes transferred in the current transaction */
  #define TDM_TXD_CURRENTAMOUNT_ResetValue (0x00000000UL) /*!< Reset value of CURRENTAMOUNT register.                          */

/* AMOUNT @Bits 0..15 : Number of bytes transferred in the current transaction. Continuously updated. */
  #define TDM_TXD_CURRENTAMOUNT_AMOUNT_Pos (0UL)     /*!< Position of AMOUNT field.                                            */
  #define TDM_TXD_CURRENTAMOUNT_AMOUNT_Msk (0xFFFFUL << TDM_TXD_CURRENTAMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT field.       */
  #define TDM_TXD_CURRENTAMOUNT_AMOUNT_Min (0x0001UL) /*!< Min value of AMOUNT field.                                          */
  #define TDM_TXD_CURRENTAMOUNT_AMOUNT_Max (0x3FFFUL) /*!< Max size of AMOUNT field.                                           */


