nrfconnect/sdk-hal_nordic/nrfx/bsp/stable/mdk/nrf54lm20a_enga_types.h
/* TDM_TXD_MODE: Configure EasyDMA mode */
  #define TDM_TXD_MODE_ResetValue (0x00000001UL)     /*!< Reset value of MODE register.                                        */

/* LPOP @Bits 0..1 : Enable low-power operation, or use low-latency */
  #define TDM_TXD_MODE_LPOP_Pos (0UL)                /*!< Position of LPOP field.                                              */
  #define TDM_TXD_MODE_LPOP_Msk (0x3UL << TDM_TXD_MODE_LPOP_Pos) /*!< Bit mask of LPOP field.                                  */
  #define TDM_TXD_MODE_LPOP_Min (0x0UL)              /*!< Min enumerator value of LPOP field.                                  */
  #define TDM_TXD_MODE_LPOP_Max (0x1UL)              /*!< Max enumerator value of LPOP field.                                  */
  #define TDM_TXD_MODE_LPOP_LowLat (0x0UL)           /*!< Low-latency operation                                                */
  #define TDM_TXD_MODE_LPOP_LowPower (0x1UL)         /*!< Low-power operation                                                  */


/* TDM_TXD_TERMINATEONBUSERROR: Terminate the transaction if a BUSERROR event is detected. */
  #define TDM_TXD_TERMINATEONBUSERROR_ResetValue (0x00000000UL) /*!< Reset value of TERMINATEONBUSERROR register.              */

/* ENABLE @Bit 0 : (unspecified) */
  #define TDM_TXD_TERMINATEONBUSERROR_ENABLE_Pos (0UL) /*!< Position of ENABLE field.                                          */
  #define TDM_TXD_TERMINATEONBUSERROR_ENABLE_Msk (0x1UL << TDM_TXD_TERMINATEONBUSERROR_ENABLE_Pos) /*!< Bit mask of ENABLE
                                                                            field.*/
  #define TDM_TXD_TERMINATEONBUSERROR_ENABLE_Min (0x0UL) /*!< Min enumerator value of ENABLE field.                            */
  #define TDM_TXD_TERMINATEONBUSERROR_ENABLE_Max (0x1UL) /*!< Max enumerator value of ENABLE field.                            */
  #define TDM_TXD_TERMINATEONBUSERROR_ENABLE_Disabled (0x0UL) /*!< Disable                                                     */
  #define TDM_TXD_TERMINATEONBUSERROR_ENABLE_Enabled (0x1UL) /*!< Enable                                                       */


/* TDM_TXD_BUSERRORADDRESS: Address of transaction that generated the last BUSERROR event. */
  #define TDM_TXD_BUSERRORADDRESS_ResetValue (0x00000000UL) /*!< Reset value of BUSERRORADDRESS register.                      */

/* ADDRESS @Bits 0..31 : (unspecified) */
  #define TDM_TXD_BUSERRORADDRESS_ADDRESS_Pos (0UL)  /*!< Position of ADDRESS field.                                           */
  #define TDM_TXD_BUSERRORADDRESS_ADDRESS_Msk (0xFFFFFFFFUL << TDM_TXD_BUSERRORADDRESS_ADDRESS_Pos) /*!< Bit mask of ADDRESS
                                                                            field.*/


/* ======================================================= Struct TDM ======================================================== */
/**
  * @brief Time division multiplexed audio interface
  */
  typedef struct {                                   /*!< TDM Structure                                                        */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Starts continuous TDM transfer. Also starts MCK when
                                                                         this is enabled*/
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Stops TDM transfer after the completion of MAXCNT
                                                                         bytes. Triggering this task will cause the STOPPED
                                                                         event to be generated.*/
    __OM uint32_t TASKS_ABORT;                       /*!< (@ 0x00000008) Abort TDM transfer without completing MAXCNT bytes.
                                                                         Triggering this task will cause the ABORTED event to be
                                                                         generated.*/
    __IM uint32_t RESERVED[29];
    __IOM uint32_t SUBSCRIBE_START;                  /*!< (@ 0x00000080) Subscribe configuration for task START                */
    __IOM uint32_t SUBSCRIBE_STOP;                   /*!< (@ 0x00000084) Subscribe configuration for task STOP                 */
    __IOM uint32_t SUBSCRIBE_ABORT;                  /*!< (@ 0x00000088) Subscribe configuration for task ABORT                */
    __IM uint32_t RESERVED1[30];
    __IOM uint32_t EVENTS_RXPTRUPD;                  /*!< (@ 0x00000104) The RXD.PTR register has been copied to internal
                                                                         double-buffers. When TDM is started and RX is enabled,
                                                                         this event will be generated for every RXTXD.MAXCNT
                                                                         bytes received on the SDIN pin.*/
    __IOM uint32_t EVENTS_STOPPED;                   /*!< (@ 0x00000108) Transfer stopped.                                     */
    __IOM uint32_t EVENTS_ABORTED;                   /*!< (@ 0x0000010C) Transfer aborted.                                     */
    __IM uint32_t RESERVED2[2];
    __IOM uint32_t EVENTS_TXPTRUPD;                  /*!< (@ 0x00000118) The TDX.PTR register has been copied to internal
                                                                         double-buffers. When TDM is started and TX is enabled,
                                                                         this event will be generated for every RXTXD.MAXCNT
                                                                         bytes that are sent on the SDOUT pin.*/
    __IM uint32_t RESERVED3;
    __IOM uint32_t EVENTS_MAXCNT;                    /*!< (@ 0x00000120) Generated on the active edge of FSYNC, after both RX
                                                                         and TX DMA transfers have completed. An initial MAXCNT
                                                                         event is also triggered on the first active edge of
                                                                         FSYNC after the START task is issued.*/
    __IM uint32_t RESERVED4[24];
    __IOM uint32_t PUBLISH_RXPTRUPD;                 /*!< (@ 0x00000184) Publish configuration for event RXPTRUPD              */
    __IOM uint32_t PUBLISH_STOPPED;                  /*!< (@ 0x00000188) Publish configuration for event STOPPED               */
    __IOM uint32_t PUBLISH_ABORTED;                  /*!< (@ 0x0000018C) Publish configuration for event ABORTED               */
    __IM uint32_t RESERVED5[2];
    __IOM uint32_t PUBLISH_TXPTRUPD;                 /*!< (@ 0x00000198) Publish configuration for event TXPTRUPD              */
    __IM uint32_t RESERVED6;
    __IOM uint32_t PUBLISH_MAXCNT;                   /*!< (@ 0x000001A0) Publish configuration for event MAXCNT                */
    __IM uint32_t RESERVED7[87];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED8[124];
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000500) Enable TDM                                            */
    __IOM NRF_TDM_CONFIG_Type CONFIG;                /*!< (@ 0x00000504) Configuration registers.                              */
    __IM uint32_t RESERVED9[11];
    __IOM NRF_TDM_PSEL_Type PSEL;                    /*!< (@ 0x00000570) (unspecified)                                         */
    __IM uint32_t RESERVED10[95];
    __IOM NRF_TDM_RXD_Type RXD;                      /*!< (@ 0x00000700) (unspecified)                                         */
    __IM uint32_t RESERVED11[7];
    __IOM NRF_TDM_TXD_Type TXD;                      /*!< (@ 0x00000740) (unspecified)                                         */
  } NRF_TDM_Type;                                    /*!< Size = 1892 (0x764)                                                  */

/* TDM_TASKS_START: Starts continuous TDM transfer. Also starts MCK when this is enabled */
  #define TDM_TASKS_START_ResetValue (0x00000000UL)  /*!< Reset value of TASKS_START register.                                 */

