nrfconnect/sdk-hal_nordic/nrfx/bsp/stable/mdk/nrf54lm20a_enga_types.h
/* TASKS_START @Bit 0 : Starts continuous TDM transfer. Also starts MCK when this is enabled */
  #define TDM_TASKS_START_TASKS_START_Pos (0UL)      /*!< Position of TASKS_START field.                                       */
  #define TDM_TASKS_START_TASKS_START_Msk (0x1UL << TDM_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field.       */
  #define TDM_TASKS_START_TASKS_START_Min (0x1UL)    /*!< Min enumerator value of TASKS_START field.                           */
  #define TDM_TASKS_START_TASKS_START_Max (0x1UL)    /*!< Max enumerator value of TASKS_START field.                           */
  #define TDM_TASKS_START_TASKS_START_Trigger (0x1UL) /*!< Trigger task                                                        */


/* TDM_TASKS_STOP: Stops TDM transfer after the completion of MAXCNT bytes. Triggering this task will cause the STOPPED event to
                    be generated. */

  #define TDM_TASKS_STOP_ResetValue (0x00000000UL)   /*!< Reset value of TASKS_STOP register.                                  */

/* TASKS_STOP @Bit 0 : Stops TDM transfer after the completion of MAXCNT bytes. Triggering this task will cause the STOPPED
                       event to be generated. */

  #define TDM_TASKS_STOP_TASKS_STOP_Pos (0UL)        /*!< Position of TASKS_STOP field.                                        */
  #define TDM_TASKS_STOP_TASKS_STOP_Msk (0x1UL << TDM_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field.            */
  #define TDM_TASKS_STOP_TASKS_STOP_Min (0x1UL)      /*!< Min enumerator value of TASKS_STOP field.                            */
  #define TDM_TASKS_STOP_TASKS_STOP_Max (0x1UL)      /*!< Max enumerator value of TASKS_STOP field.                            */
  #define TDM_TASKS_STOP_TASKS_STOP_Trigger (0x1UL)  /*!< Trigger task                                                         */


/* TDM_TASKS_ABORT: Abort TDM transfer without completing MAXCNT bytes. Triggering this task will cause the ABORTED event to be
                     generated. */

  #define TDM_TASKS_ABORT_ResetValue (0x00000000UL)  /*!< Reset value of TASKS_ABORT register.                                 */

/* TASKS_ABORT @Bit 0 : Abort TDM transfer without completing MAXCNT bytes. Triggering this task will cause the ABORTED event to
                        be generated. */

  #define TDM_TASKS_ABORT_TASKS_ABORT_Pos (0UL)      /*!< Position of TASKS_ABORT field.                                       */
  #define TDM_TASKS_ABORT_TASKS_ABORT_Msk (0x1UL << TDM_TASKS_ABORT_TASKS_ABORT_Pos) /*!< Bit mask of TASKS_ABORT field.       */
  #define TDM_TASKS_ABORT_TASKS_ABORT_Min (0x1UL)    /*!< Min enumerator value of TASKS_ABORT field.                           */
  #define TDM_TASKS_ABORT_TASKS_ABORT_Max (0x1UL)    /*!< Max enumerator value of TASKS_ABORT field.                           */
  #define TDM_TASKS_ABORT_TASKS_ABORT_Trigger (0x1UL) /*!< Trigger task                                                        */


/* TDM_SUBSCRIBE_START: Subscribe configuration for task START */
  #define TDM_SUBSCRIBE_START_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_START register.                          */

/* CHIDX @Bits 0..7 : DPPI channel that task START will subscribe to */
  #define TDM_SUBSCRIBE_START_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define TDM_SUBSCRIBE_START_CHIDX_Msk (0xFFUL << TDM_SUBSCRIBE_START_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define TDM_SUBSCRIBE_START_CHIDX_Min (0x00UL)     /*!< Min value of CHIDX field.                                            */
  #define TDM_SUBSCRIBE_START_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TDM_SUBSCRIBE_START_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define TDM_SUBSCRIBE_START_EN_Msk (0x1UL << TDM_SUBSCRIBE_START_EN_Pos) /*!< Bit mask of EN field.                          */
  #define TDM_SUBSCRIBE_START_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define TDM_SUBSCRIBE_START_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define TDM_SUBSCRIBE_START_EN_Disabled (0x0UL)    /*!< Disable subscription                                                 */
  #define TDM_SUBSCRIBE_START_EN_Enabled (0x1UL)     /*!< Enable subscription                                                  */


/* TDM_SUBSCRIBE_STOP: Subscribe configuration for task STOP */
  #define TDM_SUBSCRIBE_STOP_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_STOP register.                            */

/* CHIDX @Bits 0..7 : DPPI channel that task STOP will subscribe to */
  #define TDM_SUBSCRIBE_STOP_CHIDX_Pos (0UL)         /*!< Position of CHIDX field.                                             */
  #define TDM_SUBSCRIBE_STOP_CHIDX_Msk (0xFFUL << TDM_SUBSCRIBE_STOP_CHIDX_Pos) /*!< Bit mask of CHIDX field.                  */
  #define TDM_SUBSCRIBE_STOP_CHIDX_Min (0x00UL)      /*!< Min value of CHIDX field.                                            */
  #define TDM_SUBSCRIBE_STOP_CHIDX_Max (0xFFUL)      /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TDM_SUBSCRIBE_STOP_EN_Pos (31UL)           /*!< Position of EN field.                                                */
  #define TDM_SUBSCRIBE_STOP_EN_Msk (0x1UL << TDM_SUBSCRIBE_STOP_EN_Pos) /*!< Bit mask of EN field.                            */
  #define TDM_SUBSCRIBE_STOP_EN_Min (0x0UL)          /*!< Min enumerator value of EN field.                                    */
  #define TDM_SUBSCRIBE_STOP_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define TDM_SUBSCRIBE_STOP_EN_Disabled (0x0UL)     /*!< Disable subscription                                                 */
  #define TDM_SUBSCRIBE_STOP_EN_Enabled (0x1UL)      /*!< Enable subscription                                                  */


/* TDM_SUBSCRIBE_ABORT: Subscribe configuration for task ABORT */
  #define TDM_SUBSCRIBE_ABORT_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_ABORT register.                          */

/* CHIDX @Bits 0..7 : DPPI channel that task ABORT will subscribe to */
  #define TDM_SUBSCRIBE_ABORT_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define TDM_SUBSCRIBE_ABORT_CHIDX_Msk (0xFFUL << TDM_SUBSCRIBE_ABORT_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define TDM_SUBSCRIBE_ABORT_CHIDX_Min (0x00UL)     /*!< Min value of CHIDX field.                                            */
  #define TDM_SUBSCRIBE_ABORT_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TDM_SUBSCRIBE_ABORT_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define TDM_SUBSCRIBE_ABORT_EN_Msk (0x1UL << TDM_SUBSCRIBE_ABORT_EN_Pos) /*!< Bit mask of EN field.                          */
  #define TDM_SUBSCRIBE_ABORT_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define TDM_SUBSCRIBE_ABORT_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define TDM_SUBSCRIBE_ABORT_EN_Disabled (0x0UL)    /*!< Disable subscription                                                 */
  #define TDM_SUBSCRIBE_ABORT_EN_Enabled (0x1UL)     /*!< Enable subscription                                                  */


/* TDM_EVENTS_RXPTRUPD: The RXD.PTR register has been copied to internal double-buffers. When TDM is started and RX is enabled,
                         this event will be generated for every RXTXD.MAXCNT bytes received on the SDIN pin. */

  #define TDM_EVENTS_RXPTRUPD_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_RXPTRUPD register.                          */

/* EVENTS_RXPTRUPD @Bit 0 : The RXD.PTR register has been copied to internal double-buffers. When TDM is started and RX is
                            enabled, this event will be generated for every RXTXD.MAXCNT bytes received on the SDIN pin. */

  #define TDM_EVENTS_RXPTRUPD_EVENTS_RXPTRUPD_Pos (0UL) /*!< Position of EVENTS_RXPTRUPD field.                                */
  #define TDM_EVENTS_RXPTRUPD_EVENTS_RXPTRUPD_Msk (0x1UL << TDM_EVENTS_RXPTRUPD_EVENTS_RXPTRUPD_Pos) /*!< Bit mask of
                                                                            EVENTS_RXPTRUPD field.*/
  #define TDM_EVENTS_RXPTRUPD_EVENTS_RXPTRUPD_Min (0x0UL) /*!< Min enumerator value of EVENTS_RXPTRUPD field.                  */
  #define TDM_EVENTS_RXPTRUPD_EVENTS_RXPTRUPD_Max (0x1UL) /*!< Max enumerator value of EVENTS_RXPTRUPD field.                  */
  #define TDM_EVENTS_RXPTRUPD_EVENTS_RXPTRUPD_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define TDM_EVENTS_RXPTRUPD_EVENTS_RXPTRUPD_Generated (0x1UL) /*!< Event generated                                           */


