nrfconnect/sdk-hal_nordic/nrfx/bsp/stable/mdk/nrf54lm20a_enga_types.h
/* DMPULLDOWN @Bit 24 : (unspecified) */
  #define USBHS_PHY_INPUTOVERRIDE_DMPULLDOWN_Pos (24UL) /*!< Position of DMPULLDOWN field.                                     */
  #define USBHS_PHY_INPUTOVERRIDE_DMPULLDOWN_Msk (0x1UL << USBHS_PHY_INPUTOVERRIDE_DMPULLDOWN_Pos) /*!< Bit mask of DMPULLDOWN
                                                                            field.*/

/* VBUSVALID @Bit 30 : (unspecified) */
  #define USBHS_PHY_INPUTOVERRIDE_VBUSVALID_Pos (30UL) /*!< Position of VBUSVALID field.                                       */
  #define USBHS_PHY_INPUTOVERRIDE_VBUSVALID_Msk (0x1UL << USBHS_PHY_INPUTOVERRIDE_VBUSVALID_Pos) /*!< Bit mask of VBUSVALID
                                                                            field.*/

/* ID @Bit 31 : Overrides OTG ID pin signal */
  #define USBHS_PHY_INPUTOVERRIDE_ID_Pos (31UL)      /*!< Position of ID field.                                                */
  #define USBHS_PHY_INPUTOVERRIDE_ID_Msk (0x1UL << USBHS_PHY_INPUTOVERRIDE_ID_Pos) /*!< Bit mask of ID field.                  */


/* USBHS_PHY_OVERRIDEVALUES: Values that are used to override the input signals to the PHY. */
  #define USBHS_PHY_OVERRIDEVALUES_ResetValue (0x00000000UL) /*!< Reset value of OVERRIDEVALUES register.                      */

/* DPPULLDOWN @Bit 23 : This field controls the pull-down resistor on D+ */
  #define USBHS_PHY_OVERRIDEVALUES_DPPULLDOWN_Pos (23UL) /*!< Position of DPPULLDOWN field.                                    */
  #define USBHS_PHY_OVERRIDEVALUES_DPPULLDOWN_Msk (0x1UL << USBHS_PHY_OVERRIDEVALUES_DPPULLDOWN_Pos) /*!< Bit mask of DPPULLDOWN
                                                                            field.*/
  #define USBHS_PHY_OVERRIDEVALUES_DPPULLDOWN_Min (0x0UL) /*!< Min enumerator value of DPPULLDOWN field.                       */
  #define USBHS_PHY_OVERRIDEVALUES_DPPULLDOWN_Max (0x1UL) /*!< Max enumerator value of DPPULLDOWN field.                       */
  #define USBHS_PHY_OVERRIDEVALUES_DPPULLDOWN_Enable (0x1UL) /*!< The pull-down resistor on D+ is enabled                      */
  #define USBHS_PHY_OVERRIDEVALUES_DPPULLDOWN_Disable (0x0UL) /*!< The pull-down resistor on D+ is disabled                    */

/* DMPULLDOWN @Bit 24 : This field controls the pull-down resistor on D- */
  #define USBHS_PHY_OVERRIDEVALUES_DMPULLDOWN_Pos (24UL) /*!< Position of DMPULLDOWN field.                                    */
  #define USBHS_PHY_OVERRIDEVALUES_DMPULLDOWN_Msk (0x1UL << USBHS_PHY_OVERRIDEVALUES_DMPULLDOWN_Pos) /*!< Bit mask of DMPULLDOWN
                                                                            field.*/
  #define USBHS_PHY_OVERRIDEVALUES_DMPULLDOWN_Min (0x0UL) /*!< Min enumerator value of DMPULLDOWN field.                       */
  #define USBHS_PHY_OVERRIDEVALUES_DMPULLDOWN_Max (0x1UL) /*!< Max enumerator value of DMPULLDOWN field.                       */
  #define USBHS_PHY_OVERRIDEVALUES_DMPULLDOWN_Enable (0x1UL) /*!< The pull-down resistor on D- is enabled                      */
  #define USBHS_PHY_OVERRIDEVALUES_DMPULLDOWN_Disable (0x0UL) /*!< The pull-down resistor on D- is disabled                    */

/* VBUSVALID @Bit 30 : Signals to the PHY that VBUS is valid, and enables the pull-up resistor on D+ */
  #define USBHS_PHY_OVERRIDEVALUES_VBUSVALID_Pos (30UL) /*!< Position of VBUSVALID field.                                      */
  #define USBHS_PHY_OVERRIDEVALUES_VBUSVALID_Msk (0x1UL << USBHS_PHY_OVERRIDEVALUES_VBUSVALID_Pos) /*!< Bit mask of VBUSVALID
                                                                            field.*/
  #define USBHS_PHY_OVERRIDEVALUES_VBUSVALID_Min (0x0UL) /*!< Min enumerator value of VBUSVALID field.                         */
  #define USBHS_PHY_OVERRIDEVALUES_VBUSVALID_Max (0x1UL) /*!< Max enumerator value of VBUSVALID field.                         */
  #define USBHS_PHY_OVERRIDEVALUES_VBUSVALID_Valid (0x1UL) /*!< VBUS is valid, and the pull up resistor on D+ is enabled       */
  #define USBHS_PHY_OVERRIDEVALUES_VBUSVALID_NotValid (0x0UL) /*!< VBUS is not valid, and the pull up resistor on D+ is
                                                                   disabled.*/

/* ID @Bit 31 : Overrides OTG ID pin signal */
  #define USBHS_PHY_OVERRIDEVALUES_ID_Pos (31UL)     /*!< Position of ID field.                                                */
  #define USBHS_PHY_OVERRIDEVALUES_ID_Msk (0x1UL << USBHS_PHY_OVERRIDEVALUES_ID_Pos) /*!< Bit mask of ID field.                */
  #define USBHS_PHY_OVERRIDEVALUES_ID_Min (0x0UL)    /*!< Min enumerator value of ID field.                                    */
  #define USBHS_PHY_OVERRIDEVALUES_ID_Max (0x1UL)    /*!< Max enumerator value of ID field.                                    */
  #define USBHS_PHY_OVERRIDEVALUES_ID_Device (0x1UL) /*!< Role is Device                                                       */
  #define USBHS_PHY_OVERRIDEVALUES_ID_Host (0x0UL)   /*!< Role is Host.                                                        */


/* USBHS_PHY_RTUNE: The RTUNE mode is an alternative method for calibrating the DP and DM 45-Ohm source impedance. */
  #define USBHS_PHY_RTUNE_ResetValue (0x0000000FUL)  /*!< Reset value of RTUNE register.                                       */

/* RTUNESEL @Bit 0 : This signal selects the tuning method for the high-speed DP and DM source impedance of the USBHS. */
  #define USBHS_PHY_RTUNE_RTUNESEL_Pos (0UL)         /*!< Position of RTUNESEL field.                                          */
  #define USBHS_PHY_RTUNE_RTUNESEL_Msk (0x1UL << USBHS_PHY_RTUNE_RTUNESEL_Pos) /*!< Bit mask of RTUNESEL field.                */
  #define USBHS_PHY_RTUNE_RTUNESEL_Min (0x0UL)       /*!< Min enumerator value of RTUNESEL field.                              */
  #define USBHS_PHY_RTUNE_RTUNESEL_Max (0x1UL)       /*!< Max enumerator value of RTUNESEL field.                              */
  #define USBHS_PHY_RTUNE_RTUNESEL_TXRTUNE (0x1UL)   /*!< The TXRTUNE pin, external resistor REXT, and resulting internal
                                                          digital calibration code are used for tuning the high-speed source
                                                          impedance.*/
  #define USBHS_PHY_RTUNE_RTUNESEL_RTUNE (0x0UL)     /*!< The RCALCODE value is used for tuning the high-speed source
                                                          impedance.*/

/* RCALCODE @Bits 1..4 : This signal is used to tune the internal 200 ohm resistor or the USBHS DP and DM high-speed source
                         impedance. */

  #define USBHS_PHY_RTUNE_RCALCODE_Pos (1UL)         /*!< Position of RCALCODE field.                                          */
  #define USBHS_PHY_RTUNE_RCALCODE_Msk (0xFUL << USBHS_PHY_RTUNE_RCALCODE_Pos) /*!< Bit mask of RCALCODE field.                */


/* ====================================================== Struct USBHS ======================================================= */
/**
  * @brief USBHS
  */
  typedef struct {                                   /*!< USBHS Structure                                                      */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Start the USB peripheral.                             */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Stop the USB peripheral                               */
    __IM uint32_t RESERVED[94];
    __IOM uint32_t PUBLISH_SOF;                      /*!< (@ 0x00000180) Publish configuration for SOF event.                  */
    __IM uint32_t RESERVED1[159];
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000400) Enable USB peripheral.                                */
    __IM uint32_t RESERVED2[15];
    __IOM NRF_USBHS_PHY_Type PHY;                    /*!< (@ 0x00000440) (unspecified)                                         */
  } NRF_USBHS_Type;                                  /*!< Size = 1128 (0x468)                                                  */

/* USBHS_TASKS_START: Start the USB peripheral. */
  #define USBHS_TASKS_START_ResetValue (0x00000000UL) /*!< Reset value of TASKS_START register.                                */

/* TASKS_START @Bit 0 : Start the USB peripheral. */
  #define USBHS_TASKS_START_TASKS_START_Pos (0UL)    /*!< Position of TASKS_START field.                                       */
  #define USBHS_TASKS_START_TASKS_START_Msk (0x1UL << USBHS_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field.   */
  #define USBHS_TASKS_START_TASKS_START_Min (0x1UL)  /*!< Min enumerator value of TASKS_START field.                           */
  #define USBHS_TASKS_START_TASKS_START_Max (0x1UL)  /*!< Max enumerator value of TASKS_START field.                           */
  #define USBHS_TASKS_START_TASKS_START_Trigger (0x1UL) /*!< Trigger task                                                      */


/* USBHS_TASKS_STOP: Stop the USB peripheral */
  #define USBHS_TASKS_STOP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_STOP register.                                  */

