nrfconnect/sdk-hal_nordic/nrfx/bsp/stable/mdk/nrf54lm20a_enga_types.h
/* TASKS_STOP @Bit 0 : Stop the USB peripheral */
  #define USBHS_TASKS_STOP_TASKS_STOP_Pos (0UL)      /*!< Position of TASKS_STOP field.                                        */
  #define USBHS_TASKS_STOP_TASKS_STOP_Msk (0x1UL << USBHS_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field.        */
  #define USBHS_TASKS_STOP_TASKS_STOP_Min (0x1UL)    /*!< Min enumerator value of TASKS_STOP field.                            */
  #define USBHS_TASKS_STOP_TASKS_STOP_Max (0x1UL)    /*!< Max enumerator value of TASKS_STOP field.                            */
  #define USBHS_TASKS_STOP_TASKS_STOP_Trigger (0x1UL) /*!< Trigger task                                                        */


/* USBHS_PUBLISH_SOF: Publish configuration for SOF event. */
  #define USBHS_PUBLISH_SOF_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_SOF register.                                */

/* CHIDX @Bits 0..7 : DPPI channel to publish to */
  #define USBHS_PUBLISH_SOF_CHIDX_Pos (0UL)          /*!< Position of CHIDX field.                                             */
  #define USBHS_PUBLISH_SOF_CHIDX_Msk (0xFFUL << USBHS_PUBLISH_SOF_CHIDX_Pos) /*!< Bit mask of CHIDX field.                    */
  #define USBHS_PUBLISH_SOF_CHIDX_Min (0x00UL)       /*!< Min value of CHIDX field.                                            */
  #define USBHS_PUBLISH_SOF_CHIDX_Max (0xFFUL)       /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : Enable publishing of SOF event */
  #define USBHS_PUBLISH_SOF_EN_Pos (31UL)            /*!< Position of EN field.                                                */
  #define USBHS_PUBLISH_SOF_EN_Msk (0x1UL << USBHS_PUBLISH_SOF_EN_Pos) /*!< Bit mask of EN field.                              */
  #define USBHS_PUBLISH_SOF_EN_Min (0x0UL)           /*!< Min enumerator value of EN field.                                    */
  #define USBHS_PUBLISH_SOF_EN_Max (0x1UL)           /*!< Max enumerator value of EN field.                                    */
  #define USBHS_PUBLISH_SOF_EN_Disabled (0x0UL)      /*!< Disable publishing                                                   */
  #define USBHS_PUBLISH_SOF_EN_Enabled (0x1UL)       /*!< Enable publishing                                                    */


/* USBHS_ENABLE: Enable USB peripheral. */
  #define USBHS_ENABLE_ResetValue (0x00000000UL)     /*!< Reset value of ENABLE register.                                      */

/* CORE @Bit 0 : Enable USB Controller */
  #define USBHS_ENABLE_CORE_Pos (0UL)                /*!< Position of CORE field.                                              */
  #define USBHS_ENABLE_CORE_Msk (0x1UL << USBHS_ENABLE_CORE_Pos) /*!< Bit mask of CORE field.                                  */
  #define USBHS_ENABLE_CORE_Min (0x0UL)              /*!< Min enumerator value of CORE field.                                  */
  #define USBHS_ENABLE_CORE_Max (0x1UL)              /*!< Max enumerator value of CORE field.                                  */
  #define USBHS_ENABLE_CORE_Disabled (0x0UL)         /*!< USB Controller disabled.                                             */
  #define USBHS_ENABLE_CORE_Enabled (0x1UL)          /*!< USB Controller enabled.                                              */

/* PHY @Bit 1 : Enable USB PHY */
  #define USBHS_ENABLE_PHY_Pos (1UL)                 /*!< Position of PHY field.                                               */
  #define USBHS_ENABLE_PHY_Msk (0x1UL << USBHS_ENABLE_PHY_Pos) /*!< Bit mask of PHY field.                                     */
  #define USBHS_ENABLE_PHY_Min (0x0UL)               /*!< Min enumerator value of PHY field.                                   */
  #define USBHS_ENABLE_PHY_Max (0x1UL)               /*!< Max enumerator value of PHY field.                                   */
  #define USBHS_ENABLE_PHY_Disabled (0x0UL)          /*!< USB PHY disabled.                                                    */
  #define USBHS_ENABLE_PHY_Enabled (0x1UL)           /*!< USB PHY enabled.                                                     */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                         USBHSCORE                                         ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* =================================================== Struct USBHSCORE_HC =================================================== */
/**
  * @brief HC [USBHSCORE_HC] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CHAR;                              /*!< (@ 0x00000000) Host Channel Characteristics Register                 */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  INT;                               /*!< (@ 0x00000008) Host Channel Interrupt Register                       */
  __IOM uint32_t  INTMSK;                            /*!< (@ 0x0000000C) Host Channel Interrupt Mask Register                  */
  __IOM uint32_t  TSIZ;                              /*!< (@ 0x00000010) Host Channel Transfer Size Register                   */
  __IOM uint32_t  DMA;                               /*!< (@ 0x00000014) Host Channel DMA Address Register                     */
  __IM  uint32_t  RESERVED1;
} NRF_USBHSCORE_HC_Type;                             /*!< Size = 28 (0x01C)                                                    */
  #define USBHSCORE_HC_MaxCount (16UL)               /*!< Size of HC[16] array.                                                */
  #define USBHSCORE_HC_MaxIndex (15UL)               /*!< Max index of HC[16] array.                                           */
  #define USBHSCORE_HC_MinIndex (0UL)                /*!< Min index of HC[16] array.                                           */

/* USBHSCORE_HC_CHAR: Host Channel Characteristics Register */
  #define USBHSCORE_HC_CHAR_ResetValue (0x00000000UL) /*!< Reset value of CHAR register.                                       */

