nrfconnect/sdk-hal_nordic/nrfx/bsp/stable/mdk/nrf54lm20a_enga_types.h
/* MPS @Bits 0..10 : Maximum Packet Size (MPS) */
  #define USBHSCORE_HC_CHAR_MPS_Pos (0UL)            /*!< Position of MPS field.                                               */
  #define USBHSCORE_HC_CHAR_MPS_Msk (0x7FFUL << USBHSCORE_HC_CHAR_MPS_Pos) /*!< Bit mask of MPS field.                         */

/* EPNUM @Bits 11..14 : Endpoint Number (EPNum) */
  #define USBHSCORE_HC_CHAR_EPNUM_Pos (11UL)         /*!< Position of EPNUM field.                                             */
  #define USBHSCORE_HC_CHAR_EPNUM_Msk (0xFUL << USBHSCORE_HC_CHAR_EPNUM_Pos) /*!< Bit mask of EPNUM field.                     */
  #define USBHSCORE_HC_CHAR_EPNUM_Min (0x0UL)        /*!< Min enumerator value of EPNUM field.                                 */
  #define USBHSCORE_HC_CHAR_EPNUM_Max (0xFUL)        /*!< Max enumerator value of EPNUM field.                                 */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT0 (0x0UL)     /*!< End point 0                                                          */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT1 (0x1UL)     /*!< End point 1                                                          */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT2 (0x2UL)     /*!< End point 2                                                          */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT3 (0x3UL)     /*!< End point 3                                                          */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT4 (0x4UL)     /*!< End point 4                                                          */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT5 (0x5UL)     /*!< End point 5                                                          */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT6 (0x6UL)     /*!< End point 6                                                          */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT7 (0x7UL)     /*!< End point 7                                                          */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT8 (0x8UL)     /*!< End point 8                                                          */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT9 (0x9UL)     /*!< End point 9                                                          */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT10 (0xAUL)    /*!< End point 10                                                         */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT11 (0xBUL)    /*!< End point 11                                                         */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT12 (0xCUL)    /*!< End point 12                                                         */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT13 (0xDUL)    /*!< End point 13                                                         */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT14 (0xEUL)    /*!< End point 14                                                         */
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT15 (0xFUL)    /*!< End point 15                                                         */

/* EPDIR @Bit 15 : Endpoint Direction (EPDir) */
  #define USBHSCORE_HC_CHAR_EPDIR_Pos (15UL)         /*!< Position of EPDIR field.                                             */
  #define USBHSCORE_HC_CHAR_EPDIR_Msk (0x1UL << USBHSCORE_HC_CHAR_EPDIR_Pos) /*!< Bit mask of EPDIR field.                     */
  #define USBHSCORE_HC_CHAR_EPDIR_Min (0x0UL)        /*!< Min enumerator value of EPDIR field.                                 */
  #define USBHSCORE_HC_CHAR_EPDIR_Max (0x1UL)        /*!< Max enumerator value of EPDIR field.                                 */
  #define USBHSCORE_HC_CHAR_EPDIR_OUT (0x0UL)        /*!< OUT Direction                                                        */
  #define USBHSCORE_HC_CHAR_EPDIR_IN (0x1UL)         /*!< IN Direction                                                         */

/* LSPDDEV @Bit 17 : Low-Speed Device (LSpdDev) */
  #define USBHSCORE_HC_CHAR_LSPDDEV_Pos (17UL)       /*!< Position of LSPDDEV field.                                           */
  #define USBHSCORE_HC_CHAR_LSPDDEV_Msk (0x1UL << USBHSCORE_HC_CHAR_LSPDDEV_Pos) /*!< Bit mask of LSPDDEV field.               */
  #define USBHSCORE_HC_CHAR_LSPDDEV_Min (0x0UL)      /*!< Min enumerator value of LSPDDEV field.                               */
  #define USBHSCORE_HC_CHAR_LSPDDEV_Max (0x1UL)      /*!< Max enumerator value of LSPDDEV field.                               */
  #define USBHSCORE_HC_CHAR_LSPDDEV_DISABLED (0x0UL) /*!< Not Communicating with low speed device                              */
  #define USBHSCORE_HC_CHAR_LSPDDEV_ENABLED (0x1UL)  /*!< Communicating with low speed device                                  */

/* EPTYPE @Bits 18..19 : Endpoint Type (EPType) */
  #define USBHSCORE_HC_CHAR_EPTYPE_Pos (18UL)        /*!< Position of EPTYPE field.                                            */
  #define USBHSCORE_HC_CHAR_EPTYPE_Msk (0x3UL << USBHSCORE_HC_CHAR_EPTYPE_Pos) /*!< Bit mask of EPTYPE field.                  */
  #define USBHSCORE_HC_CHAR_EPTYPE_Min (0x0UL)       /*!< Min enumerator value of EPTYPE field.                                */
  #define USBHSCORE_HC_CHAR_EPTYPE_Max (0x3UL)       /*!< Max enumerator value of EPTYPE field.                                */
  #define USBHSCORE_HC_CHAR_EPTYPE_CTRL (0x0UL)      /*!< Control                                                              */
  #define USBHSCORE_HC_CHAR_EPTYPE_ISOC (0x1UL)      /*!< Isochronous                                                          */
  #define USBHSCORE_HC_CHAR_EPTYPE_BULK (0x2UL)      /*!< Bulk                                                                 */
  #define USBHSCORE_HC_CHAR_EPTYPE_INTERR (0x3UL)    /*!< Interrupt                                                            */

/* EC @Bits 20..21 : Multi Count (MC) / Error Count (EC) */
  #define USBHSCORE_HC_CHAR_EC_Pos (20UL)            /*!< Position of EC field.                                                */
  #define USBHSCORE_HC_CHAR_EC_Msk (0x3UL << USBHSCORE_HC_CHAR_EC_Pos) /*!< Bit mask of EC field.                              */
  #define USBHSCORE_HC_CHAR_EC_Min (0x1UL)           /*!< Min enumerator value of EC field.                                    */
  #define USBHSCORE_HC_CHAR_EC_Max (0x3UL)           /*!< Max enumerator value of EC field.                                    */
  #define USBHSCORE_HC_CHAR_EC_TRANSONE (0x1UL)      /*!< 1 transaction                                                        */
  #define USBHSCORE_HC_CHAR_EC_TRANSTWO (0x2UL)      /*!< 2 transactions to be issued for this endpoint per microframe         */
  #define USBHSCORE_HC_CHAR_EC_TRANSTHREE (0x3UL)    /*!< 3 transactions to be issued for this endpoint per microframe         */

/* DEVADDR @Bits 22..28 : Device Address (DevAddr) */
  #define USBHSCORE_HC_CHAR_DEVADDR_Pos (22UL)       /*!< Position of DEVADDR field.                                           */
  #define USBHSCORE_HC_CHAR_DEVADDR_Msk (0x7FUL << USBHSCORE_HC_CHAR_DEVADDR_Pos) /*!< Bit mask of DEVADDR field.              */

/* ODDFRM @Bit 29 : Odd Frame (OddFrm) */
  #define USBHSCORE_HC_CHAR_ODDFRM_Pos (29UL)        /*!< Position of ODDFRM field.                                            */
  #define USBHSCORE_HC_CHAR_ODDFRM_Msk (0x1UL << USBHSCORE_HC_CHAR_ODDFRM_Pos) /*!< Bit mask of ODDFRM field.                  */
  #define USBHSCORE_HC_CHAR_ODDFRM_Min (0x0UL)       /*!< Min enumerator value of ODDFRM field.                                */
  #define USBHSCORE_HC_CHAR_ODDFRM_Max (0x1UL)       /*!< Max enumerator value of ODDFRM field.                                */
  #define USBHSCORE_HC_CHAR_ODDFRM_EFRAME (0x0UL)    /*!< Even Frame Transfer                                                  */
  #define USBHSCORE_HC_CHAR_ODDFRM_OFRAME (0x1UL)    /*!< Odd Frame Transfer                                                   */

/* CHDIS @Bit 30 : Channel Disable (ChDis) */
  #define USBHSCORE_HC_CHAR_CHDIS_Pos (30UL)         /*!< Position of CHDIS field.                                             */
  #define USBHSCORE_HC_CHAR_CHDIS_Msk (0x1UL << USBHSCORE_HC_CHAR_CHDIS_Pos) /*!< Bit mask of CHDIS field.                     */
  #define USBHSCORE_HC_CHAR_CHDIS_Min (0x0UL)        /*!< Min enumerator value of CHDIS field.                                 */
  #define USBHSCORE_HC_CHAR_CHDIS_Max (0x1UL)        /*!< Max enumerator value of CHDIS field.                                 */
  #define USBHSCORE_HC_CHAR_CHDIS_INACTIVE (0x0UL)   /*!< Transmit/Recieve normal                                              */
  #define USBHSCORE_HC_CHAR_CHDIS_ACTIVE (0x1UL)     /*!< Stop transmitting/receiving data on channel                          */

/* CHENA @Bit 31 : Channel Enable (ChEna) */
  #define USBHSCORE_HC_CHAR_CHENA_Pos (31UL)         /*!< Position of CHENA field.                                             */
  #define USBHSCORE_HC_CHAR_CHENA_Msk (0x1UL << USBHSCORE_HC_CHAR_CHENA_Pos) /*!< Bit mask of CHENA field.                     */
  #define USBHSCORE_HC_CHAR_CHENA_Min (0x0UL)        /*!< Min enumerator value of CHENA field.                                 */
  #define USBHSCORE_HC_CHAR_CHENA_Max (0x1UL)        /*!< Max enumerator value of CHENA field.                                 */
  #define USBHSCORE_HC_CHAR_CHENA_DISABLED (0x0UL)   /*!< If Scatter/Gather mode is enabled, indicates that the descriptor
                                                          structure is not yet ready. If Scatter/Gather mode is disabled,
                                                          indicates that the channel is disabled.*/
  #define USBHSCORE_HC_CHAR_CHENA_ENABLED (0x1UL)    /*!< If Scatter/Gather mode is enabled, indicates that the descriptor
                                                          structure and data buffer with data is set up and this channel can
                                                          access the descriptor. If Scatter/Gather mode is disabled, indicates
                                                          that the channel is enabled.*/


/* USBHSCORE_HC_INT: Host Channel Interrupt Register */
  #define USBHSCORE_HC_INT_ResetValue (0x00000000UL) /*!< Reset value of INT register.                                         */

/* XFERCOMPL @Bit 0 : Transfer Completed (XferCompl) */
  #define USBHSCORE_HC_INT_XFERCOMPL_Pos (0UL)       /*!< Position of XFERCOMPL field.                                         */
  #define USBHSCORE_HC_INT_XFERCOMPL_Msk (0x1UL << USBHSCORE_HC_INT_XFERCOMPL_Pos) /*!< Bit mask of XFERCOMPL field.           */
  #define USBHSCORE_HC_INT_XFERCOMPL_Min (0x0UL)     /*!< Min enumerator value of XFERCOMPL field.                             */
  #define USBHSCORE_HC_INT_XFERCOMPL_Max (0x1UL)     /*!< Max enumerator value of XFERCOMPL field.                             */
  #define USBHSCORE_HC_INT_XFERCOMPL_INACTIVE (0x0UL) /*!< Transfer in progress or No Active Transfer                          */
  #define USBHSCORE_HC_INT_XFERCOMPL_ACTIVE (0x1UL)  /*!< Transfer completed normally without any errors                       */

/* CHHLTD @Bit 1 : Channel Halted (ChHltd) */
  #define USBHSCORE_HC_INT_CHHLTD_Pos (1UL)          /*!< Position of CHHLTD field.                                            */
  #define USBHSCORE_HC_INT_CHHLTD_Msk (0x1UL << USBHSCORE_HC_INT_CHHLTD_Pos) /*!< Bit mask of CHHLTD field.                    */
  #define USBHSCORE_HC_INT_CHHLTD_Min (0x0UL)        /*!< Min enumerator value of CHHLTD field.                                */
  #define USBHSCORE_HC_INT_CHHLTD_Max (0x1UL)        /*!< Max enumerator value of CHHLTD field.                                */
  #define USBHSCORE_HC_INT_CHHLTD_INACTIVE (0x0UL)   /*!< Channel not halted                                                   */
  #define USBHSCORE_HC_INT_CHHLTD_ACTIVE (0x1UL)     /*!< Channel Halted                                                       */

/* AHBERR @Bit 2 : AHB Error (AHBErr) */
  #define USBHSCORE_HC_INT_AHBERR_Pos (2UL)          /*!< Position of AHBERR field.                                            */
  #define USBHSCORE_HC_INT_AHBERR_Msk (0x1UL << USBHSCORE_HC_INT_AHBERR_Pos) /*!< Bit mask of AHBERR field.                    */
  #define USBHSCORE_HC_INT_AHBERR_Min (0x0UL)        /*!< Min enumerator value of AHBERR field.                                */
  #define USBHSCORE_HC_INT_AHBERR_Max (0x1UL)        /*!< Max enumerator value of AHBERR field.                                */
  #define USBHSCORE_HC_INT_AHBERR_INACTIVE (0x0UL)   /*!< No AHB error                                                         */
  #define USBHSCORE_HC_INT_AHBERR_ACTIVE (0x1UL)     /*!< AHB error during AHB read/write                                      */

/* STALL @Bit 3 : STALL Response Received Interrupt (STALL) */
  #define USBHSCORE_HC_INT_STALL_Pos (3UL)           /*!< Position of STALL field.                                             */
  #define USBHSCORE_HC_INT_STALL_Msk (0x1UL << USBHSCORE_HC_INT_STALL_Pos) /*!< Bit mask of STALL field.                       */
  #define USBHSCORE_HC_INT_STALL_Min (0x0UL)         /*!< Min enumerator value of STALL field.                                 */
  #define USBHSCORE_HC_INT_STALL_Max (0x1UL)         /*!< Max enumerator value of STALL field.                                 */
  #define USBHSCORE_HC_INT_STALL_INACTIVE (0x0UL)    /*!< No Stall Response Received Interrupt                                 */
  #define USBHSCORE_HC_INT_STALL_ACTIVE (0x1UL)      /*!< Stall Response Received Interrupt                                    */

