nrfconnect/sdk-hal_nordic/nrfx/bsp/stable/mdk/nrf54lm20a_enga_types.h
/* STALLMSK @Bit 3 : (unspecified) */
  #define USBHSCORE_HC_INTMSK_STALLMSK_Pos (3UL)     /*!< Position of STALLMSK field.                                          */
  #define USBHSCORE_HC_INTMSK_STALLMSK_Msk (0x1UL << USBHSCORE_HC_INTMSK_STALLMSK_Pos) /*!< Bit mask of STALLMSK field.        */
  #define USBHSCORE_HC_INTMSK_STALLMSK_Min (0x0UL)   /*!< Min enumerator value of STALLMSK field.                              */
  #define USBHSCORE_HC_INTMSK_STALLMSK_Max (0x1UL)   /*!< Max enumerator value of STALLMSK field.                              */
  #define USBHSCORE_HC_INTMSK_STALLMSK_MASK (0x0UL)  /*!< Mask STALL Response Received Interrupt                               */
  #define USBHSCORE_HC_INTMSK_STALLMSK_NOMASK (0x1UL) /*!< No STALL Response Received Interrupt Mask                           */

/* NAKMSK @Bit 4 : (unspecified) */
  #define USBHSCORE_HC_INTMSK_NAKMSK_Pos (4UL)       /*!< Position of NAKMSK field.                                            */
  #define USBHSCORE_HC_INTMSK_NAKMSK_Msk (0x1UL << USBHSCORE_HC_INTMSK_NAKMSK_Pos) /*!< Bit mask of NAKMSK field.              */
  #define USBHSCORE_HC_INTMSK_NAKMSK_Min (0x0UL)     /*!< Min enumerator value of NAKMSK field.                                */
  #define USBHSCORE_HC_INTMSK_NAKMSK_Max (0x1UL)     /*!< Max enumerator value of NAKMSK field.                                */
  #define USBHSCORE_HC_INTMSK_NAKMSK_MASK (0x0UL)    /*!< Mask NAK Response Received Interrupt                                 */
  #define USBHSCORE_HC_INTMSK_NAKMSK_NOMASK (0x1UL)  /*!< No NAK Response Received Interrupt Mask                              */

/* ACKMSK @Bit 5 : (unspecified) */
  #define USBHSCORE_HC_INTMSK_ACKMSK_Pos (5UL)       /*!< Position of ACKMSK field.                                            */
  #define USBHSCORE_HC_INTMSK_ACKMSK_Msk (0x1UL << USBHSCORE_HC_INTMSK_ACKMSK_Pos) /*!< Bit mask of ACKMSK field.              */
  #define USBHSCORE_HC_INTMSK_ACKMSK_Min (0x0UL)     /*!< Min enumerator value of ACKMSK field.                                */
  #define USBHSCORE_HC_INTMSK_ACKMSK_Max (0x1UL)     /*!< Max enumerator value of ACKMSK field.                                */
  #define USBHSCORE_HC_INTMSK_ACKMSK_MASK (0x0UL)    /*!< Mask ACK Response Received/Transmitted Interrupt                     */
  #define USBHSCORE_HC_INTMSK_ACKMSK_NOMASK (0x1UL)  /*!< No ACK Response Received/Transmitted Interrupt Mask                  */

/* NYETMSK @Bit 6 : (unspecified) */
  #define USBHSCORE_HC_INTMSK_NYETMSK_Pos (6UL)      /*!< Position of NYETMSK field.                                           */
  #define USBHSCORE_HC_INTMSK_NYETMSK_Msk (0x1UL << USBHSCORE_HC_INTMSK_NYETMSK_Pos) /*!< Bit mask of NYETMSK field.           */
  #define USBHSCORE_HC_INTMSK_NYETMSK_Min (0x0UL)    /*!< Min enumerator value of NYETMSK field.                               */
  #define USBHSCORE_HC_INTMSK_NYETMSK_Max (0x1UL)    /*!< Max enumerator value of NYETMSK field.                               */
  #define USBHSCORE_HC_INTMSK_NYETMSK_MASK (0x0UL)   /*!< Mask NYET Response Received Interrupt                                */
  #define USBHSCORE_HC_INTMSK_NYETMSK_NOMASK (0x1UL) /*!< No NYET Response Received Interrupt Mask                             */

/* XACTERRMSK @Bit 7 : (unspecified) */
  #define USBHSCORE_HC_INTMSK_XACTERRMSK_Pos (7UL)   /*!< Position of XACTERRMSK field.                                        */
  #define USBHSCORE_HC_INTMSK_XACTERRMSK_Msk (0x1UL << USBHSCORE_HC_INTMSK_XACTERRMSK_Pos) /*!< Bit mask of XACTERRMSK field.  */
  #define USBHSCORE_HC_INTMSK_XACTERRMSK_Min (0x0UL) /*!< Min enumerator value of XACTERRMSK field.                            */
  #define USBHSCORE_HC_INTMSK_XACTERRMSK_Max (0x1UL) /*!< Max enumerator value of XACTERRMSK field.                            */
  #define USBHSCORE_HC_INTMSK_XACTERRMSK_MASK (0x0UL) /*!< Mask Transaction Error                                              */
  #define USBHSCORE_HC_INTMSK_XACTERRMSK_NOMASK (0x1UL) /*!< No Transaction Error Mask                                         */

/* BBLERRMSK @Bit 8 : (unspecified) */
  #define USBHSCORE_HC_INTMSK_BBLERRMSK_Pos (8UL)    /*!< Position of BBLERRMSK field.                                         */
  #define USBHSCORE_HC_INTMSK_BBLERRMSK_Msk (0x1UL << USBHSCORE_HC_INTMSK_BBLERRMSK_Pos) /*!< Bit mask of BBLERRMSK field.     */
  #define USBHSCORE_HC_INTMSK_BBLERRMSK_Min (0x0UL)  /*!< Min enumerator value of BBLERRMSK field.                             */
  #define USBHSCORE_HC_INTMSK_BBLERRMSK_Max (0x1UL)  /*!< Max enumerator value of BBLERRMSK field.                             */
  #define USBHSCORE_HC_INTMSK_BBLERRMSK_MASK (0x0UL) /*!< Mask Babble Error                                                    */
  #define USBHSCORE_HC_INTMSK_BBLERRMSK_NOMASK (0x1UL) /*!< No Babble Error Mask                                               */

/* FRMOVRUNMSK @Bit 9 : (unspecified) */
  #define USBHSCORE_HC_INTMSK_FRMOVRUNMSK_Pos (9UL)  /*!< Position of FRMOVRUNMSK field.                                       */
  #define USBHSCORE_HC_INTMSK_FRMOVRUNMSK_Msk (0x1UL << USBHSCORE_HC_INTMSK_FRMOVRUNMSK_Pos) /*!< Bit mask of FRMOVRUNMSK
                                                                            field.*/
  #define USBHSCORE_HC_INTMSK_FRMOVRUNMSK_Min (0x0UL) /*!< Min enumerator value of FRMOVRUNMSK field.                          */
  #define USBHSCORE_HC_INTMSK_FRMOVRUNMSK_Max (0x1UL) /*!< Max enumerator value of FRMOVRUNMSK field.                          */
  #define USBHSCORE_HC_INTMSK_FRMOVRUNMSK_MASK (0x0UL) /*!< Mask Overrun Mask                                                  */
  #define USBHSCORE_HC_INTMSK_FRMOVRUNMSK_NOMASK (0x1UL) /*!< No Frame Overrun Mask                                            */

/* DATATGLERRMSK @Bit 10 : (unspecified) */
  #define USBHSCORE_HC_INTMSK_DATATGLERRMSK_Pos (10UL) /*!< Position of DATATGLERRMSK field.                                   */
  #define USBHSCORE_HC_INTMSK_DATATGLERRMSK_Msk (0x1UL << USBHSCORE_HC_INTMSK_DATATGLERRMSK_Pos) /*!< Bit mask of DATATGLERRMSK
                                                                            field.*/
  #define USBHSCORE_HC_INTMSK_DATATGLERRMSK_Min (0x0UL) /*!< Min enumerator value of DATATGLERRMSK field.                      */
  #define USBHSCORE_HC_INTMSK_DATATGLERRMSK_Max (0x1UL) /*!< Max enumerator value of DATATGLERRMSK field.                      */
  #define USBHSCORE_HC_INTMSK_DATATGLERRMSK_MASK (0x0UL) /*!< Mask Data Toggle Error                                           */
  #define USBHSCORE_HC_INTMSK_DATATGLERRMSK_NOMASK (0x1UL) /*!< No Data Toggle Error Mask                                      */


/* USBHSCORE_HC_TSIZ: Host Channel Transfer Size Register */
  #define USBHSCORE_HC_TSIZ_ResetValue (0x00000000UL) /*!< Reset value of TSIZ register.                                       */

