nrfconnect/sdk-hal_nordic/nrfx/bsp/stable/mdk/nrf54lm20a_enga_types.h
/* AVALIDFLTR @Bit 22 : a_valid Filter Enabled (AValidFltr) */
  #define USBHSCORE_GHWCFG4_AVALIDFLTR_Pos (22UL)    /*!< Position of AVALIDFLTR field.                                        */
  #define USBHSCORE_GHWCFG4_AVALIDFLTR_Msk (0x1UL << USBHSCORE_GHWCFG4_AVALIDFLTR_Pos) /*!< Bit mask of AVALIDFLTR field.      */
  #define USBHSCORE_GHWCFG4_AVALIDFLTR_Min (0x0UL)   /*!< Min enumerator value of AVALIDFLTR field.                            */
  #define USBHSCORE_GHWCFG4_AVALIDFLTR_Max (0x1UL)   /*!< Max enumerator value of AVALIDFLTR field.                            */
  #define USBHSCORE_GHWCFG4_AVALIDFLTR_DISABLED (0x0UL) /*!< No filter                                                         */
  #define USBHSCORE_GHWCFG4_AVALIDFLTR_ENABLED (0x1UL) /*!< Filter                                                             */

/* BVALIDFLTR @Bit 23 : b_valid Filter Enabled (BValidFltr) */
  #define USBHSCORE_GHWCFG4_BVALIDFLTR_Pos (23UL)    /*!< Position of BVALIDFLTR field.                                        */
  #define USBHSCORE_GHWCFG4_BVALIDFLTR_Msk (0x1UL << USBHSCORE_GHWCFG4_BVALIDFLTR_Pos) /*!< Bit mask of BVALIDFLTR field.      */
  #define USBHSCORE_GHWCFG4_BVALIDFLTR_Min (0x0UL)   /*!< Min enumerator value of BVALIDFLTR field.                            */
  #define USBHSCORE_GHWCFG4_BVALIDFLTR_Max (0x1UL)   /*!< Max enumerator value of BVALIDFLTR field.                            */
  #define USBHSCORE_GHWCFG4_BVALIDFLTR_DISABLED (0x0UL) /*!< No Filter                                                         */
  #define USBHSCORE_GHWCFG4_BVALIDFLTR_ENABLED (0x1UL) /*!< Filter                                                             */

/* SESSENDFLTR @Bit 24 : session_end Filter Enabled (SessEndFltr) */
  #define USBHSCORE_GHWCFG4_SESSENDFLTR_Pos (24UL)   /*!< Position of SESSENDFLTR field.                                       */
  #define USBHSCORE_GHWCFG4_SESSENDFLTR_Msk (0x1UL << USBHSCORE_GHWCFG4_SESSENDFLTR_Pos) /*!< Bit mask of SESSENDFLTR field.   */
  #define USBHSCORE_GHWCFG4_SESSENDFLTR_Min (0x0UL)  /*!< Min enumerator value of SESSENDFLTR field.                           */
  #define USBHSCORE_GHWCFG4_SESSENDFLTR_Max (0x1UL)  /*!< Max enumerator value of SESSENDFLTR field.                           */
  #define USBHSCORE_GHWCFG4_SESSENDFLTR_DISABLED (0x0UL) /*!< No filter                                                        */
  #define USBHSCORE_GHWCFG4_SESSENDFLTR_ENABLED (0x1UL) /*!< Filter                                                            */

/* DEDFIFOMODE @Bit 25 : Enable Dedicated Transmit FIFO for device IN Endpoints */
  #define USBHSCORE_GHWCFG4_DEDFIFOMODE_Pos (25UL)   /*!< Position of DEDFIFOMODE field.                                       */
  #define USBHSCORE_GHWCFG4_DEDFIFOMODE_Msk (0x1UL << USBHSCORE_GHWCFG4_DEDFIFOMODE_Pos) /*!< Bit mask of DEDFIFOMODE field.   */
  #define USBHSCORE_GHWCFG4_DEDFIFOMODE_Min (0x0UL)  /*!< Min enumerator value of DEDFIFOMODE field.                           */
  #define USBHSCORE_GHWCFG4_DEDFIFOMODE_Max (0x1UL)  /*!< Max enumerator value of DEDFIFOMODE field.                           */
  #define USBHSCORE_GHWCFG4_DEDFIFOMODE_DISABLED (0x0UL) /*!< Dedicated Transmit FIFO Operation not enabled                    */
  #define USBHSCORE_GHWCFG4_DEDFIFOMODE_ENABLED (0x1UL) /*!< Dedicated Transmit FIFO Operation enabled                         */

/* INEPS @Bits 26..29 : Number of Device Mode IN Endpoints Including Control Endpoints (INEps) */
  #define USBHSCORE_GHWCFG4_INEPS_Pos (26UL)         /*!< Position of INEPS field.                                             */
  #define USBHSCORE_GHWCFG4_INEPS_Msk (0xFUL << USBHSCORE_GHWCFG4_INEPS_Pos) /*!< Bit mask of INEPS field.                     */
  #define USBHSCORE_GHWCFG4_INEPS_Min (0x0UL)        /*!< Min enumerator value of INEPS field.                                 */
  #define USBHSCORE_GHWCFG4_INEPS_Max (0xFUL)        /*!< Max enumerator value of INEPS field.                                 */
  #define USBHSCORE_GHWCFG4_INEPS_ENDPT1 (0x0UL)     /*!< 1 IN Endpoint                                                        */
  #define USBHSCORE_GHWCFG4_INEPS_ENDPT2 (0x1UL)     /*!< 2 IN Endpoints                                                       */
  #define USBHSCORE_GHWCFG4_INEPS_ENDPT3 (0x2UL)     /*!< 3 IN Endpoints                                                       */
  #define USBHSCORE_GHWCFG4_INEPS_ENDPT4 (0x3UL)     /*!< 4 IN Endpoints                                                       */
  #define USBHSCORE_GHWCFG4_INEPS_ENDPT5 (0x4UL)     /*!< 5 IN Endpoints                                                       */
  #define USBHSCORE_GHWCFG4_INEPS_ENDPT6 (0x5UL)     /*!< 6 IN Endpoints                                                       */
  #define USBHSCORE_GHWCFG4_INEPS_ENDPT7 (0x6UL)     /*!< 7 IN Endpoints                                                       */
  #define USBHSCORE_GHWCFG4_INEPS_ENDPT8 (0x7UL)     /*!< 8 IN Endpoints                                                       */
  #define USBHSCORE_GHWCFG4_INEPS_ENDPT9 (0x8UL)     /*!< 9 IN Endpoints                                                       */
  #define USBHSCORE_GHWCFG4_INEPS_ENDPT10 (0x9UL)    /*!< 10 IN Endpoints                                                      */
  #define USBHSCORE_GHWCFG4_INEPS_ENDPT11 (0xAUL)    /*!< 11 IN Endpoints                                                      */
  #define USBHSCORE_GHWCFG4_INEPS_ENDPT12 (0xBUL)    /*!< 12 IN Endpoints                                                      */
  #define USBHSCORE_GHWCFG4_INEPS_ENDPT13 (0xCUL)    /*!< 13 IN Endpoints                                                      */
  #define USBHSCORE_GHWCFG4_INEPS_ENDPT14 (0xDUL)    /*!< 14 IN Endpoints                                                      */
  #define USBHSCORE_GHWCFG4_INEPS_ENDPT15 (0xEUL)    /*!< 15 IN Endpoints                                                      */
  #define USBHSCORE_GHWCFG4_INEPS_ENDPT16 (0xFUL)    /*!< 16 IN Endpoints                                                      */

