nrfconnect/sdk-hal_nordic/nrfx/bsp/stable/mdk/nrf54lm20a_enga_types.h
/* DESCDMAENABLED @Bit 30 : Scatter/Gather DMA configuration */
  #define USBHSCORE_GHWCFG4_DESCDMAENABLED_Pos (30UL) /*!< Position of DESCDMAENABLED field.                                   */
  #define USBHSCORE_GHWCFG4_DESCDMAENABLED_Msk (0x1UL << USBHSCORE_GHWCFG4_DESCDMAENABLED_Pos) /*!< Bit mask of DESCDMAENABLED
                                                                            field.*/
  #define USBHSCORE_GHWCFG4_DESCDMAENABLED_Min (0x0UL) /*!< Min enumerator value of DESCDMAENABLED field.                      */
  #define USBHSCORE_GHWCFG4_DESCDMAENABLED_Max (0x1UL) /*!< Max enumerator value of DESCDMAENABLED field.                      */
  #define USBHSCORE_GHWCFG4_DESCDMAENABLED_DISABLE (0x0UL) /*!< Non-Scatter/Gather DMA configuration                           */
  #define USBHSCORE_GHWCFG4_DESCDMAENABLED_ENABLE (0x1UL) /*!< Scatter/Gather DMA configuration                                */

/* DESCDMA @Bit 31 : Scatter/Gather DMA configuration */
  #define USBHSCORE_GHWCFG4_DESCDMA_Pos (31UL)       /*!< Position of DESCDMA field.                                           */
  #define USBHSCORE_GHWCFG4_DESCDMA_Msk (0x1UL << USBHSCORE_GHWCFG4_DESCDMA_Pos) /*!< Bit mask of DESCDMA field.               */
  #define USBHSCORE_GHWCFG4_DESCDMA_Min (0x0UL)      /*!< Min enumerator value of DESCDMA field.                               */
  #define USBHSCORE_GHWCFG4_DESCDMA_Max (0x1UL)      /*!< Max enumerator value of DESCDMA field.                               */
  #define USBHSCORE_GHWCFG4_DESCDMA_CONFIG1 (0x0UL)  /*!< Non Dynamic configuration                                            */
  #define USBHSCORE_GHWCFG4_DESCDMA_CONFIG2 (0x1UL)  /*!< Dynamic configuration                                                */


/* USBHSCORE_GLPMCFG: LPM Config Register */
  #define USBHSCORE_GLPMCFG_ResetValue (0x00000000UL) /*!< Reset value of GLPMCFG register.                                    */

/* LPMCAP @Bit 0 : LPM-Capable (LPMCap) */
  #define USBHSCORE_GLPMCFG_LPMCAP_Pos (0UL)         /*!< Position of LPMCAP field.                                            */
  #define USBHSCORE_GLPMCFG_LPMCAP_Msk (0x1UL << USBHSCORE_GLPMCFG_LPMCAP_Pos) /*!< Bit mask of LPMCAP field.                  */
  #define USBHSCORE_GLPMCFG_LPMCAP_Min (0x0UL)       /*!< Min enumerator value of LPMCAP field.                                */
  #define USBHSCORE_GLPMCFG_LPMCAP_Max (0x1UL)       /*!< Max enumerator value of LPMCAP field.                                */
  #define USBHSCORE_GLPMCFG_LPMCAP_DISABLED (0x0UL)  /*!< LPM capability is not enabled                                        */
  #define USBHSCORE_GLPMCFG_LPMCAP_ENABLED (0x1UL)   /*!< LPM capability is enabled                                            */

/* APPL1RES @Bit 1 : Mode: Device only. LPM response programmed by application (AppL1Res) */
  #define USBHSCORE_GLPMCFG_APPL1RES_Pos (1UL)       /*!< Position of APPL1RES field.                                          */
  #define USBHSCORE_GLPMCFG_APPL1RES_Msk (0x1UL << USBHSCORE_GLPMCFG_APPL1RES_Pos) /*!< Bit mask of APPL1RES field.            */
  #define USBHSCORE_GLPMCFG_APPL1RES_Min (0x0UL)     /*!< Min enumerator value of APPL1RES field.                              */
  #define USBHSCORE_GLPMCFG_APPL1RES_Max (0x1UL)     /*!< Max enumerator value of APPL1RES field.                              */
  #define USBHSCORE_GLPMCFG_APPL1RES_NYET_RESP (0x0UL) /*!< The core responds with a NYET when an error is detected in either of
                                                            the LPM token packets due to corruption*/
  #define USBHSCORE_GLPMCFG_APPL1RES_ACK_RESP (0x1UL) /*!< The core responds with an ACK only on a successful LPM transaction  */

/* HIRD @Bits 2..5 : Host-Initiated Resume Duration (HIRD) */
  #define USBHSCORE_GLPMCFG_HIRD_Pos (2UL)           /*!< Position of HIRD field.                                              */
  #define USBHSCORE_GLPMCFG_HIRD_Msk (0xFUL << USBHSCORE_GLPMCFG_HIRD_Pos) /*!< Bit mask of HIRD field.                        */

/* BREMOTEWAKE @Bit 6 : RemoteWakeEnable (bRemoteWake) */
  #define USBHSCORE_GLPMCFG_BREMOTEWAKE_Pos (6UL)    /*!< Position of BREMOTEWAKE field.                                       */
  #define USBHSCORE_GLPMCFG_BREMOTEWAKE_Msk (0x1UL << USBHSCORE_GLPMCFG_BREMOTEWAKE_Pos) /*!< Bit mask of BREMOTEWAKE field.   */
  #define USBHSCORE_GLPMCFG_BREMOTEWAKE_Min (0x0UL)  /*!< Min enumerator value of BREMOTEWAKE field.                           */
  #define USBHSCORE_GLPMCFG_BREMOTEWAKE_Max (0x1UL)  /*!< Max enumerator value of BREMOTEWAKE field.                           */
  #define USBHSCORE_GLPMCFG_BREMOTEWAKE_DISABLED (0x0UL) /*!< Remote Wakeup is disabled                                        */
  #define USBHSCORE_GLPMCFG_BREMOTEWAKE_ENABLED (0x1UL) /*!< In Host or device mode, this field takes the value of remote wake
                                                             up*/

/* ENBLSLPM @Bit 7 : Enable utmi_sleep_n (EnblSlpM) */
  #define USBHSCORE_GLPMCFG_ENBLSLPM_Pos (7UL)       /*!< Position of ENBLSLPM field.                                          */
  #define USBHSCORE_GLPMCFG_ENBLSLPM_Msk (0x1UL << USBHSCORE_GLPMCFG_ENBLSLPM_Pos) /*!< Bit mask of ENBLSLPM field.            */
  #define USBHSCORE_GLPMCFG_ENBLSLPM_Min (0x0UL)     /*!< Min enumerator value of ENBLSLPM field.                              */
  #define USBHSCORE_GLPMCFG_ENBLSLPM_Max (0x1UL)     /*!< Max enumerator value of ENBLSLPM field.                              */
  #define USBHSCORE_GLPMCFG_ENBLSLPM_DISABLED (0x0UL) /*!< utmi_sleep_n assertion from the core is not transferred to the
                                                           external PHY*/
  #define USBHSCORE_GLPMCFG_ENBLSLPM_ENABLED (0x1UL) /*!< utmi_sleep_n assertion from the core is transferred to the external
                                                          PHY when utmi_l1_suspend_n cannot be asserted*/

/* HIRDTHRES @Bits 8..12 : BESL/HIRD Threshold (HIRD_Thres) */
  #define USBHSCORE_GLPMCFG_HIRDTHRES_Pos (8UL)      /*!< Position of HIRDTHRES field.                                         */
  #define USBHSCORE_GLPMCFG_HIRDTHRES_Msk (0x1FUL << USBHSCORE_GLPMCFG_HIRDTHRES_Pos) /*!< Bit mask of HIRDTHRES field.        */

/* COREL1RES @Bits 13..14 : LPM Response (CoreL1Res) */
  #define USBHSCORE_GLPMCFG_COREL1RES_Pos (13UL)     /*!< Position of COREL1RES field.                                         */
  #define USBHSCORE_GLPMCFG_COREL1RES_Msk (0x3UL << USBHSCORE_GLPMCFG_COREL1RES_Pos) /*!< Bit mask of COREL1RES field.         */
  #define USBHSCORE_GLPMCFG_COREL1RES_Min (0x0UL)    /*!< Min enumerator value of COREL1RES field.                             */
  #define USBHSCORE_GLPMCFG_COREL1RES_Max (0x3UL)    /*!< Max enumerator value of COREL1RES field.                             */
  #define USBHSCORE_GLPMCFG_COREL1RES_LPMRESP1 (0x0UL) /*!< ERROR : No handshake response                                      */
  #define USBHSCORE_GLPMCFG_COREL1RES_LPMRESP2 (0x1UL) /*!< STALL response                                                     */
  #define USBHSCORE_GLPMCFG_COREL1RES_LPMRESP3 (0x2UL) /*!< NYET response                                                      */
  #define USBHSCORE_GLPMCFG_COREL1RES_LPMRESP4 (0x3UL) /*!< ACK response                                                       */

/* SLPSTS @Bit 15 : Port Sleep Status (SlpSts) */
  #define USBHSCORE_GLPMCFG_SLPSTS_Pos (15UL)        /*!< Position of SLPSTS field.                                            */
  #define USBHSCORE_GLPMCFG_SLPSTS_Msk (0x1UL << USBHSCORE_GLPMCFG_SLPSTS_Pos) /*!< Bit mask of SLPSTS field.                  */
  #define USBHSCORE_GLPMCFG_SLPSTS_Min (0x0UL)       /*!< Min enumerator value of SLPSTS field.                                */
  #define USBHSCORE_GLPMCFG_SLPSTS_Max (0x1UL)       /*!< Max enumerator value of SLPSTS field.                                */
  #define USBHSCORE_GLPMCFG_SLPSTS_CORE_NOT_IN_L1 (0x0UL) /*!< In Host or Device mode, this bit indicates core is not in L1    */
  #define USBHSCORE_GLPMCFG_SLPSTS_CORE_IN_L1 (0x1UL) /*!< In Host mode, this bit indicates the core transitions to Sleep state
                                                           as a successful LPM transaction. In Device mode, the core enters the
                                                           Sleep state when an ACK response is sent to an LPM transaction*/

/* L1RESUMEOK @Bit 16 : Sleep State Resume OK (L1ResumeOK) */
  #define USBHSCORE_GLPMCFG_L1RESUMEOK_Pos (16UL)    /*!< Position of L1RESUMEOK field.                                        */
  #define USBHSCORE_GLPMCFG_L1RESUMEOK_Msk (0x1UL << USBHSCORE_GLPMCFG_L1RESUMEOK_Pos) /*!< Bit mask of L1RESUMEOK field.      */
  #define USBHSCORE_GLPMCFG_L1RESUMEOK_Min (0x0UL)   /*!< Min enumerator value of L1RESUMEOK field.                            */
  #define USBHSCORE_GLPMCFG_L1RESUMEOK_Max (0x1UL)   /*!< Max enumerator value of L1RESUMEOK field.                            */
  #define USBHSCORE_GLPMCFG_L1RESUMEOK_NOTOK (0x0UL) /*!< The application/core cannot start Resume from Sleep state            */
  #define USBHSCORE_GLPMCFG_L1RESUMEOK_OK (0x1UL)    /*!< The application/core can start Resume from Sleep state               */

