nrfconnect/sdk-hal_nordic/nrfx/bsp/stable/mdk/nrf54lm20a_enga_types.h
/* FRNUM @Bits 0..15 : Frame Number (FrNum) */
  #define USBHSCORE_HFNUM_FRNUM_Pos (0UL)            /*!< Position of FRNUM field.                                             */
  #define USBHSCORE_HFNUM_FRNUM_Msk (0xFFFFUL << USBHSCORE_HFNUM_FRNUM_Pos) /*!< Bit mask of FRNUM field.                      */
  #define USBHSCORE_HFNUM_FRNUM_Min (0x0000UL)       /*!< Min enumerator value of FRNUM field.                                 */
  #define USBHSCORE_HFNUM_FRNUM_Max (0x0001UL)       /*!< Max enumerator value of FRNUM field.                                 */
  #define USBHSCORE_HFNUM_FRNUM_INACTIVE (0x0000UL)  /*!< No SOF is transmitted                                                */
  #define USBHSCORE_HFNUM_FRNUM_ACTIVE (0x0001UL)    /*!< SOF is transmitted                                                   */

/* FRREM @Bits 16..31 : Frame Time Remaining (FrRem) */
  #define USBHSCORE_HFNUM_FRREM_Pos (16UL)           /*!< Position of FRREM field.                                             */
  #define USBHSCORE_HFNUM_FRREM_Msk (0xFFFFUL << USBHSCORE_HFNUM_FRREM_Pos) /*!< Bit mask of FRREM field.                      */


/* USBHSCORE_HAINT: Host All Channels Interrupt Register */
  #define USBHSCORE_HAINT_ResetValue (0x00000000UL)  /*!< Reset value of HAINT register.                                       */

/* HAINT @Bits 0..15 : (unspecified) */
  #define USBHSCORE_HAINT_HAINT_Pos (0UL)            /*!< Position of HAINT field.                                             */
  #define USBHSCORE_HAINT_HAINT_Msk (0xFFFFUL << USBHSCORE_HAINT_HAINT_Pos) /*!< Bit mask of HAINT field.                      */
  #define USBHSCORE_HAINT_HAINT_Min (0x0000UL)       /*!< Min enumerator value of HAINT field.                                 */
  #define USBHSCORE_HAINT_HAINT_Max (0x0001UL)       /*!< Max enumerator value of HAINT field.                                 */
  #define USBHSCORE_HAINT_HAINT_INACTIVE (0x0000UL)  /*!< Not active                                                           */
  #define USBHSCORE_HAINT_HAINT_ACTIVE (0x0001UL)    /*!< Host Channel Interrupt                                               */


/* USBHSCORE_HAINTMSK: Host All Channels Interrupt Mask Register */
  #define USBHSCORE_HAINTMSK_ResetValue (0x00000000UL) /*!< Reset value of HAINTMSK register.                                  */

/* HAINTMSK @Bits 0..15 : Channel Interrupt Mask (HAINTMsk) */
  #define USBHSCORE_HAINTMSK_HAINTMSK_Pos (0UL)      /*!< Position of HAINTMSK field.                                          */
  #define USBHSCORE_HAINTMSK_HAINTMSK_Msk (0xFFFFUL << USBHSCORE_HAINTMSK_HAINTMSK_Pos) /*!< Bit mask of HAINTMSK field.       */
  #define USBHSCORE_HAINTMSK_HAINTMSK_Min (0x0000UL) /*!< Min enumerator value of HAINTMSK field.                              */
  #define USBHSCORE_HAINTMSK_HAINTMSK_Max (0x0001UL) /*!< Max enumerator value of HAINTMSK field.                              */
  #define USBHSCORE_HAINTMSK_HAINTMSK_UNMASK (0x0000UL) /*!< Unmask Channel interrupt                                          */
  #define USBHSCORE_HAINTMSK_HAINTMSK_MASK (0x0001UL) /*!< Mask Channel interrupt                                              */


/* USBHSCORE_HPRT: Host Port Control and Status Register */
  #define USBHSCORE_HPRT_ResetValue (0x00000000UL)   /*!< Reset value of HPRT register.                                        */

/* PRTCONNSTS @Bit 0 : Port Connect Status (PrtConnSts) */
  #define USBHSCORE_HPRT_PRTCONNSTS_Pos (0UL)        /*!< Position of PRTCONNSTS field.                                        */
  #define USBHSCORE_HPRT_PRTCONNSTS_Msk (0x1UL << USBHSCORE_HPRT_PRTCONNSTS_Pos) /*!< Bit mask of PRTCONNSTS field.            */
  #define USBHSCORE_HPRT_PRTCONNSTS_Min (0x0UL)      /*!< Min enumerator value of PRTCONNSTS field.                            */
  #define USBHSCORE_HPRT_PRTCONNSTS_Max (0x1UL)      /*!< Max enumerator value of PRTCONNSTS field.                            */
  #define USBHSCORE_HPRT_PRTCONNSTS_NOTATTACHED (0x0UL) /*!< No device is attached to the port                                 */
  #define USBHSCORE_HPRT_PRTCONNSTS_ATTACHED (0x1UL) /*!< A device is attached to the port                                     */

/* PRTCONNDET @Bit 1 : Port Connect Detected (PrtConnDet) */
  #define USBHSCORE_HPRT_PRTCONNDET_Pos (1UL)        /*!< Position of PRTCONNDET field.                                        */
  #define USBHSCORE_HPRT_PRTCONNDET_Msk (0x1UL << USBHSCORE_HPRT_PRTCONNDET_Pos) /*!< Bit mask of PRTCONNDET field.            */
  #define USBHSCORE_HPRT_PRTCONNDET_Min (0x0UL)      /*!< Min enumerator value of PRTCONNDET field.                            */
  #define USBHSCORE_HPRT_PRTCONNDET_Max (0x1UL)      /*!< Max enumerator value of PRTCONNDET field.                            */
  #define USBHSCORE_HPRT_PRTCONNDET_INACTIVE (0x0UL) /*!< No device connection detected                                        */
  #define USBHSCORE_HPRT_PRTCONNDET_ACTIVE (0x1UL)   /*!< Device connection detected                                           */

/* PRTENA @Bit 2 : Port Enable (PrtEna) */
  #define USBHSCORE_HPRT_PRTENA_Pos (2UL)            /*!< Position of PRTENA field.                                            */
  #define USBHSCORE_HPRT_PRTENA_Msk (0x1UL << USBHSCORE_HPRT_PRTENA_Pos) /*!< Bit mask of PRTENA field.                        */
  #define USBHSCORE_HPRT_PRTENA_Min (0x0UL)          /*!< Min enumerator value of PRTENA field.                                */
  #define USBHSCORE_HPRT_PRTENA_Max (0x1UL)          /*!< Max enumerator value of PRTENA field.                                */
  #define USBHSCORE_HPRT_PRTENA_DISABLED (0x0UL)     /*!< Port disabled                                                        */
  #define USBHSCORE_HPRT_PRTENA_ENABLED (0x1UL)      /*!< Port enabled                                                         */

/* PRTENCHNG @Bit 3 : Port Enable/Disable Change (PrtEnChng) */
  #define USBHSCORE_HPRT_PRTENCHNG_Pos (3UL)         /*!< Position of PRTENCHNG field.                                         */
  #define USBHSCORE_HPRT_PRTENCHNG_Msk (0x1UL << USBHSCORE_HPRT_PRTENCHNG_Pos) /*!< Bit mask of PRTENCHNG field.               */
  #define USBHSCORE_HPRT_PRTENCHNG_Min (0x0UL)       /*!< Min enumerator value of PRTENCHNG field.                             */
  #define USBHSCORE_HPRT_PRTENCHNG_Max (0x1UL)       /*!< Max enumerator value of PRTENCHNG field.                             */
  #define USBHSCORE_HPRT_PRTENCHNG_INACTIVE (0x0UL)  /*!< Port Enable bit 2 has not changed                                    */
  #define USBHSCORE_HPRT_PRTENCHNG_ACTIVE (0x1UL)    /*!< Port Enable bit 2 changed                                            */

/* PRTOVRCURRACT @Bit 4 : Port Overcurrent Active (PrtOvrCurrAct) */
  #define USBHSCORE_HPRT_PRTOVRCURRACT_Pos (4UL)     /*!< Position of PRTOVRCURRACT field.                                     */
  #define USBHSCORE_HPRT_PRTOVRCURRACT_Msk (0x1UL << USBHSCORE_HPRT_PRTOVRCURRACT_Pos) /*!< Bit mask of PRTOVRCURRACT field.   */
  #define USBHSCORE_HPRT_PRTOVRCURRACT_Min (0x0UL)   /*!< Min enumerator value of PRTOVRCURRACT field.                         */
  #define USBHSCORE_HPRT_PRTOVRCURRACT_Max (0x1UL)   /*!< Max enumerator value of PRTOVRCURRACT field.                         */
  #define USBHSCORE_HPRT_PRTOVRCURRACT_INACTIVE (0x0UL) /*!< No overcurrent condition                                          */
  #define USBHSCORE_HPRT_PRTOVRCURRACT_ACTIVE (0x1UL) /*!< Overcurrent condition                                               */

/* PRTOVRCURRCHNG @Bit 5 : Port Overcurrent Change (PrtOvrCurrChng) */
  #define USBHSCORE_HPRT_PRTOVRCURRCHNG_Pos (5UL)    /*!< Position of PRTOVRCURRCHNG field.                                    */
  #define USBHSCORE_HPRT_PRTOVRCURRCHNG_Msk (0x1UL << USBHSCORE_HPRT_PRTOVRCURRCHNG_Pos) /*!< Bit mask of PRTOVRCURRCHNG field.*/
  #define USBHSCORE_HPRT_PRTOVRCURRCHNG_Min (0x0UL)  /*!< Min enumerator value of PRTOVRCURRCHNG field.                        */
  #define USBHSCORE_HPRT_PRTOVRCURRCHNG_Max (0x1UL)  /*!< Max enumerator value of PRTOVRCURRCHNG field.                        */
  #define USBHSCORE_HPRT_PRTOVRCURRCHNG_INACTIVE (0x0UL) /*!< Status of port overcurrent status is not changed                 */
  #define USBHSCORE_HPRT_PRTOVRCURRCHNG_ACTIVE (0x1UL) /*!< Status of port overcurrent changed                                 */

