nrfconnect/sdk-hal_nordic/nrfx/bsp/stable/mdk/nrf54lm20a_enga_types.h
/* NAKMSK @Bit 13 : NAK interrupt Mask (NAKMsk) */
  #define USBHSCORE_DIEPMSK_NAKMSK_Pos (13UL)        /*!< Position of NAKMSK field.                                            */
  #define USBHSCORE_DIEPMSK_NAKMSK_Msk (0x1UL << USBHSCORE_DIEPMSK_NAKMSK_Pos) /*!< Bit mask of NAKMSK field.                  */
  #define USBHSCORE_DIEPMSK_NAKMSK_Min (0x0UL)       /*!< Min enumerator value of NAKMSK field.                                */
  #define USBHSCORE_DIEPMSK_NAKMSK_Max (0x1UL)       /*!< Max enumerator value of NAKMSK field.                                */
  #define USBHSCORE_DIEPMSK_NAKMSK_MASK (0x0UL)      /*!< Mask NAK Interrupt                                                   */
  #define USBHSCORE_DIEPMSK_NAKMSK_NOMASK (0x1UL)    /*!< No Mask NAK Interrupt                                                */


/* USBHSCORE_DOEPMSK: Device OUT Endpoint Common Interrupt Mask Register */
  #define USBHSCORE_DOEPMSK_ResetValue (0x00000000UL) /*!< Reset value of DOEPMSK register.                                    */

/* XFERCOMPLMSK @Bit 0 : Transfer Completed Interrupt Mask (XferComplMsk) */
  #define USBHSCORE_DOEPMSK_XFERCOMPLMSK_Pos (0UL)   /*!< Position of XFERCOMPLMSK field.                                      */
  #define USBHSCORE_DOEPMSK_XFERCOMPLMSK_Msk (0x1UL << USBHSCORE_DOEPMSK_XFERCOMPLMSK_Pos) /*!< Bit mask of XFERCOMPLMSK field.*/
  #define USBHSCORE_DOEPMSK_XFERCOMPLMSK_Min (0x0UL) /*!< Min enumerator value of XFERCOMPLMSK field.                          */
  #define USBHSCORE_DOEPMSK_XFERCOMPLMSK_Max (0x1UL) /*!< Max enumerator value of XFERCOMPLMSK field.                          */
  #define USBHSCORE_DOEPMSK_XFERCOMPLMSK_MASK (0x0UL) /*!< Mask Transfer Completed Interrupt                                   */
  #define USBHSCORE_DOEPMSK_XFERCOMPLMSK_NOMASK (0x1UL) /*!< No Transfer Completed Interrupt Mask                              */

/* EPDISBLDMSK @Bit 1 : Endpoint Disabled Interrupt Mask (EPDisbldMsk) */
  #define USBHSCORE_DOEPMSK_EPDISBLDMSK_Pos (1UL)    /*!< Position of EPDISBLDMSK field.                                       */
  #define USBHSCORE_DOEPMSK_EPDISBLDMSK_Msk (0x1UL << USBHSCORE_DOEPMSK_EPDISBLDMSK_Pos) /*!< Bit mask of EPDISBLDMSK field.   */
  #define USBHSCORE_DOEPMSK_EPDISBLDMSK_Min (0x0UL)  /*!< Min enumerator value of EPDISBLDMSK field.                           */
  #define USBHSCORE_DOEPMSK_EPDISBLDMSK_Max (0x1UL)  /*!< Max enumerator value of EPDISBLDMSK field.                           */
  #define USBHSCORE_DOEPMSK_EPDISBLDMSK_MASK (0x0UL) /*!< Mask Endpoint Disabled Interrupt                                     */
  #define USBHSCORE_DOEPMSK_EPDISBLDMSK_NOMASK (0x1UL) /*!< No Endpoint Disabled Interrupt Mask                                */

/* AHBERRMSK @Bit 2 : AHB Error (AHBErrMsk) */
  #define USBHSCORE_DOEPMSK_AHBERRMSK_Pos (2UL)      /*!< Position of AHBERRMSK field.                                         */
  #define USBHSCORE_DOEPMSK_AHBERRMSK_Msk (0x1UL << USBHSCORE_DOEPMSK_AHBERRMSK_Pos) /*!< Bit mask of AHBERRMSK field.         */
  #define USBHSCORE_DOEPMSK_AHBERRMSK_Min (0x0UL)    /*!< Min enumerator value of AHBERRMSK field.                             */
  #define USBHSCORE_DOEPMSK_AHBERRMSK_Max (0x1UL)    /*!< Max enumerator value of AHBERRMSK field.                             */
  #define USBHSCORE_DOEPMSK_AHBERRMSK_MASK (0x0UL)   /*!< Mask AHB Error Interrupt                                             */
  #define USBHSCORE_DOEPMSK_AHBERRMSK_NOMASK (0x1UL) /*!< No AHB Error Interrupt Mask                                          */

/* SETUPMSK @Bit 3 : SETUP Phase Done Mask (SetUPMsk) */
  #define USBHSCORE_DOEPMSK_SETUPMSK_Pos (3UL)       /*!< Position of SETUPMSK field.                                          */
  #define USBHSCORE_DOEPMSK_SETUPMSK_Msk (0x1UL << USBHSCORE_DOEPMSK_SETUPMSK_Pos) /*!< Bit mask of SETUPMSK field.            */
  #define USBHSCORE_DOEPMSK_SETUPMSK_Min (0x0UL)     /*!< Min enumerator value of SETUPMSK field.                              */
  #define USBHSCORE_DOEPMSK_SETUPMSK_Max (0x1UL)     /*!< Max enumerator value of SETUPMSK field.                              */
  #define USBHSCORE_DOEPMSK_SETUPMSK_MASK (0x0UL)    /*!< Mask SETUP Phase Done Interrupt                                      */
  #define USBHSCORE_DOEPMSK_SETUPMSK_NOMASK (0x1UL)  /*!< No SETUP Phase Done Interrupt Mask                                   */

/* OUTTKNEPDISMSK @Bit 4 : OUT Token Received when Endpoint Disabled Mask (OUTTknEPdisMsk) */
  #define USBHSCORE_DOEPMSK_OUTTKNEPDISMSK_Pos (4UL) /*!< Position of OUTTKNEPDISMSK field.                                    */
  #define USBHSCORE_DOEPMSK_OUTTKNEPDISMSK_Msk (0x1UL << USBHSCORE_DOEPMSK_OUTTKNEPDISMSK_Pos) /*!< Bit mask of OUTTKNEPDISMSK
                                                                            field.*/
  #define USBHSCORE_DOEPMSK_OUTTKNEPDISMSK_Min (0x0UL) /*!< Min enumerator value of OUTTKNEPDISMSK field.                      */
  #define USBHSCORE_DOEPMSK_OUTTKNEPDISMSK_Max (0x1UL) /*!< Max enumerator value of OUTTKNEPDISMSK field.                      */
  #define USBHSCORE_DOEPMSK_OUTTKNEPDISMSK_MASK (0x0UL) /*!< Mask OUT Token Received when Endpoint Disabled Interrupt          */
  #define USBHSCORE_DOEPMSK_OUTTKNEPDISMSK_NOMASK (0x1UL) /*!< No OUT Token Received when Endpoint Disabled Interrupt Mask     */

/* STSPHSERCVDMSK @Bit 5 : Status Phase Received Mask (StsPhseRcvdMsk) */
  #define USBHSCORE_DOEPMSK_STSPHSERCVDMSK_Pos (5UL) /*!< Position of STSPHSERCVDMSK field.                                    */
  #define USBHSCORE_DOEPMSK_STSPHSERCVDMSK_Msk (0x1UL << USBHSCORE_DOEPMSK_STSPHSERCVDMSK_Pos) /*!< Bit mask of STSPHSERCVDMSK
                                                                            field.*/
  #define USBHSCORE_DOEPMSK_STSPHSERCVDMSK_Min (0x0UL) /*!< Min enumerator value of STSPHSERCVDMSK field.                      */
  #define USBHSCORE_DOEPMSK_STSPHSERCVDMSK_Max (0x1UL) /*!< Max enumerator value of STSPHSERCVDMSK field.                      */
  #define USBHSCORE_DOEPMSK_STSPHSERCVDMSK_MASK (0x0UL) /*!< Status Phase Received Mask                                        */
  #define USBHSCORE_DOEPMSK_STSPHSERCVDMSK_NOMASK (0x1UL) /*!< No Status Phase Received Mask                                   */

/* BACK2BACKSETUP @Bit 6 : Back-to-Back SETUP Packets Received Mask (Back2BackSETup) */
  #define USBHSCORE_DOEPMSK_BACK2BACKSETUP_Pos (6UL) /*!< Position of BACK2BACKSETUP field.                                    */
  #define USBHSCORE_DOEPMSK_BACK2BACKSETUP_Msk (0x1UL << USBHSCORE_DOEPMSK_BACK2BACKSETUP_Pos) /*!< Bit mask of BACK2BACKSETUP
                                                                            field.*/
  #define USBHSCORE_DOEPMSK_BACK2BACKSETUP_Min (0x0UL) /*!< Min enumerator value of BACK2BACKSETUP field.                      */
  #define USBHSCORE_DOEPMSK_BACK2BACKSETUP_Max (0x1UL) /*!< Max enumerator value of BACK2BACKSETUP field.                      */
  #define USBHSCORE_DOEPMSK_BACK2BACKSETUP_MASK (0x0UL) /*!< Mask Back-to-Back SETUP Packets Received Interrupt                */
  #define USBHSCORE_DOEPMSK_BACK2BACKSETUP_NOMASK (0x1UL) /*!< No Back-to-Back SETUP Packets Received Interrupt Mask           */

/* OUTPKTERRMSK @Bit 8 : OUT Packet Error Mask (OutPktErrMsk) */
  #define USBHSCORE_DOEPMSK_OUTPKTERRMSK_Pos (8UL)   /*!< Position of OUTPKTERRMSK field.                                      */
  #define USBHSCORE_DOEPMSK_OUTPKTERRMSK_Msk (0x1UL << USBHSCORE_DOEPMSK_OUTPKTERRMSK_Pos) /*!< Bit mask of OUTPKTERRMSK field.*/
  #define USBHSCORE_DOEPMSK_OUTPKTERRMSK_Min (0x0UL) /*!< Min enumerator value of OUTPKTERRMSK field.                          */
  #define USBHSCORE_DOEPMSK_OUTPKTERRMSK_Max (0x1UL) /*!< Max enumerator value of OUTPKTERRMSK field.                          */
  #define USBHSCORE_DOEPMSK_OUTPKTERRMSK_MASK (0x0UL) /*!< Mask OUT Packet Error Interrupt                                     */
  #define USBHSCORE_DOEPMSK_OUTPKTERRMSK_NOMASK (0x1UL) /*!< No OUT Packet Error Interrupt Mask                                */

/* BBLEERRMSK @Bit 12 : Babble Error interrupt Mask (BbleErrMsk) */
  #define USBHSCORE_DOEPMSK_BBLEERRMSK_Pos (12UL)    /*!< Position of BBLEERRMSK field.                                        */
  #define USBHSCORE_DOEPMSK_BBLEERRMSK_Msk (0x1UL << USBHSCORE_DOEPMSK_BBLEERRMSK_Pos) /*!< Bit mask of BBLEERRMSK field.      */
  #define USBHSCORE_DOEPMSK_BBLEERRMSK_Min (0x0UL)   /*!< Min enumerator value of BBLEERRMSK field.                            */
  #define USBHSCORE_DOEPMSK_BBLEERRMSK_Max (0x1UL)   /*!< Max enumerator value of BBLEERRMSK field.                            */
  #define USBHSCORE_DOEPMSK_BBLEERRMSK_MASK (0x0UL)  /*!< Mask Babble Error Interrupt                                          */
  #define USBHSCORE_DOEPMSK_BBLEERRMSK_NOMASK (0x1UL) /*!< No Babble Error Interrupt Mask                                      */

