nrfconnect/sdk-hal_nordic/nrfx/bsp/stable/mdk/nrf54lm20a_enga_types.h
/* USBHSCORE_DOEPDMA15: Device OUT Endpoint DMA Address Register */
  #define USBHSCORE_DOEPDMA15_ResetValue (0x00000000UL) /*!< Reset value of DOEPDMA15 register.                                */

/* DMAADDR @Bits 0..31 : Holds the start address of the external memory for storing or fetching endpoint */
  #define USBHSCORE_DOEPDMA15_DMAADDR_Pos (0UL)      /*!< Position of DMAADDR field.                                           */
  #define USBHSCORE_DOEPDMA15_DMAADDR_Msk (0xFFFFFFFFUL << USBHSCORE_DOEPDMA15_DMAADDR_Pos) /*!< Bit mask of DMAADDR field.    */


/* USBHSCORE_PCGCCTL: Power and Clock Gating Control Register */
  #define USBHSCORE_PCGCCTL_ResetValue (0x880A0000UL) /*!< Reset value of PCGCCTL register.                                    */

/* STOPPCLK @Bit 0 : Stop Pclk (StopPclk) */
  #define USBHSCORE_PCGCCTL_STOPPCLK_Pos (0UL)       /*!< Position of STOPPCLK field.                                          */
  #define USBHSCORE_PCGCCTL_STOPPCLK_Msk (0x1UL << USBHSCORE_PCGCCTL_STOPPCLK_Pos) /*!< Bit mask of STOPPCLK field.            */
  #define USBHSCORE_PCGCCTL_STOPPCLK_Min (0x0UL)     /*!< Min enumerator value of STOPPCLK field.                              */
  #define USBHSCORE_PCGCCTL_STOPPCLK_Max (0x1UL)     /*!< Max enumerator value of STOPPCLK field.                              */
  #define USBHSCORE_PCGCCTL_STOPPCLK_DISABLED (0x0UL) /*!< Disable Stop Pclk                                                   */
  #define USBHSCORE_PCGCCTL_STOPPCLK_ENABLED (0x1UL) /*!< Enable Stop Pclk                                                     */

/* GATEHCLK @Bit 1 : Gate Hclk (GateHclk) */
  #define USBHSCORE_PCGCCTL_GATEHCLK_Pos (1UL)       /*!< Position of GATEHCLK field.                                          */
  #define USBHSCORE_PCGCCTL_GATEHCLK_Msk (0x1UL << USBHSCORE_PCGCCTL_GATEHCLK_Pos) /*!< Bit mask of GATEHCLK field.            */
  #define USBHSCORE_PCGCCTL_GATEHCLK_Min (0x0UL)     /*!< Min enumerator value of GATEHCLK field.                              */
  #define USBHSCORE_PCGCCTL_GATEHCLK_Max (0x1UL)     /*!< Max enumerator value of GATEHCLK field.                              */
  #define USBHSCORE_PCGCCTL_GATEHCLK_DISABLED (0x0UL) /*!< Clears this bit when the USB is resumed or a new session starts     */
  #define USBHSCORE_PCGCCTL_GATEHCLK_ENABLED (0x1UL) /*!< Sets this bit to gate hclk to modules when the USB is suspended or the
                                                          session is not valid*/

/* RSTPDWNMODULE @Bit 3 : Reset Power-Down Modules (RstPdwnModule) */
  #define USBHSCORE_PCGCCTL_RSTPDWNMODULE_Pos (3UL)  /*!< Position of RSTPDWNMODULE field.                                     */
  #define USBHSCORE_PCGCCTL_RSTPDWNMODULE_Msk (0x1UL << USBHSCORE_PCGCCTL_RSTPDWNMODULE_Pos) /*!< Bit mask of RSTPDWNMODULE
                                                                            field.*/
  #define USBHSCORE_PCGCCTL_RSTPDWNMODULE_Min (0x0UL) /*!< Min enumerator value of RSTPDWNMODULE field.                        */
  #define USBHSCORE_PCGCCTL_RSTPDWNMODULE_Max (0x1UL) /*!< Max enumerator value of RSTPDWNMODULE field.                        */
  #define USBHSCORE_PCGCCTL_RSTPDWNMODULE_ON (0x0UL) /*!< Power is turned on                                                   */
  #define USBHSCORE_PCGCCTL_RSTPDWNMODULE_OFF (0x1UL) /*!< Power is turned off                                                 */

/* ENBLL1GATING @Bit 5 : Enable Sleep Clock Gating */
  #define USBHSCORE_PCGCCTL_ENBLL1GATING_Pos (5UL)   /*!< Position of ENBLL1GATING field.                                      */
  #define USBHSCORE_PCGCCTL_ENBLL1GATING_Msk (0x1UL << USBHSCORE_PCGCCTL_ENBLL1GATING_Pos) /*!< Bit mask of ENBLL1GATING field.*/
  #define USBHSCORE_PCGCCTL_ENBLL1GATING_Min (0x0UL) /*!< Min enumerator value of ENBLL1GATING field.                          */
  #define USBHSCORE_PCGCCTL_ENBLL1GATING_Max (0x1UL) /*!< Max enumerator value of ENBLL1GATING field.                          */
  #define USBHSCORE_PCGCCTL_ENBLL1GATING_DISABLED (0x0UL) /*!< The PHY clock is not gated in Sleep state                       */
  #define USBHSCORE_PCGCCTL_ENBLL1GATING_ENABLED (0x1UL) /*!< The Core internal clock gating is enabled in Sleep state         */

/* PHYSLEEP @Bit 6 : PHY In Sleep */
  #define USBHSCORE_PCGCCTL_PHYSLEEP_Pos (6UL)       /*!< Position of PHYSLEEP field.                                          */
  #define USBHSCORE_PCGCCTL_PHYSLEEP_Msk (0x1UL << USBHSCORE_PCGCCTL_PHYSLEEP_Pos) /*!< Bit mask of PHYSLEEP field.            */
  #define USBHSCORE_PCGCCTL_PHYSLEEP_Min (0x0UL)     /*!< Min enumerator value of PHYSLEEP field.                              */
  #define USBHSCORE_PCGCCTL_PHYSLEEP_Max (0x1UL)     /*!< Max enumerator value of PHYSLEEP field.                              */
  #define USBHSCORE_PCGCCTL_PHYSLEEP_INACTIVE (0x0UL) /*!< Phy not in Sleep state                                              */
  #define USBHSCORE_PCGCCTL_PHYSLEEP_ACTIVE (0x1UL)  /*!< Phy in Sleep state                                                   */

/* L1SUSPENDED @Bit 7 : L1 Deep Sleep */
  #define USBHSCORE_PCGCCTL_L1SUSPENDED_Pos (7UL)    /*!< Position of L1SUSPENDED field.                                       */
  #define USBHSCORE_PCGCCTL_L1SUSPENDED_Msk (0x1UL << USBHSCORE_PCGCCTL_L1SUSPENDED_Pos) /*!< Bit mask of L1SUSPENDED field.   */
  #define USBHSCORE_PCGCCTL_L1SUSPENDED_Min (0x0UL)  /*!< Min enumerator value of L1SUSPENDED field.                           */
  #define USBHSCORE_PCGCCTL_L1SUSPENDED_Max (0x1UL)  /*!< Max enumerator value of L1SUSPENDED field.                           */
  #define USBHSCORE_PCGCCTL_L1SUSPENDED_INACTIVE (0x0UL) /*!< Non Deep Sleep                                                   */
  #define USBHSCORE_PCGCCTL_L1SUSPENDED_ACTIVE (0x1UL) /*!< Deep Sleep                                                         */

/* RESTOREMODE @Bit 9 : Restore Mode (RestoreMode) */
  #define USBHSCORE_PCGCCTL_RESTOREMODE_Pos (9UL)    /*!< Position of RESTOREMODE field.                                       */
  #define USBHSCORE_PCGCCTL_RESTOREMODE_Msk (0x1UL << USBHSCORE_PCGCCTL_RESTOREMODE_Pos) /*!< Bit mask of RESTOREMODE field.   */
  #define USBHSCORE_PCGCCTL_RESTOREMODE_Min (0x0UL)  /*!< Min enumerator value of RESTOREMODE field.                           */
  #define USBHSCORE_PCGCCTL_RESTOREMODE_Max (0x1UL)  /*!< Max enumerator value of RESTOREMODE field.                           */
  #define USBHSCORE_PCGCCTL_RESTOREMODE_DISABLED (0x0UL) /*!< In Host mode,this bit indicates Host-initiated Resume and Reset.
                                                              In Device mode, this bit indicates Device-initiated Remote Wakeup*/
  #define USBHSCORE_PCGCCTL_RESTOREMODE_ENABLED (0x1UL) /*!< In Host mode,this bit indicates Device-initiated Remote Wakeup. In
                                                             Device mode, this bit indicates Host-initiated Resume and Reset*/

