nrfconnect/sdk-hal_nordic/nrfx/bsp/stable/mdk/nrf54lm20a_enga_types.h
/* EVENTS26 @Bit 26 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS26_Pos (26UL)   /*!< Position of EVENTS26 field.                                          */
  #define VPRCSR_NORDIC_EVENTS_EVENTS26_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS26_Pos) /*!< Bit mask of EVENTS26 field.      */
  #define VPRCSR_NORDIC_EVENTS_EVENTS26_Min (0x0UL)  /*!< Min enumerator value of EVENTS26 field.                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS26_Max (0x1UL)  /*!< Max enumerator value of EVENTS26 field.                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS26_Disabled (0x0UL) /*!< EVENTS[26] disabled                                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS26_Enabled (0x1UL) /*!< EVENTS[26] enabled                                                */

/* EVENTS27 @Bit 27 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS27_Pos (27UL)   /*!< Position of EVENTS27 field.                                          */
  #define VPRCSR_NORDIC_EVENTS_EVENTS27_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS27_Pos) /*!< Bit mask of EVENTS27 field.      */
  #define VPRCSR_NORDIC_EVENTS_EVENTS27_Min (0x0UL)  /*!< Min enumerator value of EVENTS27 field.                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS27_Max (0x1UL)  /*!< Max enumerator value of EVENTS27 field.                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS27_Disabled (0x0UL) /*!< EVENTS[27] disabled                                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS27_Enabled (0x1UL) /*!< EVENTS[27] enabled                                                */

/* EVENTS28 @Bit 28 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS28_Pos (28UL)   /*!< Position of EVENTS28 field.                                          */
  #define VPRCSR_NORDIC_EVENTS_EVENTS28_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS28_Pos) /*!< Bit mask of EVENTS28 field.      */
  #define VPRCSR_NORDIC_EVENTS_EVENTS28_Min (0x0UL)  /*!< Min enumerator value of EVENTS28 field.                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS28_Max (0x1UL)  /*!< Max enumerator value of EVENTS28 field.                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS28_Disabled (0x0UL) /*!< EVENTS[28] disabled                                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS28_Enabled (0x1UL) /*!< EVENTS[28] enabled                                                */

/* EVENTS29 @Bit 29 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS29_Pos (29UL)   /*!< Position of EVENTS29 field.                                          */
  #define VPRCSR_NORDIC_EVENTS_EVENTS29_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS29_Pos) /*!< Bit mask of EVENTS29 field.      */
  #define VPRCSR_NORDIC_EVENTS_EVENTS29_Min (0x0UL)  /*!< Min enumerator value of EVENTS29 field.                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS29_Max (0x1UL)  /*!< Max enumerator value of EVENTS29 field.                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS29_Disabled (0x0UL) /*!< EVENTS[29] disabled                                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS29_Enabled (0x1UL) /*!< EVENTS[29] enabled                                                */

/* EVENTS30 @Bit 30 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS30_Pos (30UL)   /*!< Position of EVENTS30 field.                                          */
  #define VPRCSR_NORDIC_EVENTS_EVENTS30_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS30_Pos) /*!< Bit mask of EVENTS30 field.      */
  #define VPRCSR_NORDIC_EVENTS_EVENTS30_Min (0x0UL)  /*!< Min enumerator value of EVENTS30 field.                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS30_Max (0x1UL)  /*!< Max enumerator value of EVENTS30 field.                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS30_Disabled (0x0UL) /*!< EVENTS[30] disabled                                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS30_Enabled (0x1UL) /*!< EVENTS[30] enabled                                                */

/* EVENTS31 @Bit 31 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS31_Pos (31UL)   /*!< Position of EVENTS31 field.                                          */
  #define VPRCSR_NORDIC_EVENTS_EVENTS31_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS31_Pos) /*!< Bit mask of EVENTS31 field.      */
  #define VPRCSR_NORDIC_EVENTS_EVENTS31_Min (0x0UL)  /*!< Min enumerator value of EVENTS31 field.                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS31_Max (0x1UL)  /*!< Max enumerator value of EVENTS31 field.                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS31_Disabled (0x0UL) /*!< EVENTS[31] disabled                                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS31_Enabled (0x1UL) /*!< EVENTS[31] enabled                                                */


/**
  * @brief PUBLISH [VPRCSR_NORDIC_PUBLISH] Enable Event Publication
  */
  #define VPRCSR_NORDIC_PUBLISH (0x000007E3ul)
  #define VPRCSR_NORDIC_PUBLISH_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH register.                                */

/* PUBLISH16 @Bit 16 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH16_Pos (16UL) /*!< Position of PUBLISH16 field.                                         */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH16_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH16_Pos) /*!< Bit mask of PUBLISH16 field. */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH16_Min (0x0UL) /*!< Min enumerator value of PUBLISH16 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH16_Max (0x1UL) /*!< Max enumerator value of PUBLISH16 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH16_Disabled (0x0UL) /*!< Publish disabled for EVENTS[16]                                */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH16_Enabled (0x1UL) /*!< Publish enabled for EVENTS[16]                                  */

/* PUBLISH17 @Bit 17 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH17_Pos (17UL) /*!< Position of PUBLISH17 field.                                         */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH17_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH17_Pos) /*!< Bit mask of PUBLISH17 field. */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH17_Min (0x0UL) /*!< Min enumerator value of PUBLISH17 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH17_Max (0x1UL) /*!< Max enumerator value of PUBLISH17 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH17_Disabled (0x0UL) /*!< Publish disabled for EVENTS[17]                                */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH17_Enabled (0x1UL) /*!< Publish enabled for EVENTS[17]                                  */

