nrfconnect/sdk-hal_nordic/nrfx/bsp/stable/mdk/nrf54lm20a_enga_types.h
/* INTEN6 @Bit 6 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN6_Pos (6UL)       /*!< Position of INTEN6 field.                                            */
  #define VPRCSR_NORDIC_INTEN_INTEN6_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN6_Pos) /*!< Bit mask of INTEN6 field.              */
  #define VPRCSR_NORDIC_INTEN_INTEN6_Min (0x0UL)     /*!< Min enumerator value of INTEN6 field.                                */
  #define VPRCSR_NORDIC_INTEN_INTEN6_Max (0x1UL)     /*!< Max enumerator value of INTEN6 field.                                */
  #define VPRCSR_NORDIC_INTEN_INTEN6_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[6]                                    */
  #define VPRCSR_NORDIC_INTEN_INTEN6_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[6]                                      */

/* INTEN7 @Bit 7 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN7_Pos (7UL)       /*!< Position of INTEN7 field.                                            */
  #define VPRCSR_NORDIC_INTEN_INTEN7_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN7_Pos) /*!< Bit mask of INTEN7 field.              */
  #define VPRCSR_NORDIC_INTEN_INTEN7_Min (0x0UL)     /*!< Min enumerator value of INTEN7 field.                                */
  #define VPRCSR_NORDIC_INTEN_INTEN7_Max (0x1UL)     /*!< Max enumerator value of INTEN7 field.                                */
  #define VPRCSR_NORDIC_INTEN_INTEN7_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[7]                                    */
  #define VPRCSR_NORDIC_INTEN_INTEN7_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[7]                                      */

/* INTEN8 @Bit 8 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN8_Pos (8UL)       /*!< Position of INTEN8 field.                                            */
  #define VPRCSR_NORDIC_INTEN_INTEN8_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN8_Pos) /*!< Bit mask of INTEN8 field.              */
  #define VPRCSR_NORDIC_INTEN_INTEN8_Min (0x0UL)     /*!< Min enumerator value of INTEN8 field.                                */
  #define VPRCSR_NORDIC_INTEN_INTEN8_Max (0x1UL)     /*!< Max enumerator value of INTEN8 field.                                */
  #define VPRCSR_NORDIC_INTEN_INTEN8_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[8]                                    */
  #define VPRCSR_NORDIC_INTEN_INTEN8_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[8]                                      */

/* INTEN9 @Bit 9 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN9_Pos (9UL)       /*!< Position of INTEN9 field.                                            */
  #define VPRCSR_NORDIC_INTEN_INTEN9_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN9_Pos) /*!< Bit mask of INTEN9 field.              */
  #define VPRCSR_NORDIC_INTEN_INTEN9_Min (0x0UL)     /*!< Min enumerator value of INTEN9 field.                                */
  #define VPRCSR_NORDIC_INTEN_INTEN9_Max (0x1UL)     /*!< Max enumerator value of INTEN9 field.                                */
  #define VPRCSR_NORDIC_INTEN_INTEN9_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[9]                                    */
  #define VPRCSR_NORDIC_INTEN_INTEN9_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[9]                                      */

/* INTEN10 @Bit 10 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN10_Pos (10UL)     /*!< Position of INTEN10 field.                                           */
  #define VPRCSR_NORDIC_INTEN_INTEN10_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN10_Pos) /*!< Bit mask of INTEN10 field.           */
  #define VPRCSR_NORDIC_INTEN_INTEN10_Min (0x0UL)    /*!< Min enumerator value of INTEN10 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN10_Max (0x1UL)    /*!< Max enumerator value of INTEN10 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN10_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[10]                                  */
  #define VPRCSR_NORDIC_INTEN_INTEN10_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[10]                                    */

/* INTEN11 @Bit 11 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN11_Pos (11UL)     /*!< Position of INTEN11 field.                                           */
  #define VPRCSR_NORDIC_INTEN_INTEN11_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN11_Pos) /*!< Bit mask of INTEN11 field.           */
  #define VPRCSR_NORDIC_INTEN_INTEN11_Min (0x0UL)    /*!< Min enumerator value of INTEN11 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN11_Max (0x1UL)    /*!< Max enumerator value of INTEN11 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN11_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[11]                                  */
  #define VPRCSR_NORDIC_INTEN_INTEN11_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[11]                                    */

/* INTEN12 @Bit 12 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN12_Pos (12UL)     /*!< Position of INTEN12 field.                                           */
  #define VPRCSR_NORDIC_INTEN_INTEN12_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN12_Pos) /*!< Bit mask of INTEN12 field.           */
  #define VPRCSR_NORDIC_INTEN_INTEN12_Min (0x0UL)    /*!< Min enumerator value of INTEN12 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN12_Max (0x1UL)    /*!< Max enumerator value of INTEN12 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN12_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[12]                                  */
  #define VPRCSR_NORDIC_INTEN_INTEN12_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[12]                                    */

/* INTEN13 @Bit 13 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN13_Pos (13UL)     /*!< Position of INTEN13 field.                                           */
  #define VPRCSR_NORDIC_INTEN_INTEN13_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN13_Pos) /*!< Bit mask of INTEN13 field.           */
  #define VPRCSR_NORDIC_INTEN_INTEN13_Min (0x0UL)    /*!< Min enumerator value of INTEN13 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN13_Max (0x1UL)    /*!< Max enumerator value of INTEN13 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN13_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[13]                                  */
  #define VPRCSR_NORDIC_INTEN_INTEN13_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[13]                                    */

/* INTEN14 @Bit 14 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN14_Pos (14UL)     /*!< Position of INTEN14 field.                                           */
  #define VPRCSR_NORDIC_INTEN_INTEN14_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN14_Pos) /*!< Bit mask of INTEN14 field.           */
  #define VPRCSR_NORDIC_INTEN_INTEN14_Min (0x0UL)    /*!< Min enumerator value of INTEN14 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN14_Max (0x1UL)    /*!< Max enumerator value of INTEN14 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN14_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[14]                                  */
  #define VPRCSR_NORDIC_INTEN_INTEN14_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[14]                                    */

/* INTEN15 @Bit 15 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN15_Pos (15UL)     /*!< Position of INTEN15 field.                                           */
  #define VPRCSR_NORDIC_INTEN_INTEN15_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN15_Pos) /*!< Bit mask of INTEN15 field.           */
  #define VPRCSR_NORDIC_INTEN_INTEN15_Min (0x0UL)    /*!< Min enumerator value of INTEN15 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN15_Max (0x1UL)    /*!< Max enumerator value of INTEN15 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN15_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[15]                                  */
  #define VPRCSR_NORDIC_INTEN_INTEN15_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[15]                                    */

/* INTEN16 @Bit 16 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN16_Pos (16UL)     /*!< Position of INTEN16 field.                                           */
  #define VPRCSR_NORDIC_INTEN_INTEN16_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN16_Pos) /*!< Bit mask of INTEN16 field.           */
  #define VPRCSR_NORDIC_INTEN_INTEN16_Min (0x0UL)    /*!< Min enumerator value of INTEN16 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN16_Max (0x1UL)    /*!< Max enumerator value of INTEN16 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN16_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[16]                                  */
  #define VPRCSR_NORDIC_INTEN_INTEN16_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[16]                                    */

