nrfconnect/sdk-hal_nordic/nrfx/bsp/stable/mdk/nrf54lm20a_enga_types.h
/* EVENTSB30 @Bit 30 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB30_Pos (30UL) /*!< Position of EVENTSB30 field.                                         */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB30_Msk (0x1UL << VPRCSR_NORDIC_EVENTSB_EVENTSB30_Pos) /*!< Bit mask of EVENTSB30 field. */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB30_Min (0x0UL) /*!< Min enumerator value of EVENTSB30 field.                            */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB30_Max (0x1UL) /*!< Max enumerator value of EVENTSB30 field.                            */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB30_Disabled (0x0UL) /*!< EVENTSB[30] disabled                                           */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB30_Enabled (0x1UL) /*!< EVENTSB[30] enabled                                             */

/* EVENTSB31 @Bit 31 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB31_Pos (31UL) /*!< Position of EVENTSB31 field.                                         */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB31_Msk (0x1UL << VPRCSR_NORDIC_EVENTSB_EVENTSB31_Pos) /*!< Bit mask of EVENTSB31 field. */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB31_Min (0x0UL) /*!< Min enumerator value of EVENTSB31 field.                            */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB31_Max (0x1UL) /*!< Max enumerator value of EVENTSB31 field.                            */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB31_Disabled (0x0UL) /*!< EVENTSB[31] disabled                                           */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB31_Enabled (0x1UL) /*!< EVENTSB[31] enabled                                             */


/**
  * @brief EVENTSBS [VPRCSR_NORDIC_EVENTSBS] EVENTSB Dirty Status
  */
  #define VPRCSR_NORDIC_EVENTSBS (0x000007E6ul)
  #define VPRCSR_NORDIC_EVENTSBS_ResetValue (0x00000000UL) /*!< Reset value of EVENTSBS register.                              */

/* EVENTSB @Bits 0..31 : Write to EVENTSB (if not dirty) */
  #define VPRCSR_NORDIC_EVENTSBS_EVENTSB_Pos (0UL)   /*!< Position of EVENTSB field.                                           */
  #define VPRCSR_NORDIC_EVENTSBS_EVENTSB_Msk (0xFFFFFFFFUL << VPRCSR_NORDIC_EVENTSBS_EVENTSB_Pos) /*!< Bit mask of EVENTSB
                                                                            field.*/

/* DIRTYBIT @Bit 0 : Read EVENTSB Dirty status */
  #define VPRCSR_NORDIC_EVENTSBS_DIRTYBIT_Pos (0UL)  /*!< Position of DIRTYBIT field.                                          */
  #define VPRCSR_NORDIC_EVENTSBS_DIRTYBIT_Msk (0x1UL << VPRCSR_NORDIC_EVENTSBS_DIRTYBIT_Pos) /*!< Bit mask of DIRTYBIT field.  */
  #define VPRCSR_NORDIC_EVENTSBS_DIRTYBIT_Min (0x0UL) /*!< Min enumerator value of DIRTYBIT field.                             */
  #define VPRCSR_NORDIC_EVENTSBS_DIRTYBIT_Max (0x1UL) /*!< Max enumerator value of DIRTYBIT field.                             */
  #define VPRCSR_NORDIC_EVENTSBS_DIRTYBIT_CLEAN (0x0UL) /*!< Buffer is clean                                                   */
  #define VPRCSR_NORDIC_EVENTSBS_DIRTYBIT_DIRTY (0x1UL) /*!< Buffer is dirty                                                   */


/**
  * @brief OUT [VPRCSR_NORDIC_OUT] GPIO Output value. Real Time Peripherals VIO.
  */
  #define VPRCSR_NORDIC_OUT (0x00000BC0ul)
  #define VPRCSR_NORDIC_OUT_ResetValue (0x00000000UL) /*!< Reset value of OUT register.                                        */

/* PIN0 @Bit 0 : (unspecified) */
  #define VPRCSR_NORDIC_OUT_PIN0_Pos (0UL)           /*!< Position of PIN0 field.                                              */
  #define VPRCSR_NORDIC_OUT_PIN0_Msk (0x1UL << VPRCSR_NORDIC_OUT_PIN0_Pos) /*!< Bit mask of PIN0 field.                        */
  #define VPRCSR_NORDIC_OUT_PIN0_Min (0x0UL)         /*!< Min enumerator value of PIN0 field.                                  */
  #define VPRCSR_NORDIC_OUT_PIN0_Max (0x1UL)         /*!< Max enumerator value of PIN0 field.                                  */
  #define VPRCSR_NORDIC_OUT_PIN0_LOW (0x0UL)         /*!< Pin driver is low                                                    */
  #define VPRCSR_NORDIC_OUT_PIN0_HIGH (0x1UL)        /*!< Pin driver is high                                                   */

/* PIN1 @Bit 1 : (unspecified) */
  #define VPRCSR_NORDIC_OUT_PIN1_Pos (1UL)           /*!< Position of PIN1 field.                                              */
  #define VPRCSR_NORDIC_OUT_PIN1_Msk (0x1UL << VPRCSR_NORDIC_OUT_PIN1_Pos) /*!< Bit mask of PIN1 field.                        */
  #define VPRCSR_NORDIC_OUT_PIN1_Min (0x0UL)         /*!< Min enumerator value of PIN1 field.                                  */
  #define VPRCSR_NORDIC_OUT_PIN1_Max (0x1UL)         /*!< Max enumerator value of PIN1 field.                                  */
  #define VPRCSR_NORDIC_OUT_PIN1_LOW (0x0UL)         /*!< Pin driver is low                                                    */
  #define VPRCSR_NORDIC_OUT_PIN1_HIGH (0x1UL)        /*!< Pin driver is high                                                   */

/* PIN2 @Bit 2 : (unspecified) */
  #define VPRCSR_NORDIC_OUT_PIN2_Pos (2UL)           /*!< Position of PIN2 field.                                              */
  #define VPRCSR_NORDIC_OUT_PIN2_Msk (0x1UL << VPRCSR_NORDIC_OUT_PIN2_Pos) /*!< Bit mask of PIN2 field.                        */
  #define VPRCSR_NORDIC_OUT_PIN2_Min (0x0UL)         /*!< Min enumerator value of PIN2 field.                                  */
  #define VPRCSR_NORDIC_OUT_PIN2_Max (0x1UL)         /*!< Max enumerator value of PIN2 field.                                  */
  #define VPRCSR_NORDIC_OUT_PIN2_LOW (0x0UL)         /*!< Pin driver is low                                                    */
  #define VPRCSR_NORDIC_OUT_PIN2_HIGH (0x1UL)        /*!< Pin driver is high                                                   */

/* PIN3 @Bit 3 : (unspecified) */
  #define VPRCSR_NORDIC_OUT_PIN3_Pos (3UL)           /*!< Position of PIN3 field.                                              */
  #define VPRCSR_NORDIC_OUT_PIN3_Msk (0x1UL << VPRCSR_NORDIC_OUT_PIN3_Pos) /*!< Bit mask of PIN3 field.                        */
  #define VPRCSR_NORDIC_OUT_PIN3_Min (0x0UL)         /*!< Min enumerator value of PIN3 field.                                  */
  #define VPRCSR_NORDIC_OUT_PIN3_Max (0x1UL)         /*!< Max enumerator value of PIN3 field.                                  */
  #define VPRCSR_NORDIC_OUT_PIN3_LOW (0x0UL)         /*!< Pin driver is low                                                    */
  #define VPRCSR_NORDIC_OUT_PIN3_HIGH (0x1UL)        /*!< Pin driver is high                                                   */

