nrfconnect/sdk-hal_nordic/nrfx/bsp/stable/mdk/nrf54lm20a_enga_types.h
/* PIN17 @Bit 17 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN17_Pos (17UL)         /*!< Position of PIN17 field.                                             */
  #define VPRCSR_NORDIC_INB_PIN17_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN17_Pos) /*!< Bit mask of PIN17 field.                     */
  #define VPRCSR_NORDIC_INB_PIN17_Min (0x0UL)        /*!< Min enumerator value of PIN17 field.                                 */
  #define VPRCSR_NORDIC_INB_PIN17_Max (0x1UL)        /*!< Max enumerator value of PIN17 field.                                 */
  #define VPRCSR_NORDIC_INB_PIN17_LOW (0x0UL)        /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_INB_PIN17_HIGH (0x1UL)       /*!< Pin is High                                                          */

/* PIN18 @Bit 18 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN18_Pos (18UL)         /*!< Position of PIN18 field.                                             */
  #define VPRCSR_NORDIC_INB_PIN18_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN18_Pos) /*!< Bit mask of PIN18 field.                     */
  #define VPRCSR_NORDIC_INB_PIN18_Min (0x0UL)        /*!< Min enumerator value of PIN18 field.                                 */
  #define VPRCSR_NORDIC_INB_PIN18_Max (0x1UL)        /*!< Max enumerator value of PIN18 field.                                 */
  #define VPRCSR_NORDIC_INB_PIN18_LOW (0x0UL)        /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_INB_PIN18_HIGH (0x1UL)       /*!< Pin is High                                                          */

/* PIN19 @Bit 19 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN19_Pos (19UL)         /*!< Position of PIN19 field.                                             */
  #define VPRCSR_NORDIC_INB_PIN19_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN19_Pos) /*!< Bit mask of PIN19 field.                     */
  #define VPRCSR_NORDIC_INB_PIN19_Min (0x0UL)        /*!< Min enumerator value of PIN19 field.                                 */
  #define VPRCSR_NORDIC_INB_PIN19_Max (0x1UL)        /*!< Max enumerator value of PIN19 field.                                 */
  #define VPRCSR_NORDIC_INB_PIN19_LOW (0x0UL)        /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_INB_PIN19_HIGH (0x1UL)       /*!< Pin is High                                                          */

/* PIN20 @Bit 20 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN20_Pos (20UL)         /*!< Position of PIN20 field.                                             */
  #define VPRCSR_NORDIC_INB_PIN20_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN20_Pos) /*!< Bit mask of PIN20 field.                     */
  #define VPRCSR_NORDIC_INB_PIN20_Min (0x0UL)        /*!< Min enumerator value of PIN20 field.                                 */
  #define VPRCSR_NORDIC_INB_PIN20_Max (0x1UL)        /*!< Max enumerator value of PIN20 field.                                 */
  #define VPRCSR_NORDIC_INB_PIN20_LOW (0x0UL)        /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_INB_PIN20_HIGH (0x1UL)       /*!< Pin is High                                                          */

/* PIN21 @Bit 21 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN21_Pos (21UL)         /*!< Position of PIN21 field.                                             */
  #define VPRCSR_NORDIC_INB_PIN21_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN21_Pos) /*!< Bit mask of PIN21 field.                     */
  #define VPRCSR_NORDIC_INB_PIN21_Min (0x0UL)        /*!< Min enumerator value of PIN21 field.                                 */
  #define VPRCSR_NORDIC_INB_PIN21_Max (0x1UL)        /*!< Max enumerator value of PIN21 field.                                 */
  #define VPRCSR_NORDIC_INB_PIN21_LOW (0x0UL)        /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_INB_PIN21_HIGH (0x1UL)       /*!< Pin is High                                                          */

/* PIN22 @Bit 22 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN22_Pos (22UL)         /*!< Position of PIN22 field.                                             */
  #define VPRCSR_NORDIC_INB_PIN22_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN22_Pos) /*!< Bit mask of PIN22 field.                     */
  #define VPRCSR_NORDIC_INB_PIN22_Min (0x0UL)        /*!< Min enumerator value of PIN22 field.                                 */
  #define VPRCSR_NORDIC_INB_PIN22_Max (0x1UL)        /*!< Max enumerator value of PIN22 field.                                 */
  #define VPRCSR_NORDIC_INB_PIN22_LOW (0x0UL)        /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_INB_PIN22_HIGH (0x1UL)       /*!< Pin is High                                                          */

/* PIN23 @Bit 23 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN23_Pos (23UL)         /*!< Position of PIN23 field.                                             */
  #define VPRCSR_NORDIC_INB_PIN23_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN23_Pos) /*!< Bit mask of PIN23 field.                     */
  #define VPRCSR_NORDIC_INB_PIN23_Min (0x0UL)        /*!< Min enumerator value of PIN23 field.                                 */
  #define VPRCSR_NORDIC_INB_PIN23_Max (0x1UL)        /*!< Max enumerator value of PIN23 field.                                 */
  #define VPRCSR_NORDIC_INB_PIN23_LOW (0x0UL)        /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_INB_PIN23_HIGH (0x1UL)       /*!< Pin is High                                                          */

/* PIN24 @Bit 24 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN24_Pos (24UL)         /*!< Position of PIN24 field.                                             */
  #define VPRCSR_NORDIC_INB_PIN24_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN24_Pos) /*!< Bit mask of PIN24 field.                     */
  #define VPRCSR_NORDIC_INB_PIN24_Min (0x0UL)        /*!< Min enumerator value of PIN24 field.                                 */
  #define VPRCSR_NORDIC_INB_PIN24_Max (0x1UL)        /*!< Max enumerator value of PIN24 field.                                 */
  #define VPRCSR_NORDIC_INB_PIN24_LOW (0x0UL)        /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_INB_PIN24_HIGH (0x1UL)       /*!< Pin is High                                                          */

/* PIN25 @Bit 25 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN25_Pos (25UL)         /*!< Position of PIN25 field.                                             */
  #define VPRCSR_NORDIC_INB_PIN25_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN25_Pos) /*!< Bit mask of PIN25 field.                     */
  #define VPRCSR_NORDIC_INB_PIN25_Min (0x0UL)        /*!< Min enumerator value of PIN25 field.                                 */
  #define VPRCSR_NORDIC_INB_PIN25_Max (0x1UL)        /*!< Max enumerator value of PIN25 field.                                 */
  #define VPRCSR_NORDIC_INB_PIN25_LOW (0x0UL)        /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_INB_PIN25_HIGH (0x1UL)       /*!< Pin is High                                                          */

